[
  {
    "id": "44682964",
    "title": "It's DE9, Not DB9",
    "url": "https://news.sparkfun.com/14298",
    "summary": "This SparkFun article clarifies a common misconception regarding the 9-pin serial connector, often incorrectly called a \"DB9.\" The technically correct name is \"DE9.\" The article explains that in the D-subminiature connector standard, the first letter (\"D\") denotes the D-shape, and the second letter indicates the shell size. \"B\" signifies a 25-pin shell, while \"E\" signifies a 9-pin shell. Therefore, \"DB9\" is a misnomer because it combines the 25-pin shell designation with a 9-pin count.\n\nThe article attributes the widespread use of \"DB9\" to a historical accident: the original IBM PC used a DB25 for serial/parallel, and when the smaller 9-pin connector was introduced, people simply adapted the existing term.\n\nSparkFun chose to name their new DE9 connector breakouts accurately, despite knowing that most people search for \"DB9.\" They emphasize the importance of technical accuracy and hope to educate the community through their product naming. They believe that using \"DE9\" is a small step toward correcting a long-standing mix-up.\n",
    "chinese_title": "是DE9，不是DB9",
    "chinese_summary": "这篇SparkFun文章澄清了一个关于9针串口连接器的常见误解，该连接器常被错误地称为“DB9”。 从技术上讲，正确的名称是“DE9”。 文章解释说，在D-sub微型连接器标准中，第一个字母(“D”)表示D形，第二个字母表示外壳尺寸。“B”表示25针外壳，而“E”表示9针外壳。 因此，“DB9”是一个用词不当的名称，因为它将25针外壳的标识与9针计数结合在一起。\n\n这篇文章将“DB9”的广泛使用归因于一个历史性的偶然：最初的IBM PC使用DB25进行串行/并行传输，当引入较小的9针连接器时，人们只是简单地沿用了现有的术语。\n\n尽管知道大多数人搜索“DB9”，SparkFun还是选择准确地命名他们的新DE9连接器分线板。 他们强调技术准确性的重要性，并希望通过他们的产品命名来教育社区。 他们认为使用“DE9”是纠正长期混淆的一小步。"
  },
  {
    "id": "44683682",
    "title": "Programming Vehicles in Games",
    "url": "https://wassimulator.com/blog/programming/programming_vehicles_in_games.html",
    "summary": "This article discusses the fundamentals of programming vehicles in games, emphasizing the balance between realistic simulation and the desired player experience. It highlights that games aren't physics engines and that manipulating reality is key to delivering a compelling driving experience, drawing a contrast between games like Mario Kart and iRacing.\n\nThe author outlines a conceptual model of vehicle simulation, breaking it down into three core components: the Engine (and Gearbox), the Wheels and Tires, and the Chassis. The Engine acts as a torque calculator influenced by throttle and gear changes, utilizing a torque curve to realistically vary power output based on RPM. The Gearbox, a simple lookup table of gear ratios, significantly impacts acceleration. Wheels and Tires involve complex physics, including tire models that determine longitudinal and lateral forces based on factors like torque, brakes, steering, weight, and friction. The Chassis, the rigid body, responds to forces from the tires and external factors.\n\nThe article stresses that no game fully simulates all aspects of vehicle dynamics and that developers need to make deliberate choices about what to simulate, fake, and cheat. The author shares their experience with AV Racer, an early attempt at vehicle simulation that relied on hacks and tricks to evoke the feeling of driving. They learned that while faking can get you far, understanding real physics is crucial for avoiding broken illusions and pushing the limits of simulation.\n",
    "chinese_title": "游戏中的车辆编程",
    "chinese_summary": "本文探讨了游戏中车辆编程的基础知识，强调了逼真模拟和期望玩家体验之间的平衡。文章指出，游戏并非物理引擎，操纵现实是提供引人入胜的驾驶体验的关键，并对比了《马里奥赛车》和《iRacing》等游戏。\n\n作者概述了一个车辆模拟的概念模型，将其分解为三个核心组件：引擎（和变速箱）、车轮和轮胎以及底盘。引擎充当扭矩计算器，受油门和换挡的影响，利用扭矩曲线根据RPM真实地改变功率输出。变速箱是一个简单的齿轮比查找表，对加速度产生重大影响。车轮和轮胎涉及复杂的物理原理，包括轮胎模型，该模型根据扭矩、刹车、转向、重量和摩擦力等因素确定纵向和横向力。底盘是刚体，对来自轮胎和外部因素的力做出反应。\n\n文章强调，没有游戏能完全模拟车辆动力学的各个方面，开发者需要有意识地选择模拟、伪造和作弊的内容。作者分享了他们在AV Racer上的经验，这是一个早期尝试车辆模拟的项目，它依赖于各种技巧和窍门来唤起驾驶的感觉。他们了解到，虽然伪造可以让你走得很远，但理解真实的物理原理对于避免破碎的幻觉和突破模拟的极限至关重要。"
  },
  {
    "id": "44682465",
    "title": "Up to date prices for LLM APIs all in one place",
    "url": "https://pricepertoken.com/",
    "summary": "This article provides up-to-date pricing information for major LLM (Large Language Model) APIs, including OpenAI, Anthropic, and Google. It allows users to compare the input and output costs (per million tokens) of various AI models to find the most cost-effective option for their specific use case. The pricing chart displays the input and output costs for a selection of 30 models. The information was last updated on July 25, 2025, and is curated by @aellman. Readers can also subscribe to a newsletter for weekly updates on LLM pricing changes and new model releases. The article highlights the importance of comparing prices due to potential tiered pricing structures based on prompt length, specifically noting that the displayed prices are for prompts of 200,000 tokens or less for some models.\n",
    "chinese_title": "LLM API 最新价格一览",
    "chinese_summary": "本文提供OpenAI、Anthropic和Google等主要LLM（大型语言模型）API的最新定价信息。用户可以比较各种AI模型的输入和输出成本（每百万tokens），以找到最适合其特定用例的性价比最高的选择。定价图表显示了30种模型的输入和输出成本。该信息最后更新于2025年7月25日，由@aellman整理。读者还可以订阅新闻邮件，每周获取LLM定价变化和新模型发布的更新。文章强调了比较价格的重要性，因为存在基于提示长度的分级定价结构，特别指出显示的某些模型的价格适用于20万tokens或以下的提示。"
  },
  {
    "id": "44682932",
    "title": "Who has the fastest F1 website (2021)",
    "url": "https://jakearchibald.com/2021/f1-perf-part-3/",
    "summary": "This article is part 3 of a series analyzing the website loading performance of Formula 1 teams. In this installment, the Red Bull Racing Honda website is evaluated. The author finds Red Bull's site to be graphically rich and engaging, with a significant performance improvement compared to their 2019 site, clocking in at a total load time of 8.6 seconds.\n\nHowever, the analysis identifies several areas for improvement. Key issues include an unnecessary 3-second delay caused by excessive inlining of CSS (much of which is unused), and a 10-second delay due to using JavaScript for responsive images instead of native responsive image implementation. Additional delays are attributed to extra connections for images and fonts, poor image optimization, and a slow-loading cookie modal.\n\nThe author pinpoints problems with a large primary WebP image and an overlay image loaded with JavaScript. The overlay image's alpha channel is poorly optimized for WebP, and the author suggests using AVIF for better results. The author also criticizes the large, blurred inlined image used as a preview, suggesting alternatives for better optimization and visual accuracy.\n\nBy addressing these issues, the author estimates that Red Bull could further reduce their website's load time, potentially achieving an optimized load time of 4.6 seconds. As of this article, Red Bull leads the scoreboard in website performance among the teams tested. The author will continue to analyze other F1 team websites in upcoming parts.\n",
    "chinese_title": "谁拥有最快的F1网站(2021)",
    "chinese_summary": "本文是分析一级方程式车队网站加载性能系列文章的第三部分。 本期评估红牛本田车队的网站。 作者发现红牛的网站在图形方面内容丰富且引人入胜，与2019年的网站相比，性能有了显着提高，总加载时间为8.6秒。\n\n然而，分析发现了一些需要改进的地方。 主要问题包括过度内联CSS（其中大部分未使用）导致的不必要的3秒延迟，以及由于使用JavaScript实现响应式图像而不是原生响应式图像实现导致的10秒延迟。 其他延迟归因于图像和字体的额外连接、糟糕的图像优化以及加载缓慢的Cookie模态框。\n\n作者指出了一个大型主WebP图像和用JavaScript加载的覆盖图像的问题。 覆盖图像的alpha通道对WebP的优化效果不佳，作者建议使用AVIF以获得更好的效果。 作者还批评了用作预览的大型模糊内联图像，并建议使用其他替代方案以实现更好的优化和视觉准确性。\n\n通过解决这些问题，作者估计红牛可以进一步缩短其网站的加载时间，可能实现4.6秒的优化加载时间。 截至本文发表时，红牛在所测试车队的网站性能方面处于领先地位。 作者将在接下来的文章中继续分析其他F1车队的网站。"
  },
  {
    "id": "44685067",
    "title": "CO2 Battery",
    "url": "https://energydome.com/co2-battery/",
    "summary": "Energy Dome's CO2 Battery offers a cost-effective and efficient solution for long-duration energy storage, aiming to replace lithium-ion batteries. It achieves this through a closed thermo-mechanical transformation, manipulating CO2 between its gaseous and liquid phases to store and release energy. The process involves evaporating and expanding CO2 to turn a turbine and generate electricity, boasting over 75% round-trip efficiency with no performance degradation over a 30+ year lifespan.\n\nThe CO2 Battery's benefits include its global deployability, using readily available and eco-friendly materials like water, steel, and CO2, eliminating reliance on rare metals like lithium. It operates at ambient temperatures, drastically reducing costs compared to compressed air energy storage, and generates zero CO2 emissions during operation.\n\nEnergy Dome highlights the scalability and modularity of the CO2 Battery, emphasizing its integration of standard, off-the-shelf components for ease of deployment and cost-effectiveness worldwide. It offers various grid services, including time-shifting, physical inertia, frequency containment, and voltage regulation, making it a versatile solution for grid stabilization. The company has also announced strategic partnerships, including one with Google, and is expanding its global presence with a new headquarters in the Asia-Pacific region.\n",
    "chinese_title": "二氧化碳电池",
    "chinese_summary": "能源穹顶的二氧化碳电池为长时储能提供了一种经济高效的解决方案，旨在取代锂离子电池。它通过封闭的热机械转化来实现这一点，通过操纵二氧化碳在其气态和液态之间转换来储存和释放能量。该过程包括蒸发和膨胀二氧化碳以驱动涡轮机并产生电力，拥有超过75%的往返效率，且在30年以上的使用寿命中性能不会下降。\n\n二氧化碳电池的优势包括其全球可部署性，使用容易获得且环保的材料，如水、钢和二氧化碳，从而消除了对锂等稀有金属的依赖。它在环境温度下运行，与压缩空气储能相比，大大降低了成本，并且在运行过程中产生零二氧化碳排放。\n\n能源穹顶强调了二氧化碳电池的可扩展性和模块化，强调其集成了标准的、现成的组件，以便于在全球范围内部署和降低成本。它提供各种电网服务，包括时间转移、物理惯性、频率控制和电压调节，使其成为电网稳定的多功能解决方案。该公司还宣布了包括与谷歌在内的战略合作伙伴关系，并正在通过在亚太地区设立新的总部来扩大其全球影响力。"
  },
  {
    "id": "44685445",
    "title": "How to configure X11 in a simple way",
    "url": "https://eugene-andrienko.com/en/it/2025/07/24/x11-configuration-simple.html",
    "summary": "This article details how to configure X11 on FreeBSD to achieve a well-configured desktop environment using simple, mature utilities, avoiding the bloat of full-scale desktop environments. It covers essential aspects like High DPI setup, keyboard configuration, pointing devices, screen savers, compositors, and default application assignments.\n\n**High DPI:** Instead of environment variables, setting \"DisplaySize\" in xorg.conf directly affects the entire system's DPI, solving scaling issues. A specific fix for Librewolf involves adjusting `ui.textScaleFactor` in `about:config`.\n\n**Keyboard:** The article explains how to configure keyboard layouts, switching keys, compose keys, and CapsLock remapping using `setxkbmap` and `xmodmap`. The configuration is then translated to xorg.conf for system-wide application.\n\n**Multimedia Keys:**  The author uses `xev` to detect keycodes and then maps them in the WM's configuration file (StumpWM in this case).\n\n**Pointing Devices:** Touchpad is disabled, Trackpoint used without configuration, and the Logitech Trackman Marble trackball's button mappings and scrolling emulation are customized in xorg.conf.\n\n**Screensaver:** Details on using XScreenSaver and disabling it for fullscreen videos using `xscreensaver-command`.\n\n**Compositor:** Configuration using `xcompmgr` for transparency and shadows.\n\n**Default Applications:** The article discusses how to configure xdg-utils to use Emacs Dired for file management, Emacs Compose mode for email, nSxiv for images, MPV for video/audio, and Emacs PDF-tools for PDF viewing.\n\n**Aesthetics:** Instructions are given for changing cursor themes, GTK themes, Qt themes, Librewolf themes, fonts, and icons by editing configuration files.\n",
    "chinese_title": "如何简单配置X11",
    "chinese_summary": "FreeBSD 上配置 X11 打造精简桌面环境：本文详述如何在 FreeBSD 上配置 X11，使用简单成熟的工具打造配置良好的桌面环境，避免臃肿的大型桌面环境。内容涵盖高 DPI 设置、键盘配置、指点设备、屏幕保护程序、合成器和默认应用程序分配等关键方面。\n\n**高 DPI：** 避免使用环境变量，直接在 xorg.conf 中设置 \"DisplaySize\" 可影响整个系统的 DPI，解决缩放问题。针对 Librewolf 的特定修复包括在 `about:config` 中调整 `ui.textScaleFactor`。\n\n**键盘：** 本文解释了如何使用 `setxkbmap` 和 `xmodmap` 配置键盘布局、切换键、组合键和 CapsLock 键重映射。然后将配置转换为 xorg.conf，以便在系统范围内应用。\n\n**多媒体键：** 作者使用 `xev` 检测键码，然后在 WM 的配置文件（本例中为 StumpWM）中进行映射。\n\n**指点设备：** 触摸板被禁用，Trackpoint 无需配置即可使用，Logitech Trackman Marble 轨迹球的按钮映射和滚动模拟在 xorg.conf 中进行自定义。\n\n**屏幕保护程序：** 详细介绍了如何使用 XScreenSaver 以及如何使用 `xscreensaver-command` 为全屏视频禁用它。\n\n**合成器：** 使用 `xcompmgr` 进行配置，实现透明和阴影效果。\n\n**默认应用程序：** 本文讨论了如何配置 xdg-utils 以使用 Emacs Dired 进行文件管理，Emacs Compose 模式进行电子邮件，nSxiv 用于图像，MPV 用于视频/音频，以及 Emacs PDF-tools 用于 PDF 查看。\n\n**美学：** 提供了通过编辑配置文件来更改光标主题、GTK 主题、Qt 主题、Librewolf 主题、字体和图标的说明。"
  },
  {
    "id": "44685587",
    "title": "The sad state of font rendering on Linux",
    "url": "https://pandasauce.org/post/linux-fonts/",
    "summary": "This article criticizes font rendering on Linux, arguing that it lags behind Windows in terms of readability and aesthetic appeal due to issues with sub-pixel rendering, hinting, and positioning. The author, biased towards Windows' ClearType rendering, explains basic font rendering concepts and compares implementations across Windows, macOS, and Linux.\n\nWindows is praised for its advanced use of technology, while macOS is criticized for its blurry and inconsistent rendering, particularly after ditching sub-pixel anti-aliasing.\n\nThe article dives into the FreeType library used by Linux, exploring different rendering engines (v35, v38, v40) and the autohinter, highlighting their trade-offs. The author favors the v38 engine, with v40 as a second choice in less ideal conditions.\n\nThe core issue on Linux, regardless of the engine, is identified as incorrect kerning and letter spacing due to a lack of sub-pixel grid support, leading to visually unappealing gaps between characters. While Google's Skia offers a solution with sub-pixel positioning, it's not widely adopted or enabled by default. Progress is being made with Cairo's recent support for sub-pixel positioning, potentially improving text rendering in GTK and other applications.  The author highlights the irony of some Windows users using MacType to mimic the blurry OS X font rendering on Windows. The article ends by illustrating the difficulty and frustration associated with sub-pixel rendering, emphasizing that fixing the lack of sub-pixel positioning is complex and requires a great amount of effort.\n",
    "chinese_title": "Linux 上字体渲染的糟糕现状",
    "chinese_summary": "本文批评了 Linux 上的字体渲染，认为由于亚像素渲染、微调和定位等方面的问题，其在可读性和美观性方面落后于 Windows。作者倾向于 Windows 的 ClearType 渲染，解释了基本的字体渲染概念，并比较了 Windows、macOS 和 Linux 上的实现。\n\nWindows 因其先进的技术应用而受到赞扬，而 macOS 则因其模糊和不一致的渲染而受到批评，尤其是在放弃亚像素抗锯齿之后。\n\n本文深入研究了 Linux 使用的 FreeType 库，探讨了不同的渲染引擎（v35、v38、v40）和自动微调器，强调了它们的权衡。作者偏爱 v38 引擎，在不太理想的条件下，v40 是第二选择。\n\n无论使用何种引擎，Linux 上的核心问题都被认为是由于缺乏亚像素网格支持而导致的错误的字距调整和字母间距，从而导致字符之间出现视觉上不吸引人的间隙。虽然 Google 的 Skia 提供了亚像素定位的解决方案，但它尚未被广泛采用或默认启用。 Cairo 最近对亚像素定位的支持正在取得进展，这可能会改善 GTK 和其他应用程序中的文本渲染。 作者强调，一些 Windows 用户使用 MacType 在 Windows 上模拟模糊的 OS X 字体渲染，这具有讽刺意味。 文章最后阐述了与亚像素渲染相关的困难和挫败感，强调修复缺乏亚像素定位的问题非常复杂，需要付出巨大的努力。"
  },
  {
    "id": "44684168",
    "title": "nullable but not null",
    "url": "https://efe.me/posts/nullable-but-not-null/",
    "summary": "This article addresses the common issue of nullable database fields that, in practice, never contain null values, particularly in evolving backend applications. It highlights that while fields are often initially made nullable to facilitate easier migrations (e.g., when adding a new column), developers frequently forget to update the schema to make them non-nullable after backfilling existing data.\n\nThe author argues this mismatch between the schema and the actual data can lead to confusion, missed constraints, and unnecessary complexity in the code. Leaving fields as nullable when they're effectively required makes the data model harder to trust and represents a missed opportunity for clarity and safety.\n\nTo address this, the article presents a Python script (using Django ORM) to analyze all models and identify nullable fields that have a 0% null value percentage. This script determines the percentage of null values for each nullable field in each model and provides a report indicating potential candidates for becoming non-nullable.\n\nThe author suggests integrating this analysis into a command-line tool, admin report, or health check. The key takeaway is that fields intended to be required should be reflected as such in the database schema to ensure data integrity and a more reliable application. Rectifying these \"nullable but not null\" fields contributes to a cleaner, more accurate data model and a healthier application overall.\n",
    "chinese_title": "可空但非空",
    "chinese_summary": "本文探讨了在后端应用程序演进过程中常见的可空数据库字段实际上从不包含空值的问题。文章指出，虽然最初将字段设置为可空通常是为了方便迁移（例如，添加新列时），但开发人员经常忘记在回填现有数据后更新模式，使其变为不可空。\n\n作者认为，模式与实际数据之间的这种不匹配可能导致混淆、约束缺失以及代码中不必要的复杂性。当字段实际上是必需的时，将其保留为可空会使数据模型更难信任，并错失了提高清晰度和安全性的机会。\n\n为了解决这个问题，本文介绍了一个 Python 脚本（使用 Django ORM）来分析所有模型，并识别空值百分比为 0% 的可空字段。该脚本确定每个模型中每个可空字段的空值百分比，并提供一份报告，指出可能适合变为不可空的字段。\n\n作者建议将此分析集成到命令行工具、管理报告或健康检查中。关键在于，旨在成为必需的字段应在数据库模式中反映出来，以确保数据完整性和更可靠的应用程序。纠正这些“可空但非空”字段有助于建立更清晰、更准确的数据模型，并使应用程序整体更加健康。"
  },
  {
    "id": "44685119",
    "title": "Why MIT Switched from Scheme to Python (2009)",
    "url": "https://www.wisdomandwonder.com/link/2110/why-mit-switched-from-scheme-to-python",
    "summary": "The article explains why MIT switched from Scheme to Python for its introductory programming course, 6.001. According to Gerald Sussman, the change reflected the evolution of programming from a deliberate, theoretical exercise to a more empirical, \"mucking around\" approach.\n\nIn the 1980s, Sussman explained, programmers designed efficient, understandable code with a deep understanding of the underlying system. 6.001 aimed to teach students how to build complex systems from fully understood components.\n\nHowever, by the 1990s and 2000s, programming involved working with poorly documented libraries and unfamiliar code. Programmers needed to experiment and reverse-engineer to understand how these components worked. This required a different skill set, prompting the need for a new approach to 6.001.\n\nThe redesigned course became robot-centered, requiring students to program a robot. This introduced challenges not found in idealized systems, such as wheel slippage and environmental variability, demanding robust system design.\n\nThe switch to Python was primarily driven by its existing library for the robotics interface, making it a practical choice for the new course. While Scheme emphasized theoretical understanding, Python facilitated the practical, experimental approach needed for modern programming challenges.\n",
    "chinese_title": "MIT为何从Scheme切换到Python (2009)",
    "chinese_summary": "本文阐述了麻省理工学院为何将其入门编程课程 6.001 从 Scheme 语言切换到 Python 语言。据 Gerald Sussman 称，这一转变反映了编程从一种深思熟虑的理论实践演变为一种更具经验性的“摸索”方法。\n\nSussman 解释说，在 20 世纪 80 年代，程序员通过对底层系统的深刻理解来设计高效、易懂的代码。6.001 旨在教导学生如何从完全理解的组件构建复杂的系统。\n\n然而，到了 20 世纪 90 年代和 21 世纪 2000 年代，编程涉及到使用文档匮乏的库和不熟悉的代码。程序员需要通过实验和逆向工程来理解这些组件的工作原理。 这需要不同的技能组合，促使 6.001 需要一种新的方法。\n\n重新设计的课程以机器人为中心，要求学生为机器人编程。这引入了在理想化系统中找不到的挑战，例如车轮打滑和环境可变性，这需要强大的系统设计。\n\n切换到 Python 的主要原因是其现有的机器人接口库，使其成为新课程的实用选择。虽然 Scheme 强调理论理解，但 Python 促进了现代编程挑战所需的实用、实验性方法。"
  },
  {
    "id": "44683490",
    "title": "Show HN: The Montana MiniComputer",
    "url": "https://mtmc.cs.montana.edu/",
    "summary": "The Montana Mini-Computer (MTMC-16) is a virtual, educational computer designed to visually demonstrate digital computation. Inspired by architectures like the PDP-11, MIPS, Scott CPU, Game Boy, and JVM, the MTMC-16 is a simplified 16-bit computer capable of basic computing tasks.\n\nIt's accessed via a web interface featuring a console, display, code editor, and visual representations of the computer's internal state, facilitating software construction and debugging.\n\nKey specifications include:\n\n*   16-bit architecture\n*   Byte-addressable memory with 4KB (4096 bytes/addresses, 2048 words)\n*   16 registers\n*   160x144 2-bit grayscale display\n*   Text-based console I/O\n*   Included operating system (MTOS)\n\nThe MTMC-16 uses signed 16-bit integers and bytes as core data types.\n\nThe project, available on GitHub, includes a downloadable JAR file, a Quick Start Guide, computer specifications, assembly language guide, and FAQs. It requires a desktop computer, virtual machine, or server with Java 21+ and a modern web browser. It has many references to existing architectures, guides, and related technologies, highlighting its educational aim.\n",
    "chinese_title": "展示 HN：蒙大拿迷你计算机",
    "chinese_summary": "蒙大拿微型计算机 (MTMC-16) 是一款虚拟教育计算机，旨在直观地演示数字计算。它受 PDP-11、MIPS、Scott CPU、Game Boy 和 JVM 等架构的启发，是一款简化的 16 位计算机，能够执行基本的计算任务。\n\n它通过一个 Web 界面访问，该界面具有控制台、显示器、代码编辑器和计算机内部状态的可视化表示，从而方便软件构建和调试。\n\n主要规格包括：\n\n*   16 位架构\n*   字节寻址内存，容量为 4KB（4096 字节/地址，2048 字）\n*   16 个寄存器\n*   160x144 2 位灰度显示\n*   基于文本的控制台 I/O\n*   包含操作系统 (MTOS)\n\nMTMC-16 使用带符号的 16 位整数和字节作为核心数据类型。\n\n该项目在 GitHub 上提供，包括可下载的 JAR 文件、快速入门指南、计算机规格、汇编语言指南和常见问题解答。它需要一台装有 Java 21+ 和现代 Web 浏览器的台式电脑、虚拟机或服务器。它包含许多对现有架构、指南和相关技术的引用，突出了其教育目标。"
  },
  {
    "id": "44684212",
    "title": "Quantum Scientists Have Built a New Math of Cryptography",
    "url": "https://www.quantamagazine.org/quantum-scientists-have-built-a-new-math-of-cryptography-20250725/",
    "summary": "This article discusses a new approach to quantum cryptography that aims to overcome the limitations of traditional cryptography, which relies on the difficulty of certain mathematical problems. If these problems are solved, classical cryptography collapses.\n\nResearchers are exploring quantum physics to create a more secure cryptographic system. A recent paper details a path to quantum cryptography that bypasses the need for those hard mathematical problems. This new approach, developed by Dakshita Khurana and Kabir Tomer, focuses on quantum versions of one-way functions and introduces a concept called \"one-way puzzles.\" These puzzles, involving a perplexing mix of quantum and classical properties, generate locks and keys that are easy to generate but hard to open, even with the key.\n\nThe researchers connected these one-way puzzles directly to a potentially more secure mathematical bedrock: the matrix permanent problem, known for its extreme difficulty and lack of a simple solution-checking method. By linking the security of quantum cryptography to the difficulty of solving the matrix permanent problem and to proving quantum computational advantages over classical computers, they have created a foundation that could potentially make quantum cryptography far more robust than current classical methods. While the technology is not yet ready for immediate implementation, this research provides a significant step toward a more secure future for cryptography.\n",
    "chinese_title": "量子科学家构建了一种新的密码学数学",
    "chinese_summary": "本文探讨了一种新的量子密码学方法，旨在克服传统密码学的局限性。传统密码学依赖于某些数学难题的难度，一旦这些难题被解决，经典密码学就会崩溃。\n\n研究人员正在探索量子物理学，以创建更安全的密码系统。最近的一篇论文详细介绍了一条通往量子密码学的路径，该路径绕过了对那些复杂数学难题的需求。这种由Dakshita Khurana和Kabir Tomer开发的新方法，侧重于单向函数的量子版本，并引入了一个名为“单向谜题”的概念。这些谜题涉及量子和经典属性的复杂混合，生成易于生成但难以打开的锁和密钥，即使使用密钥也是如此。\n\n研究人员将这些单向谜题直接与一个潜在的更安全的数学基石联系起来：矩阵永久量问题，该问题以其极高的难度和缺乏简单的解法验证方法而闻名。通过将量子密码学的安全性与解决矩阵永久量问题的难度以及证明量子计算优于经典计算机的优势联系起来，他们创造了一个基础，该基础可能使量子密码学比当前的经典方法更加强大。虽然该技术尚未准备好立即实施，但这项研究为密码学更安全的未来迈出了重要一步。"
  },
  {
    "id": "44684720",
    "title": "Show HN: A macOS clock that stays visible when coding or binging in fullscreen",
    "url": "https://cornertime.app/en",
    "summary": "Corner Time is a macOS utility app designed for users who prefer a minimalist, distraction-free workspace by hiding the menu bar. It addresses the inconvenience of needing to reveal the menu bar just to check the time by displaying a customizable clock in a corner of the screen.\n\nThe app stays visible even in fullscreen mode, thanks to its \"Over Apps\" window level setting.  Users can customize the clock's appearance with options for 12/24 hour format, display of seconds, date, and day, custom formats, and various fonts (with local fonts planned). It also offers multi-display support, allowing users to enable or disable the clock on individual screens. The clock automatically displays time in the user's system language and supports 10 languages currently.\n\nUser testimonials highlight Corner Time's usefulness for those who hide the menu bar and Dock for a clean look, praising its simplicity, functionality, and thoughtful customization options.\n\nThe app costs $1.99, requires macOS 13.0 or later, and is a small 525 KB download. It's marketed as a solution for digital minimalism and uninterrupted workflows, offering a native-like experience for always-visible time access. The developer offers a press kit and contact information for inquiries.\n",
    "chinese_title": "Show HN: 一款在全屏编码或煲剧时保持可见的macOS时钟",
    "chinese_summary": "Corner Time：一款macOS实用工具，专为喜欢极简、无干扰工作空间的用户设计，它通过隐藏菜单栏来实现这一点。它解决了一直需要显示菜单栏才能查看时间的麻烦，在屏幕角落显示一个可自定义的时钟。\n\n由于其“置于应用之上”的窗口层级设置，该应用即使在全屏模式下也保持可见。用户可以自定义时钟的外观，包括 12/24 小时制格式、秒、日期和星期显示、自定义格式以及各种字体（计划支持本地字体）。它还提供多显示器支持，允许用户在单个屏幕上启用或禁用时钟。时钟自动以用户系统语言显示时间，目前支持 10 种语言。\n\n用户评价强调了 Corner Time 对那些为了获得简洁外观而隐藏菜单栏和 Dock 的用户的实用性，赞扬了它的简单性、功能性和周到的自定义选项。\n\n该应用售价 1.99 美元，需要 macOS 13.0 或更高版本，并且下载文件很小，仅为 525 KB。它被定位为数字极简主义和不间断工作流程的解决方案，为始终可见的时间访问提供原生般的体验。开发者提供媒体资料包和联系信息以供查询。"
  },
  {
    "id": "44685669",
    "title": "Implementing a Functional Language with Graph Reduction",
    "url": "https://thma.github.io/posts/2021-12-27-Implementing-a-functional-language-with-Graph-Reduction.html",
    "summary": "This article describes the implementation of a small functional language using graph reduction in Haskell. It breaks down the process into three main parts: parsing, compilation, and graph reduction.\n\nThe language is based on the untyped lambda calculus, extended with integers and a top-level environment for named expressions. The parser, derived from \"A Combinatory Compiler,\" converts source code into an internal representation using the `Expr` data type.\n\nThe compiler transforms lambda expressions into combinatory logic using bracket abstraction, eliminating variables by rewriting terms in terms of S, K, and I combinators (and B, C for optimization). The article highlights the issue of combinator term size and introduces optimization techniques, including rules to simplify expressions and improve efficiency.\n\nThe core of the implementation is the graph reducer. Combinator terms are represented as a binary graph using mutable references (`STRef`) to enable node sharing and in-place reduction. The article explains graph reduction, demonstrating how it achieves normal-order (lazy) evaluation, avoids redundant computations, and manages variable scope implicitly. A detailed example illustrates the reduction process with the `sqr` function, tracing the graph's transformations through multiple steps as S, I, MUL, and ADD combinators are applied. The code examples provide the data structures and functions to allocate a graph structure.\n",
    "chinese_title": "使用图归约实现函数式语言",
    "chinese_summary": "本文介绍了使用 Haskell 通过图归约实现小型函数式语言的过程。它将该过程分解为三个主要部分：解析、编译和图归约。\n\n该语言基于无类型 lambda 演算，并扩展了整数和一个用于命名表达式的顶层环境。解析器源自“A Combinatory Compiler”，它使用 `Expr` 数据类型将源代码转换为内部表示形式。\n\n编译器使用括号抽象将 lambda 表达式转换为组合子逻辑，通过使用 S、K 和 I 组合子（以及 B、C 用于优化）重写项来消除变量。本文重点介绍了组合子项大小的问题，并介绍了优化技术，包括简化表达式和提高效率的规则。\n\n实现的核心是图归约器。组合子项表示为一个二叉图，使用可变引用 (`STRef`) 以启用节点共享和就地归约。本文解释了图归约，展示了它如何实现正规序（惰性）求值、避免冗余计算并隐式管理变量作用域。一个详细的例子说明了 `sqr` 函数的归约过程，通过多个步骤跟踪图的转换，其中应用了 S、I、MUL 和 ADD 组合子。代码示例提供了分配图结构的数据结构和函数。"
  },
  {
    "id": "44641729",
    "title": "Nvidia Launches Family of Open Reasoning AI Models: OpenReasoning Nemotron",
    "url": "https://nvidianews.nvidia.com/news/nvidia-launches-family-of-open-reasoning-ai-models-for-developers-and-enterprises-to-build-agentic-ai-platforms",
    "summary": "NVIDIA has launched the open Llama Nemotron family of AI models with reasoning capabilities, designed to help developers and enterprises build advanced AI agents for complex tasks. Built on Llama models and enhanced through NVIDIA's post-training, these models improve in areas like math, coding, reasoning, and decision-making, boasting up to 20% better accuracy and 5x faster inference speeds compared to other open reasoning models.\n\nThe Llama Nemotron family comes in Nano, Super, and Ultra sizes, delivered as NVIDIA NIM microservices, catering to different deployment needs. Key to their development was using high-quality, curated synthetic data, and the tools used for optimization will be openly available.\n\nIndustry leaders like Accenture, Microsoft, SAP, and ServiceNow are already collaborating with NVIDIA to integrate these models into their agentic AI platforms. For example, Microsoft is incorporating them into Azure AI Foundry, while SAP is using them to enhance Joule, its AI copilot.\n\nTo support the adoption of these models, NVIDIA is also offering new agentic AI tools and software as part of the NVIDIA AI Enterprise platform, including the NVIDIA AI-Q Blueprint for connecting knowledge to AI agents, the NVIDIA AI Data Platform, and new NVIDIA NIM and NeMo microservices.\n\nThe Llama Nemotron Nano and Super models are available via build.nvidia.com and Hugging Face. The NVIDIA AI-Q Blueprint is expected in April.\n",
    "chinese_title": "英伟达发布开放推理AI模型系列：OpenReasoning Nemotron",
    "chinese_summary": "英伟达推出具备推理能力的开放Llama Nemotron系列AI模型，旨在帮助开发者和企业构建用于复杂任务的先进AI智能体。这些模型基于Llama模型构建，并通过英伟达的后训练进行增强，在数学、编码、推理和决策制定等领域有所改进，与其他开放推理模型相比，准确率提高了高达20%，推理速度提高了5倍。\n\nLlama Nemotron系列提供Nano、Super和Ultra三种尺寸，以NVIDIA NIM微服务的形式交付，以满足不同的部署需求。其开发的关键在于使用高质量、精选的合成数据，用于优化的工具也将公开提供。\n\n埃森哲、微软、SAP和ServiceNow等行业领导者已经与英伟达合作，将这些模型集成到他们的智能体AI平台中。例如，微软正在将它们整合到Azure AI Foundry中，而SAP正在使用它们来增强其AI助手Joule。\n\n为了支持这些模型的采用，英伟达还在NVIDIA AI Enterprise平台中提供新的智能体AI工具和软件，包括用于将知识连接到AI智能体的NVIDIA AI-Q Blueprint、NVIDIA AI Data Platform以及新的NVIDIA NIM和NeMo微服务。\n\nLlama Nemotron Nano和Super模型可通过build.nvidia.com和Hugging Face获取。NVIDIA AI-Q Blueprint预计将于4月发布。"
  },
  {
    "id": "44661673",
    "title": "Show HN: Apple Health MCP Server",
    "url": "https://github.com/neiltron/apple-health-mcp",
    "summary": "This \"Show HN\" introduces `apple-health-mcp`, an MCP (Model Context Protocol) server that allows users to query their Apple Health data using SQL. Built on DuckDB, it provides fast and efficient analysis of health data exported from the Simple Health Export CSV iOS app.\n\nKey features include natural language query support (via MCP clients), direct SQL query execution, automated health report generation, lazy data loading with configurable time windows, and query result caching.\n\nTo use it, users need to install the Simple Health Export CSV app, export their Apple Health data, and configure Claude Desktop (or another MCP client) to point to the server, setting the `HEALTH_DATA_DIR` environment variable to the location of the exported CSV files.  Optional environment variables allow users to configure memory usage (`MAX_MEMORY_MB`) and cache size (`CACHE_SIZE`).\n\nThe server expects specific CSV file naming patterns (e.g., `HKQuantityTypeIdentifier*.csv`) and column structures (type, sourceName, startDate, endDate, value, unit). Available tools include `health_schema` (table information), `health_query` (SQL execution), and `health_report` (comprehensive reports).\n\nThe project is open-source (MIT license), and contributions are welcome, following the guidelines for code style, TypeScript types, error handling, and performance considerations. The document also provides troubleshooting tips for common issues like data loading, memory errors, and slow queries.\n",
    "chinese_title": "显示 HN：苹果健康 MCP 服务器",
    "chinese_summary": "此“Show HN”介绍 `apple-health-mcp`，一个MCP（模型上下文协议）服务器，允许用户使用SQL查询他们的Apple Health数据。它基于DuckDB构建，可对从Simple Health Export CSV iOS应用导出的健康数据进行快速高效的分析。\n\n主要功能包括自然语言查询支持（通过MCP客户端）、直接SQL查询执行、自动健康报告生成、具有可配置时间窗口的延迟数据加载以及查询结果缓存。\n\n要使用它，用户需要安装Simple Health Export CSV应用，导出他们的Apple Health数据，并配置Claude Desktop（或其他MCP客户端）以指向该服务器，同时将`HEALTH_DATA_DIR`环境变量设置为导出的CSV文件所在的位置。可选的环境变量允许用户配置内存使用量 (`MAX_MEMORY_MB`) 和缓存大小 (`CACHE_SIZE`)。\n\n该服务器期望特定的CSV文件命名模式（例如，`HKQuantityTypeIdentifier*.csv`）和列结构（类型、sourceName、startDate、endDate、value、unit）。可用工具包括 `health_schema`（表信息）、`health_query`（SQL执行）和 `health_report`（综合报告）。\n\n该项目是开源的（MIT许可），欢迎贡献，请遵循代码风格、TypeScript类型、错误处理和性能注意事项的指导原则。该文档还提供了针对常见问题的故障排除技巧，例如数据加载、内存错误和慢查询。"
  },
  {
    "id": "44657188",
    "title": "Researchers value null results, but struggle to publish them",
    "url": "https://www.nature.com/articles/d41586-025-02312-4",
    "summary": "This article discusses a survey revealing a significant disconnect between researchers' perception of null results and their publication practices. While 98% of researchers recognize the value of null results (outcomes that don't confirm a hypothesis), and 85% deem sharing them important, only 30% have attempted to publish them in journals.\n\nThe survey, conducted by Springer Nature, identified key reasons for this reluctance. A large percentage of researchers fear rejection, lack awareness of appropriate journals, worry about funding coverage, and fear negative peer perception. This reluctance creates an incomplete and potentially misleading picture of the research landscape.\n\nExperts like Marcus Munafò highlight that most scientific endeavors yield null results, making their publication crucial for a more accurate record. Furthermore, researchers who did publish null results reported benefits such as inspiring new hypotheses (39%) and preventing unnecessary duplication of research (28%). The article emphasizes the need to increase awareness of how and why to share null results and calls for changes in research productivity assessment to encourage their publication. An anonymous researcher even lamented losing two years of research due to the lack of widespread dissemination of relevant null results.\n",
    "chinese_title": "研究人员重视无效结果，但难以发表。",
    "chinese_summary": "本文讨论了一项调查，该调查揭示了研究人员对零结果的认知与他们的发表实践之间存在显著脱节。尽管98%的研究人员认识到零结果（未证实假设的结果）的价值，85%的人认为分享零结果很重要，但只有30%的人尝试在期刊上发表它们。\n\n这项由施普林格·自然进行的调查，确定了这种不情愿的主要原因。很大一部分研究人员担心被拒稿，缺乏对合适期刊的认识，担心资金覆盖问题，并害怕负面的同行看法。这种不情愿造成了不完整且可能具有误导性的研究图景。\n\n像马库斯·穆纳弗这样的专家强调，大多数科学研究都会产生零结果，因此发表零结果对于更准确的记录至关重要。此外，发表了零结果的研究人员报告了一些好处，例如激发了新的假设（39%）和防止了不必要的重复研究（28%）。本文强调需要提高对如何以及为何分享零结果的认识，并呼吁改变研究生产力评估方式，以鼓励发表零结果。一位匿名研究人员甚至感叹由于缺乏相关零结果的广泛传播而损失了两年研究时间。"
  },
  {
    "id": "44680308",
    "title": "Quantitative AI progress needs accurate and transparent evaluation",
    "url": "https://mathstodon.xyz/@tao/114910028356641733",
    "summary": "This short article, titled \"Quantitative AI progress needs accurate and transparent evaluation,\" highlights the importance of rigorous and open evaluation in the maturation of AI technology. The author, Terence Tao, implies that as AI technologies become more advanced, the emphasis should shift from simply demonstrating progress to more precisely measuring and understanding that progress through quantitative methods.\n\nThe article, which appears to be a post on Mastodon, suggests a growing need for accurate, transparent, and quantifiable metrics to assess the capabilities and limitations of AI systems. This is crucial for understanding the true state of AI development, identifying areas for improvement, and ensuring responsible and beneficial applications of the technology. The quoted text indicates Tao's belief that the focus should transition as AI matures. In essence, the article advocates for a more scientific and data-driven approach to AI evaluation as the field progresses.\n",
    "chinese_title": "量化人工智能的进步需要准确和透明的评估",
    "chinese_summary": "量化人工智能进展需要准确透明的评估\n\n这篇题为《量化人工智能进展需要准确透明的评估》的短文强调了在人工智能技术成熟过程中，严格且开放的评估的重要性。作者陶哲轩暗示，随着人工智能技术变得更加先进，重点应该从简单地展示进展转变为通过定量方法更精确地衡量和理解这种进展。\n\n这篇文章，似乎是Mastodon上的一个帖子，表明人们越来越需要准确、透明和可量化的指标来评估人工智能系统的能力和局限性。这对于理解人工智能发展的真实状态、确定需要改进的领域以及确保该技术的负责任和有益的应用至关重要。引用的文本表明了陶哲轩的观点，即随着人工智能的成熟，重点应该转变。本质上，这篇文章提倡随着该领域的进步，采用更科学和数据驱动的方法进行人工智能评估。"
  },
  {
    "id": "44683011",
    "title": "Dwl: Dwm for Wayland",
    "url": "https://codeberg.org/dwl/dwl",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Dwl: Wayland下的Dwm",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44685342",
    "title": "Internet Archive Is Now a Federal Depository Library",
    "url": "https://www.kqed.org/news/12049420/sf-based-internet-archive-is-now-a-federal-depository-library-what-does-that-mean",
    "summary": "The Internet Archive has been designated a Federal Depository Library by California Senator Alex Padilla, joining over 1,100 libraries in a network that provides public access to government documents. Padilla praised the Internet Archive's \"digital focus\" and ability to expand access to government publications in a digital age.\n\nInternet Archive founder Brewster Kahle emphasized that this designation will facilitate collaboration with other federal depository libraries, strengthening the internet ecosystem and providing better access to government materials. The Federal Depository Library Program, established in 1813, ensures government records, including maps, reports, congressional records, and books, are accessible to the public. The Internet Archive's Democracy's Library, a free online compendium of government research and publications, will benefit from this partnership, providing more reliable access to materials.\n\nHowever, the Internet Archive faces ongoing legal challenges regarding its archival practices, including lawsuits from publishers and music labels over copyright issues related to its Open Library and Great 78 Project. These lawsuits threaten the organization's existence. Despite the legal battles, Kahle maintains that the Internet Archive is fulfilling its mission to preserve and provide access to knowledge, adapting to the digital era, and helping to educate the public. The Internet Archive also operates the Wayback Machine, archiving web pages and preserving government information.\n",
    "chinese_title": "互联网档案馆现在是联邦政府文件托存图书馆",
    "chinese_summary": "互联网档案馆被加州参议员亚历克斯·帕迪利亚指定为联邦文献托存图书馆，加入了一个由1100多家图书馆组成的网络，该网络向公众提供政府文件。帕迪利亚称赞互联网档案馆的“数字化重点”及其在数字时代扩大政府出版物获取能力。\n\n互联网档案馆创始人布鲁斯特·卡利强调，这一指定将促进与其他联邦文献托存图书馆的合作，加强互联网生态系统，并提供更好的政府资料获取途径。联邦文献托存图书馆计划始于1813年，旨在确保公众可以获取政府记录，包括地图、报告、国会记录和书籍。互联网档案馆的“民主图书馆”——一个免费的政府研究和出版物在线汇编——将受益于此次合作，从而提供更可靠的资料访问。\n\n然而，互联网档案馆正面临着关于其存档实践的持续法律挑战，包括出版商和音乐公司因其开放图书馆和Great 78项目相关的版权问题提起的诉讼。这些诉讼威胁着该组织的生存。尽管面临法律诉讼，卡利坚称，互联网档案馆正在履行其保存和提供知识获取的使命，适应数字时代，并帮助教育公众。互联网档案馆还运营着Wayback Machine，用于存档网页和保存政府信息。"
  },
  {
    "id": "44678512",
    "title": "Celebrating 20 Years of MDN",
    "url": "https://developer.mozilla.org/en-US/blog/mdn-turns-20/",
    "summary": "This article celebrates the 20th anniversary of MDN Web Docs, highlighting its evolution from a community-driven wiki into a comprehensive resource for web developers. Initially focused on navigating the growing complexity of the web and promoting web standards, MDN now boasts nearly 14,000 documentation pages, over 33,000 localized articles, and compatibility data on roughly 18,000 features.\n\nThe article emphasizes MDN's impact on empowering developers of all skill levels to build a better web. The piece also describes the tradition of browser makers exchanging cakes to celebrate milestones, highlighting the spirit of collaboration within the web development community. A special thank you is extended to the web.dev team for an MDN birthday cake.\n\nThe article acknowledges the vital role of MDN's global community, comprising millions of monthly users and over 100,000 GitHub contributors. It encourages readers to share their MDN experiences and to contribute to the platform's future, emphasizing the opportunity to shape the next chapter of MDN's story. It concludes by looking forward to 20 more years of empowering developers and fostering a better web.\n",
    "chinese_title": "庆祝 MDN 二十周年",
    "chinese_summary": "本文庆祝 MDN Web Docs 成立 20 周年，重点介绍了其从社区驱动的 Wiki 发展成为 Web 开发人员的综合资源的过程。最初，MDN 致力于应对日益复杂的 Web 并推广 Web 标准，如今，它拥有近 14,000 个文档页面、超过 33,000 篇本地化文章以及约 18,000 个功能的兼容性数据。\n\n本文强调了 MDN 在帮助各种技能水平的开发人员构建更好的 Web 方面的影响。文章还描述了浏览器制造商交换蛋糕以庆祝里程碑的传统，突显了 Web 开发社区内的合作精神。特别感谢 web.dev 团队提供的 MDN 生日蛋糕。\n\n本文肯定了 MDN 全球社区的重要作用，该社区包含数百万月度用户和超过 100,000 名 GitHub 贡献者。文章鼓励读者分享他们的 MDN 体验，并为平台的未来做出贡献，强调了塑造 MDN 下一个篇章的机会。最后，文章展望未来 20 年，继续赋能开发者并促进更好的 Web 发展。"
  },
  {
    "id": "44680547",
    "title": "Games Look Bad: HDR and Tone Mapping (2017)",
    "url": "https://ventspace.wordpress.com/2017/10/20/games-look-bad-part-1-hdr-and-tone-mapping/",
    "summary": "Promit's article, \"Games Look Bad: HDR and Tone Mapping (2017),\" critiques the overuse and misuse of High Dynamic Range (HDR) and tone mapping in video games, arguing that these techniques, intended to improve visual fidelity, often result in a \"videogamey\" aesthetic that fails to emulate the realism of film or photography.\n\nThe author explains that HDR is used to store a wide range of luminance for lighting calculations, while tone mapping collapses this range for display on screens. However, game developers frequently employ \"janky\" tone maps with aggressive contrast curves, desaturation, and flawed luminance responses. Promit argues that games often blindly use the same tone mapping functions (like Reinhard, Hable, or ACES RRT) without understanding their limitations or intended use, leading to visual uniformity across games.\n\nHe contrasts this with the film industry, where careful consideration is given to color science and film stock selection to achieve specific aesthetic qualities. Arri's success with the Alexa camera, prioritizing visual appeal over pure technical specifications like resolution, highlights this point.\n\nPromit advocates for fixing tone maps by finding curves that are not overly desaturating, improve contrast transition, and utilize industry-standard tools for LUT authoring. He praises games like Resident Evil 7 (stylized contrast), Deus Ex: Mankind Divided (specific scenes), and Forza Horizon 3 (low contrast, mid-tone focus) for handling HDR effectively.\n\nUltimately, the author asserts that the problem is not solely technical but also aesthetic. Bad choices made during the output stages of the rendering pipeline are negatively impacting the overall look of games. He encourages game developers to treat tone mapping as a foundational element of visual development, focusing on aesthetic quality from the outset.\n",
    "chinese_title": "游戏画面不佳：HDR与色调映射 (2017)",
    "chinese_summary": "Promit的文章《游戏画面不佳：HDR与色调映射（2017）》批判了视频游戏中高动态范围(HDR)和色调映射的过度使用和误用，认为这些旨在提高视觉保真度的技术，往往导致一种未能模仿电影或摄影的真实感的“游戏化”美学。\n\n作者解释说，HDR用于存储照明计算的宽范围亮度，而色调映射则将此范围压缩以便在屏幕上显示。然而，游戏开发者经常使用具有激进对比度曲线、去饱和和有缺陷的亮度响应的“粗劣”色调映射。Promit认为，游戏通常盲目地使用相同的色调映射函数（如Reinhard、Hable或ACES RRT），而不了解它们的局限性或预期用途，从而导致游戏之间视觉上的统一性。\n\n他将此与电影行业进行对比，后者会仔细考虑色彩科学和胶片选择，以实现特定的美学品质。Arri的Alexa相机在视觉吸引力上优先于纯技术规格（如分辨率）的成功，突出了这一点。\n\nPromit提倡通过寻找不过度去饱和、改善对比度过渡并利用行业标准工具进行LUT创作来修复色调映射。他称赞了《生化危机7》（风格化对比度）、《杀出重围：人类分裂》（特定场景）和《极限竞速：地平线3》（低对比度，中色调焦点）等游戏，因为它们有效地处理了HDR。\n\n最终，作者断言问题不仅在于技术，还在于美学。在渲染管线的输出阶段做出的错误选择正在对游戏的整体外观产生负面影响。他鼓励游戏开发者将色调映射视为视觉开发的基础要素，从一开始就专注于美学质量。"
  },
  {
    "id": "44684373",
    "title": "Women dating safety app 'Tea' breached, users' IDs posted to 4chan",
    "url": "https://www.404media.co/women-dating-safety-app-tea-breached-users-ids-posted-to-4chan/",
    "summary": "The women's dating safety app 'Tea' has been breached, with user data, including selfies and potentially driver's licenses, exposed on 4chan. Users on 4chan claim to have found an unsecured database on Google's Firebase platform and are accessing and sharing the personal information of Tea users. Tea, an app designed for women to share information about men for safety, verifies users by requiring a selfie. The exposed data reportedly includes direct messages from two years ago. The app, which recently reached the top of the App Store charts and boasts over 1.6 million users, is now facing a significant privacy crisis. 4chan users are urging others to access the data before it is secured.\n",
    "chinese_title": "女性约会安全App“Tea”遭泄露，用户ID被发布至4chan",
    "chinese_summary": "女性约会安全应用“Tea”遭数据泄露，用户数据（包括自拍照和潜在的驾驶执照）在4chan上曝光。4chan用户声称在谷歌Firebase平台上发现了一个不安全的数据库，并正在访问和分享Tea用户的个人信息。Tea是一款旨在让女性分享男性信息以保障安全的应用程序，通过要求自拍来验证用户身份。据报道，泄露的数据包括两年前的私信。这款最近登上App Store排行榜榜首并拥有超过160万用户的应用程序，目前正面临一场重大的隐私危机。4chan用户正在敦促其他人趁数据未被保护前访问数据。"
  },
  {
    "id": "44685011",
    "title": "Steam, Itch.io Are Pulling 'Porn' Games. Critics Say It's a Slippery Slope",
    "url": "https://www.wired.com/story/steam-itchio-are-pulling-porn-games-censorship/",
    "summary": "Itch.io and Steam are removing or de-indexing adult-themed games from their platforms following pressure from Collective Shout, an organization that campaigns against the objectification and sexualization of women. This group targeted payment processors used by Steam and Itch.io, urging them to cease doing business with the platforms due to the content they host, a tactic known as financial censorship. Steam removed hundreds of titles containing alleged abuse, rape, or incest, while Itch.io de-indexed all adult NSFW games, regardless of the reason for their tagging.\n\nCritics argue this constitutes censorship, disproportionately affecting queer, female, and creators of color, even those with award-winning projects. Games addressing mental health, disordered eating, and domestic violence have been impacted, not just those with explicit sexual content. Developers express concern that payment processors hold too much power over content moderation, allowing anti-porn and anti-LGBTQ groups to dictate what can be sold.\n\nCollective Shout defends its actions by stating that it is not anti-porn in general, but opposes content depicting violence and abuse against women. They claim that games featuring rape and incest should not be protected under the guise of free speech.\n\nThe situation raises concerns about the slippery slope of censorship, the potential for conservatives to label anything they dislike as \"pornographic,\" and the impact on creators who rely on these platforms for income. Both platforms are working to comply with the demands of payment processors.\n",
    "chinese_title": "Steam和Itch.io下架“色情”游戏，评论家称此举是危险的开端。",
    "chinese_summary": "在集体呼喊组织（一个反对将女性物化和性化的组织）的压力下，Itch.io和Steam正在从其平台上移除或取消索引成人主题游戏。该组织针对Steam和Itch.io使用的支付处理商，敦促他们停止与这些平台开展业务，理由是它们托管的内容，这是一种被称为金融审查的策略。Steam移除了数百款包含据称虐待、强奸或乱伦内容的游戏，而Itch.io取消了所有成人NSFW游戏的索引，无论其标签原因如何。\n\n批评者认为这构成了审查，对酷儿、女性和有色人种创作者造成了不成比例的影响，即使是那些拥有获奖作品的创作者。涉及心理健康、饮食失调和家庭暴力的游戏也受到了影响，而不仅仅是那些包含露骨性内容的游戏。开发者表示担心支付处理商对内容审核拥有过大的权力，允许反色情和反LGBTQ群体来决定可以销售什么。\n\n集体呼喊组织为自己的行为辩护说，它并非普遍反对色情，而是反对描绘针对女性的暴力和虐待的内容。他们声称，以强奸和乱伦为主题的游戏不应在言论自由的幌子下受到保护。\n\n这种情况引发了人们对审查滑坡效应、保守派将任何他们不喜欢的东西贴上“色情”标签的可能性的担忧，以及对依赖这些平台获取收入的创作者的影响。这两个平台都在努力遵守支付处理商的要求。"
  },
  {
    "id": "44666032",
    "title": "When photography was born, fascination, obsession, and danger followed",
    "url": "https://www.washingtonpost.com/books/2025/07/12/flashes-brilliance-history-early-photography-anika-burgess-review/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "摄影诞生之初，随之而来的是着迷、痴迷和危险。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44681950",
    "title": "Lisp project of the day",
    "url": "https://40ants.com/lisp-project-of-the-day/index.html",
    "summary": "This text is a long, numbered list of Lisp projects. It appears to be a \"Lisp project of the day\" series, with each item representing a specific project. Each entry includes:\n\n*   A number, likely indicating the order in the series.\n*   The project's name.\n*   A concise description of the project's functionality, categorized by relevant areas like web development, data structures, system utilities, text processing, graphics, and more.\n\nThe projects span a wide range of applications, including web frameworks, data serialization, concurrency, system administration tools, parsing libraries, graphics libraries, documentation generators, and utilities. There's an emphasis on libraries and tools that extend the capabilities of Common Lisp. The list starts with project #0220 and counts down to project #0000, \"Day Zero,\" which is attributed to \"40Ants.\" It suggests an ongoing daily project showcase. The article indicates that supporting the projects through donations is an option, with a link to project sponsors.\n",
    "chinese_title": "今日Lisp项目",
    "chinese_summary": "这是一份冗长的、编号的Lisp项目列表。它看起来像一个“每日Lisp项目”系列，每个条目代表一个特定的项目。每个条目包括：\n\n*   一个数字，可能表示在该系列中的顺序。\n*   项目的名称。\n*   对项目功能的简明描述，按相关领域分类，如Web开发、数据结构、系统实用程序、文本处理、图形等。\n\n这些项目涵盖了广泛的应用，包括Web框架、数据序列化、并发、系统管理工具、解析库、图形库、文档生成器和实用程序。重点在于扩展Common Lisp功能的库和工具。列表从项目#0220开始倒数至项目#0000，“零日”，该项目归功于“40Ants”。这表明这是一个持续进行的每日项目展示。文章表明可以通过捐款支持这些项目，并提供了一个项目赞助商的链接。"
  },
  {
    "id": "44679854",
    "title": "Google spoofed via DKIM replay attack: A technical breakdown",
    "url": "https://easydmarc.com/blog/google-spoofed-via-dkim-replay-attack-a-technical-breakdown/",
    "summary": "This short article, titled \"Google spoofed via DKIM replay attack: A technical breakdown,\" focuses on the rising adoption of DMARC (Domain-based Message Authentication, Reporting & Conformance) amongst large corporations. Specifically, it contrasts DMARC adoption rates within the Fortune 500 and the Inc. 5000. The article, published on July 25, 2025, highlights a disparity, likely indicating a significant difference in the implementation of email security between the largest and the rapidly growing companies. The core implication is that a growing divide exists in email security practices. The title referencing a \"DKIM replay attack\" suggests that the article likely explains how such attacks can be used to spoof email messages and bypass security measures. DMARC, being a key defense against such attacks, is therefore vital. The overall message points towards the importance of DMARC adoption as a critical security measure, particularly in light of sophisticated spoofing techniques, and underlines that its implementation is not universally consistent across different sizes and types of organizations.\n",
    "chinese_title": "通过 DKIM 重放攻击仿冒 Google：技术分析",
    "chinese_summary": "名为“通过DKIM重放攻击欺骗谷歌：技术解析”的这篇短文，重点关注大型企业对DMARC（基于域的消息认证、报告和一致性）日益增长的采用率。具体而言，它对比了财富500强和Inc. 5000强公司中DMARC的采用率。该文章于2025年7月25日发表，突出了一个差异，可能表明最大型公司和快速增长的公司在电子邮件安全实施方面存在显着差异。核心含义是电子邮件安全实践中存在越来越大的差距。标题中提到的“DKIM重放攻击”表明，该文章可能解释了如何利用此类攻击来欺骗电子邮件并绕过安全措施。DMARC作为防御此类攻击的关键手段，因此至关重要。总的来说，该信息指向DMARC的采用作为一项关键安全措施的重要性，尤其是在复杂的欺骗技术面前，并强调其在不同规模和类型的组织中的实施并不普遍一致。"
  },
  {
    "id": "44637532",
    "title": "Brazil central bank to launch Pix installment feature in September",
    "url": "https://www.reuters.com/technology/brazil-central-bank-launch-pix-installment-feature-september-2025-04-03/",
    "summary": "Brazil's central bank is planning to launch an installment payment feature for its instant payment system, Pix, in September 2024. This new functionality, dubbed \"Pix Garantido\" (Guaranteed Pix), will allow users to pay for goods and services in installments using the Pix system, similar to how credit cards work.\n\nThe goal of \"Pix Garantido\" is to further expand the use of Pix, which has already become incredibly popular in Brazil, by offering an alternative to credit cards for larger purchases. Merchants are expected to benefit from lower transaction fees compared to credit card payments, while consumers will gain a convenient and potentially cheaper installment option.\n\nThe central bank expects the implementation of installments to lead to increased sales for businesses and greater financial inclusion for consumers who may not have access to credit cards. While details are still being finalized, the central bank has emphasized that the installment feature will prioritize security and user protection.\n",
    "chinese_title": "巴西央行将于9月推出Pix分期付款功能",
    "chinese_summary": "巴西央行计划于2024年9月为其即时支付系统Pix推出分期付款功能。这项名为“Pix Garantido”（有保障的Pix）的新功能将允许用户使用Pix系统分期支付商品和服务，类似于信用卡的工作方式。\n\n“Pix Garantido”的目标是通过为较大额的消费提供信用卡替代方案，进一步扩大Pix的使用，Pix在巴西已经非常受欢迎。预计商家将受益于低于信用卡支付的交易费用，而消费者将获得一种方便且可能更便宜的分期付款选择。\n\n央行预计分期付款的实施将增加企业的销售额，并为可能无法使用信用卡的消费者提供更大的金融包容性。虽然细节仍在最终确定中，但央行强调分期付款功能将优先考虑安全性和用户保护。"
  },
  {
    "id": "44685222",
    "title": "Tea App Users' Faces and IDs Reportedly Posted to 4chan in Security Breach",
    "url": "https://www.cnet.com/tech/services-and-software/tea-app-users-faces-and-ids-reportedly-posted-to-4chan-in-security-breach/",
    "summary": "Tea, a popular women's safety dating app, is reportedly facing a significant security breach. Reports indicate that users' faces and identification documents, including driver's licenses, have been leaked on 4chan due to an unsecured database. These reports, originating on Reddit and 404 Media, claim that the leaked data is a result of Tea's requirement for users to verify their identities with selfies or IDs.\n\nTea has not yet independently verified or commented on the alleged breach. The app, designed to allow women to report negative experiences with men in the dating world, recently topped the Apple App Store charts, leading to international discussion about potential privacy violations against men.\n\nThe reported security breach raises further concerns about the risks associated with online identity and age verification processes. While Tea's website states they take reasonable security measures, it also acknowledges that no system is completely impenetrable. If confirmed, this breach highlights the potential vulnerabilities inherent in collecting and storing sensitive user data.\n",
    "chinese_title": "茶App用户面部信息和ID据报在4chan上被泄露，涉及安全漏洞。",
    "chinese_summary": "热门女性安全约会应用Tea据报遭遇重大安全漏洞。报告显示，由于数据库未受保护，用户面部照片和身份证件（包括驾照）已在4chan上泄露。这些源自Reddit和404 Media的报告声称，泄露的数据是由于Tea要求用户通过自拍或身份证件验证身份所致。\n\nTea尚未独立证实或评论此次据称的泄露事件。这款旨在让女性举报与男性约会过程中负面经历的应用，最近登上了苹果应用商店排行榜榜首，引发了关于男性潜在隐私侵犯的国际讨论。\n\n据报的安全漏洞进一步引发了人们对在线身份和年龄验证流程相关风险的担忧。虽然Tea的网站声明他们采取了合理的安全措施，但也承认没有系统是完全坚不可摧的。如果确认属实，此次泄露事件凸显了收集和存储敏感用户数据所固有的潜在漏洞。"
  },
  {
    "id": "44640143",
    "title": "High-speed organic light-emitting diodes achieving 4-Gbps communication",
    "url": "https://www.spiedigitallibrary.org/journals/advanced-photonics/volume-7/issue-03/036005/High-speed-organic-light-emitting-diodes-based-on-dinaphthylperylene-achieving/10.1117/1.AP.7.3.036005.full",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "实现4-Gbps通信的高速有机发光二极管",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44679048",
    "title": "Asciinema: Record and share your terminal sessions",
    "url": "https://asciinema.org",
    "summary": "Asciinema is a free and open-source tool for recording and sharing terminal sessions. It offers a lightweight, text-based alternative to traditional screen recording methods, avoiding blurry video and simplifying the recording process.\n\nUsers record sessions directly in their terminal by running the `asciinema rec [filename.cast]` command and ending the recording with `ctrl+d` or `exit`. Recordings can be paused, and text can be easily copied and pasted.\n\nAsciinema provides embedding capabilities, making it simple to integrate recordings into blog posts, documentation, and presentations. The article highlights several example sessions recorded using Asciinema, showcasing its versatility and use in various contexts.\n",
    "chinese_title": "Asciinema: 录制并分享你的终端会话",
    "chinese_summary": "Asciinema 是一款免费开源的终端会话录制和分享工具。它提供了一种轻量级的、基于文本的替代传统屏幕录制方法，避免了模糊的视频并简化了录制过程。\n\n用户可以通过运行 `asciinema rec [filename.cast]` 命令直接在终端中录制会话，并使用 `ctrl+d` 或 `exit` 结束录制。录制可以暂停，文本可以轻松复制和粘贴。\n\nAsciinema 提供嵌入功能，可以轻松地将录制内容集成到博客文章、文档和演示文稿中。本文重点介绍了使用 Asciinema 录制的几个示例会话，展示了它的多功能性以及在各种上下文中的应用。"
  },
  {
    "id": "44633648",
    "title": "3-JSON",
    "url": "https://rgbcu.be/blog/3-json/",
    "summary": "This article discusses the \"3-JSON\" feature of the `tree` command-line utility, specifically its ability to output un-indented JSON data on file descriptor 3 (stddata). The author highlights a problematic initial implementation where the `tree` command assumed the presence of file descriptor 3, leading to unexpected behavior and \"havoc\" due to many scripts randomly handling file descriptors. This was addressed in version 2.0.2.\n\nThe article explains that the 3-JSON feature now relies on the `STDDATA_FD` environment variable.  The user must set `STDDATA_FD` to the desired file descriptor (e.g., 1 for stdout) for the JSON output to be generated. An example demonstrates using `STDDATA_FD=1 tree` to output the directory structure in JSON format to stdout. The article then presents a demonstration of piping this JSON output to `nushell` using `STDDATA_FD=1 tree | from json`, however, the output format from `nushell` is not rendered correctly. The author uses a markdown table to work around webfont issues rendering fancy characters. The key takeaway is that while the 3-JSON feature offers structured data output, its initial implementation was flawed, and it now requires explicit environment variable configuration.\n",
    "chinese_title": "3-JSON",
    "chinese_summary": "本文讨论了`tree`命令行实用程序的“3-JSON”特性，特别是它在文件描述符3 (stddata) 上输出无缩进JSON数据的能力。作者强调了一个有问题的初始实现，其中`tree`命令假定文件描述符3的存在，导致意外行为和“混乱”，因为许多脚本随机处理文件描述符。这个问题已在2.0.2版本中得到解决。\n\n文章解释说，3-JSON特性现在依赖于`STDDATA_FD`环境变量。用户必须将`STDDATA_FD`设置为所需的文件描述符（例如，1代表stdout），才能生成JSON输出。一个例子演示了使用`STDDATA_FD=1 tree`将目录结构以JSON格式输出到stdout。文章随后展示了使用`STDDATA_FD=1 tree | from json`将此JSON输出通过管道传递给`nushell`，但是，来自`nushell`的输出格式未正确呈现。作者使用markdown表格来解决渲染花哨字符的webfont问题。关键在于，虽然3-JSON特性提供了结构化数据输出，但其初始实现存在缺陷，现在需要显式的环境变量配置。"
  },
  {
    "id": "44681740",
    "title": "My website is one binary (2022)",
    "url": "https://j3s.sh/thought/my-website-is-one-binary.html",
    "summary": "JES argues against using static site generators like Hugo for personal websites, despite their popularity, citing concerns about dependencies on external projects, communities, and evolving technologies. The author values systems they can fully understand and maintain independently, prioritizing reliability and long-term usability.\n\nTheir preferred solution is a website built and deployed as a single binary using Go. This approach offers dynamic content generation (like displaying user IP addresses) with minimal code, simplifying complex tasks compared to static sites that often require JavaScript and external dependencies. Deployment is streamlined using a simple shell script and a cron job, ensuring automatic updates with minimal dependencies.\n\nJES advocates for personal websites that reflect individuality and experimentation. They encourage readers to embrace dynamic websites for their flexibility, simplicity, and the fun of building them. They emphasize starting small, focusing on basic HTML serving before adding features, and prioritizing the use of standard libraries over complex frameworks to avoid burnout. The goal is to create a website that is maintainable, understandable, and uniquely personal.\n",
    "chinese_title": "我的网站是一个二进制文件（2022）",
    "chinese_summary": "JES反对使用Hugo等静态网站生成器来搭建个人网站，尽管它们很流行，但他担心依赖外部项目、社区和不断发展的技术。作者重视他们能够完全理解和独立维护的系统，优先考虑可靠性和长期可用性。\n\n他们偏好的解决方案是用Go构建并部署为单个二进制文件的网站。这种方法可以用最少的代码生成动态内容（例如显示用户IP地址），与通常需要JavaScript和外部依赖项的静态网站相比，简化了复杂的任务。部署通过简单的shell脚本和cron作业进行简化，确保以最小的依赖性自动更新。\n\nJES提倡能够反映个性和实验性的个人网站。他们鼓励读者拥抱动态网站，因为它们具有灵活性、简单性以及构建它们的乐趣。他们强调从小处着手，专注于提供基本的HTML服务，然后再添加功能，并优先使用标准库而不是复杂的框架，以避免精疲力竭。目标是创建一个可维护、可理解且独具个性的网站。"
  },
  {
    "id": "44638661",
    "title": "Rapidus Starts 2nm Gate All Around Prototype Production at IIM-1",
    "url": "https://www.servethehome.com/rapidus-starts-2nm-gate-all-around-prototype-production-at-iim-1/",
    "summary": "Rapidus has begun prototype production of 2nm Gate All Around (GAA) transistors at its new IIM-1 fab in Chitose City, Hokkaido, Japan. This initiative aims to bring cutting-edge semiconductor manufacturing back to Japan. Construction on the IIM-1 facility started in September 2023, with the clean room completed in 2024 and the EUV tool installed by December 2024. The first EUV exposure took place in April 2025, and the facility now boasts over 200 operational machines.\n\nRapidus plans to begin working with advanced customers in approximately three quarters, with a target of achieving volume manufacturing by 2027. The article highlights the earthquake-resistant features integrated into the fab's construction, including steel dampeners and specialized column designs that allow the building to withstand seismic activity.\n\nThe development of Rapidus IIM-1 is significant for both the semiconductor industry and Japan, given the strategic importance of advanced semiconductors. The company appears to be on track to meet its production milestones, and the article expresses interest in seeing the 2nm GAA process in action.\n",
    "chinese_title": "Rapidus IIM-1开始2纳米环绕栅极原型生产",
    "chinese_summary": "Rapidus已在日本北海道千岁市新建的IIM-1工厂开始2纳米环绕栅极(GAA)晶体管的原型生产。此举旨在将尖端半导体制造技术带回日本。IIM-1工厂于2023年9月开始建设，洁净室于2024年竣工，EUV光刻机于2024年12月安装完毕。首次EUV曝光发生在2025年4月，目前该工厂拥有超过200台可运行的机器。\n\nRapidus计划在大约三个季度后开始与高端客户合作，目标是在2027年实现量产。文章强调了该工厂在建设中融入的抗震特性，包括钢制阻尼器和专门的柱子设计，使建筑物能够承受地震活动。\n\n鉴于先进半导体的战略重要性，Rapidus IIM-1的开发对半导体行业和日本都具有重要意义。该公司似乎正在按计划实现其生产目标，文章表示有兴趣看到2纳米GAA工艺的实际应用。"
  },
  {
    "id": "44685654",
    "title": "Malnutrition in under-5s has tripled at Gaza City clinic, charity reports",
    "url": "https://www.theguardian.com/world/2025/jul/25/severe-malnutrition-under-5s-gaza-city--tripled-two-weeks-charity-msf",
    "summary": "A new report indicates a rapid deterioration of the humanitarian situation in Gaza, with severe malnutrition among children under five tripling at a Gaza City clinic in the last two weeks. Médecins Sans Frontières (MSF) reports a quadrupling in the number of people needing malnutrition care since May, with a quarter of screened young children and pregnant/breastfeeding women found to be malnourished.\n\nThe crisis is attributed to Israel's \"policy of starvation,\" with aid groups condemning the severe restrictions on aid entering Gaza. The World Food Programme reports nearly a third of Gazans are not eating for days, leading to a surge in malnutrition, affecting 90,000 women and children. At least 122 people have died from starvation, with more deaths reported daily.\n\nDoctors in Gaza describe dire conditions, with obstetricians reporting significant malnutrition among pregnant women, leading to miscarriages and underweight babies. Medical supplies are scarce, forcing doctors to use unsanitary equipment.\n\nInternational condemnation is growing, with the UN Secretary General calling it a \"moral crisis\" and leaders from the UK, France, and Germany urging Israel to lift restrictions on aid. Despite this, ceasefire negotiations have collapsed, with both Israel and Hamas blaming each other. While airdrops of aid from Jordan and the UAE have begun, Hamas criticizes them as insufficient. The situation is exacerbated by the dangers faced by Palestinians trying to access aid, with over 1,000 reported deaths at distribution sites.\n",
    "chinese_title": "加沙市诊所报告称，五岁以下儿童营养不良情况增加两倍。",
    "chinese_summary": "一份新报告显示加沙人道主义局势迅速恶化，过去两周加沙市一家诊所五岁以下儿童的严重营养不良病例增加了两倍。“无国界医生”报告称，自五月以来，需要营养不良护理的人数增加了四倍，四分之一接受筛查的幼儿和孕妇/哺乳期妇女被发现营养不良。\n\n这场危机归因于以色列的“饥饿政策”，援助组织谴责对进入加沙的援助物资的严厉限制。世界粮食计划署报告称，近三分之一的加沙人已经几天没有吃饭，导致营养不良人数激增，影响了9万名妇女和儿童。至少有122人死于饥饿，并且每天都有更多死亡报告。\n\n加沙的医生描述了可怕的状况，产科医生报告说孕妇中存在严重的营养不良，导致流产和婴儿体重不足。医疗用品稀缺，迫使医生使用不卫生的设备。\n\n国际社会的谴责日益增加，联合国秘书长称其为“道德危机”，英国、法国和德国的领导人敦促以色列解除对援助物资的限制。尽管如此，停火谈判已经破裂，以色列和哈马斯互相指责。虽然约旦和阿联酋已经开始空投援助物资，但哈马斯批评这些援助物资不足。试图获得援助的巴勒斯坦人面临的危险使情况更加恶化，据报道，在分配地点有1000多人死亡。"
  },
  {
    "id": "44639563",
    "title": "Nuclear Reactor SIM by PeteTimesSix",
    "url": "https://petetimessix.itch.io/nuclear-reactors",
    "summary": "\"Nuclear Reactor Sim\" by PeteTimesSix is a simple simulation game built with Godot, intended as an educational tool to demonstrate how nuclear reactors work. Created for Godot Wild Jam #80, the game allows players to control rod groups (Q/A, W/S, E/D keys) and water flow (X/C keys) to manage the reactor.\n\nThe simulator is heavily based on external video resources. The game utilizes Maaack's Game Template and CC0 sounds from Pixabay.\n\nIt is currently available as a prototype on HTML5, Windows, macOS, and Linux platforms. Downloads for various versions are provided, including Windows, a newer HTML5 version, and Linux.\n\nA user pointed out an inaccuracy in the game's explanation of Uranium-235 (mistaking its mass number for neutron count). The developer, PeteTimesSix, acknowledged the error and has since corrected the statement.\n",
    "chinese_title": "PeteTimesSix的核反应堆模拟器",
    "chinese_summary": "PeteTimesSix 的《核反应堆模拟》是一款用 Godot 引擎开发的简单模拟游戏，旨在作为一种教育工具，演示核反应堆的工作原理。该游戏为 Godot Wild Jam #80 而创建，允许玩家通过控制棒组（Q/A、W/S、E/D 键）和水流量（X/C 键）来管理反应堆。\n\n该模拟器很大程度上基于外部视频资源。游戏使用了 Maaack 的游戏模板和来自 Pixabay 的 CC0 声音。\n\n目前，它以原型形式在 HTML5、Windows、macOS 和 Linux 平台上提供。提供了各种版本的下载，包括 Windows、较新的 HTML5 版本和 Linux。\n\n一位用户指出游戏中关于铀 235 的解释不准确（将其质量数误认为是中子数）。开发者 PeteTimesSix 承认了该错误，并已更正该声明。"
  },
  {
    "id": "44685274",
    "title": "Do cells also hold memories?",
    "url": "https://www.theglobeandmail.com/canada/article-cells-basic-unit-of-life-memories/",
    "summary": "This article explores the idea that cells possess a form of memory and intelligence beyond simply carrying out genetic instructions. It highlights research suggesting cells process information, engage in purposeful behavior, and communicate with each other to maintain tissue balance and respond to environmental signals.\n\nKey points include:\n\n*   Cells are more than just factories; they engage in intricate interactions and prioritize self-maintenance and the well-being of neighboring cells.\n*   Cells communicate via tiny tube networks (TNTs), gap junctions, and exosomes, sharing resources to help stressed or injured cells.\n*   Research indicates tissues retain memory of their embryonic origins, inscribed on DNA, and this memory can be recovered under certain conditions, potentially offering new avenues for treating diseases and understanding cancer.\n*   Cells are viewed as autopoietic systems, constantly recreating and maintaining themselves, with dying cells even protecting neighboring cells from death.\n*   Environmental DNA (eDNA), genetic material shed by living organisms, can be extracted to retrieve detailed medical and ancestral data.\n*   The article ends by questioning whether some paranormal experiences and the concept of the \"collective unconscious\" might be linked to people's ability to \"read\" eDNA containing traces of strong emotional experiences from the past.\n",
    "chinese_title": "细胞也拥有记忆吗？",
    "chinese_summary": "细胞的记忆与智能：超越基因指令\n\n要点包括：\n\n*   细胞不仅仅是工厂；它们参与复杂的互动，并将自我维护和邻近细胞的福祉置于优先地位。\n*   细胞通过微管网络（TNTs）、间隙连接和外泌体进行通讯，分享资源以帮助受压或受伤的细胞。\n*   研究表明，组织保留了其胚胎起源的记忆，铭刻在DNA上，这种记忆可以在特定条件下恢复，可能为治疗疾病和理解癌症提供新的途径。\n*   细胞被视为自创生系统，不断地自我重建和维护，甚至垂死的细胞也会保护邻近的细胞免于死亡。\n*   环境DNA（eDNA），即生物体脱落的遗传物质，可以被提取以检索详细的医疗和祖先数据。\n*   文章最后提出质疑，一些超自然体验和“集体无意识”的概念是否可能与人们“读取”eDNA的能力有关，其中包含来自过去的强烈情感体验的痕迹。"
  },
  {
    "id": "44683683",
    "title": "I've Had It with Microsoft",
    "url": "https://www.disconnect.blog/p/ive-had-it-with-microsoft",
    "summary": "Paris Marx expresses their frustration with Microsoft's deceptive practices regarding price increases for Microsoft 365 subscriptions. Marx accuses Microsoft of raising prices under the guise of \"rising costs\" and \"new innovations,\" masking the real reason: to fund their generative AI ambitions.\n\nThe article highlights that Microsoft automatically moved existing users to a new, more expensive plan that included AI features they didn't request. The author only discovered the availability of a lower-cost, AI-free option when attempting to cancel their subscription, suggesting Microsoft intentionally hid this choice.\n\nMarx criticizes this as a blatant abuse of market power and a deceptive tactic to extract more money from customers. They argue that such practices contribute to the growing distrust of tech monopolies and the perception of generative AI as a \"giant scam.\"\n\nThe author laments the lack of regulatory oversight under the current FTC leadership, implying that Lina Khan would have investigated such abuses. Marx concludes by expressing their determination to rid themselves of Microsoft products and services and calls for consequences for companies that lie to their customers, also noting Microsoft's inclusion on the Boycott, Divestment, Sanctions list.\n",
    "chinese_title": "我对微软忍无可忍了",
    "chinese_summary": "帕里斯·马克表达了对微软在Microsoft 365订阅价格上涨方面欺骗行为的不满。马克指责微软以“成本上涨”和“新创新”为幌子提高价格，掩盖了真正的原因：为他们的生成式人工智能野心提供资金。\n\n文章强调，微软自动将现有用户转移到一个包含他们未请求的人工智能功能、价格更高的新计划中。作者只有在试图取消订阅时才发现有更便宜的、不含人工智能的选项，这表明微软有意隐藏了这个选择。\n\n马克批评这是对市场力量的公然滥用和一种欺骗性策略，目的是从客户那里榨取更多资金。他们认为，这种做法加剧了人们对科技垄断企业日益增长的不信任，以及对生成式人工智能是“一场巨大骗局”的看法。\n\n作者感叹当前联邦贸易委员会领导下缺乏监管监督，暗示莉娜·汗本应调查此类滥用行为。马克最后表达了摆脱微软产品和服务的决心，并呼吁对那些对客户撒谎的公司追究责任，同时也指出微软已被列入抵制、撤资、制裁名单。"
  },
  {
    "id": "44685027",
    "title": "Good Docs Describe, Bad Docs Prescribe",
    "url": "https://rethinkingsoftware.substack.com/p/good-docs-describe-bad-docs-prescribe",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "好的文档描述，坏的文档规定。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44634469",
    "title": "Developing with Kiro: Amazon's New Agentic IDE",
    "url": "https://yehudacohen.substack.com/p/developing-with-kiro-amazons-new",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "使用 Kiro 进行开发：亚马逊的新型 Agentic IDE",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44681786",
    "title": "Google Opal",
    "url": "https://developers.googleblog.com/en/introducing-opal/",
    "summary": "Google Labs introduces Opal, a new experimental tool that allows users to build and share AI mini-apps using natural language and visual editing. Opal simplifies the process of creating AI applications by chaining together prompts, AI models, and other tools into visual workflows, all without requiring code.\n\nKey features of Opal include:\n\n*   **Workflow Creation:** Users can describe the logic of their desired application, and Opal will automatically generate a visual workflow representing the sequence of steps.\n*   **Easy Editing:** The visual editor allows for fine-grained control over the app's functionality. Users can tweak prompts, add new features, or call tools using natural language commands or direct manipulation in the editor.\n*   **App Sharing:** Once an app is complete, it can be shared with others for immediate use via their Google accounts.\n\nOpal is currently available in a US-only public beta and includes a demo gallery with starter templates to help users get started. Google aims to empower creators and innovators to build AI tools by transforming prompts into mini-apps.\n",
    "chinese_title": "谷歌Opal",
    "chinese_summary": "Google Labs推出Opal：通过自然语言和可视化编辑构建并分享AI迷你应用的新实验工具。Opal简化了AI应用的创建过程，无需代码即可将提示词、AI模型和其他工具串联成可视化工作流。\n\nOpal的主要功能包括：\n\n*   **工作流创建：** 用户可以描述所需应用的逻辑，Opal将自动生成表示步骤序列的可视化工作流。\n*   **轻松编辑：** 可视化编辑器可以对应用的功能进行精细控制。用户可以使用自然语言命令或直接在编辑器中进行操作，以调整提示词、添加新功能或调用工具。\n*   **应用分享：** 应用完成后，可以与他人分享，并通过他们的Google帐户立即使用。\n\nOpal目前仅在美国提供公开测试版，并包含一个演示库，其中包含入门模板以帮助用户开始使用。Google旨在通过将提示词转化为迷你应用，来赋能创作者和创新者构建AI工具。"
  },
  {
    "id": "44634598",
    "title": "Positron – A next-generation data science IDE",
    "url": "https://positron.posit.co/",
    "summary": "Positron is a free, next-generation data science IDE developed by Posit PBC. It's designed as an extensible and polyglot tool for coding and data exploration, offering a familiar environment for reproducible authoring and publishing. Built on Code OSS, Positron leverages existing VS Code functionalities for commands, settings, and source control.\n\nUsers can find installers, user guides (covering topics like interpreter selection and the Data Explorer), and FAQs to get started. Posit encourages users to provide feedback and ask questions on GitHub Discussions for ongoing improvement.\n\nPositron is licensed under the Elastic License 2.0 (a source-available license), and both \"Positron\" and the Positron icon are trademarks of Posit Software, PBC.\n",
    "chinese_title": "正电子 - 下一代数据科学 IDE",
    "chinese_summary": "Positron：一款由Posit PBC开发的免费、下一代数据科学IDE。它被设计为一款可扩展、支持多种编程语言的编码和数据探索工具，为可重复的创作和发布提供熟悉的环境。Positron构建于Code OSS之上，利用现有的VS Code功能进行命令、设置和源代码控制。\n\n用户可以找到安装程序、用户指南（涵盖解释器选择和数据浏览器等主题）以及常见问题解答以开始使用。Posit鼓励用户在GitHub Discussions上提供反馈和提问，以不断改进。\n\nPositron采用Elastic License 2.0（一种源码可用许可）进行授权，“Positron”和Positron图标均为Posit Software, PBC的商标。"
  },
  {
    "id": "44681565",
    "title": "Qwen3-235B-A22B-Thinking-2507",
    "url": "https://huggingface.co/Qwen/Qwen3-235B-A22B-Thinking-2507",
    "summary": "Based on the information provided, \"Qwen3-235B-A22B-Thinking-2507\" appears to be the title of something (likely a resource or a repository). The content description is minimal:\n\n*   **Title:** Qwen3-235B-A22B-Thinking-2507 (Suggests a large language model or similar AI-related project)\n*   **Number of Items:** 76 (Likely files, code snippets, or other components within the resource)\n*   **Update Status:** Updated approximately 7 hours ago\n*   **Number of Downloads/Views:** 916\n\n**Summary:**\n\nThis entry refers to \"Qwen3-235B-A22B-Thinking-2507,\" which seems to be a project or collection (possibly related to a large language model based on the \"Qwen\" prefix and the \"Thinking\" suffix). It consists of 76 items and was recently updated 7 hours ago. The resource has garnered 916 downloads or views, indicating some level of interest and activity surrounding it. Without further context, it's difficult to ascertain the exact nature of the project, but the name and statistics suggest a relatively substantial and actively maintained resource in the field of AI or language modeling.\n",
    "chinese_title": "Qwen3-235B-A22B-思考-2507",
    "chinese_summary": "基于所提供的信息，“Qwen3-235B-A22B-Thinking-2507” 似乎是某个资源（很可能是一个资源库）的标题。内容描述非常简短：\n\n*   **标题：** Qwen3-235B-A22B-Thinking-2507 （暗示大型语言模型或类似的AI相关项目）\n*   **项目数量：** 76 （可能是资源内的文件、代码片段或其他组件）\n*   **更新状态：** 大约7小时前更新\n*   **下载/浏览次数：** 916\n\n**概要：**\n\n此条目指的是 “Qwen3-235B-A22B-Thinking-2507”，这似乎是一个项目或集合（可能与基于 “Qwen” 前缀和 “Thinking” 后缀的大型语言模型相关）。它包含76个项目，并且最近在7小时前更新。该资源已获得916次下载或浏览，表明对其有一定的兴趣和活跃度。在没有更多上下文的情况下，很难确定该项目的确切性质，但名称和统计数据表明，这是人工智能或语言建模领域中一个相对重要且积极维护的资源。"
  },
  {
    "id": "44676691",
    "title": "Graphene OS: a security-enhanced Android build",
    "url": "https://lwn.net/SubscriberLink/1030004/898017c7953c0946/",
    "summary": "This LWN.net article reviews GrapheneOS, a security-focused Android rebuild aiming to enhance user privacy and security. GrapheneOS builds on the Android Open Source Project, removing unnecessary code and adding security enhancements like a hardened `malloc()` library and control-flow-integrity features.\n\nInstallation is limited to recent Google Pixel devices (6-9, with some support for 4-5). A clean install requires reconfiguring everything from scratch. GrapheneOS ships with minimal pre-installed apps, including a Chromium-based browser (Vanadium), a camera app with default Exif stripping, and a minimal app store.\n\nThe article discusses app store options. Accrescent offers a small set of security/privacy-focused apps. While F-Droid is an option, it isn't highly regarded by the GrapheneOS community. The author successfully uses a sandboxed version of the Google Play store, allowing access to a wider range of apps without granting it the privileged access it has in stock Android. GrapheneOS implements Android's integrity API, but, being an unofficial build, fails one of the tests, which can cause some apps to refuse to run.\n\nGrapheneOS includes features like blocking carrier-enforced tethering restrictions, controlling network access per app, sensor permissions, and storage/contact scopes. It also offers fingerprint unlock with brute-force protection and a duress PIN for data wiping. The system updates aggressively, and the default configuration reboots regularly for security.\n\nThe article notes some concerns about the GrapheneOS development community's transparency and reliance on Daniel Micay. Despite this, the author has switched to GrapheneOS and is satisfied with its security and privacy benefits, concluding that the required setup effort is worthwhile.\n",
    "chinese_title": "石墨烯操作系统：一个安全增强的安卓版本",
    "chinese_summary": "这篇LWN.net文章评测了GrapheneOS，一个注重安全的Android重构版本，旨在增强用户隐私和安全。GrapheneOS构建于Android开放源代码项目之上，移除了不必要的代码并添加了安全增强功能，例如强化的`malloc()`库和控制流完整性特性。\n\n安装仅限于最新的Google Pixel设备（6-9，对4-5有一些支持）。全新安装需要从头开始重新配置一切。GrapheneOS附带最少的预装应用程序，包括基于Chromium的浏览器（Vanadium）、一个默认剥离Exif信息的相机应用程序和一个最小化的应用商店。\n\n文章讨论了应用商店选项。Accrescent提供了一小部分注重安全/隐私的应用程序。虽然F-Droid是一个选项，但它并没有受到GrapheneOS社区的高度评价。作者成功地使用了沙盒版本的Google Play商店，允许访问更广泛的应用程序，而无需授予它在原生Android中拥有的特权访问权限。GrapheneOS实现了Android的完整性API，但是，作为一个非官方版本，它未能通过其中一项测试，这可能导致某些应用程序拒绝运行。\n\nGrapheneOS包含诸如阻止运营商强制执行的 tethering 限制、控制每个应用程序的网络访问、传感器权限以及存储/联系人范围等功能。它还提供带有暴力破解保护的指纹解锁和用于数据擦除的胁迫PIN码。系统会积极更新，并且默认配置会定期重启以确保安全。\n\n文章指出了一些关于GrapheneOS开发社区的透明度以及对Daniel Micay的依赖性的担忧。尽管如此，作者已切换到GrapheneOS，并且对其安全性和隐私优势感到满意，最终认为所需的设置工作是值得的。"
  },
  {
    "id": "44679406",
    "title": "Against the censorship of adult content by payment processors",
    "url": "https://soatok.blog/2025/07/24/against-the-censorship-of-adult-content-by-payment-processors/",
    "summary": "Soatok, a furry security engineer, argues against the weaponization of payment processors like Visa and Mastercard to censor online content, specifically adult content. They highlight how groups like Collective Shout and Exodus Cry have successfully pressured payment processors to force platforms like Steam and itch.io to remove content, raising concerns about the unchecked power of these corporations to dictate what can be bought and sold online.\n\nThe author criticizes Collective Shout's methods, even while acknowledging the problematic nature of some targeted content, like a rape-glorifying game. They fear that this tactic will be adopted by other groups, potentially targeting LGBTQIA+ content or even the author's own blog due to its furry art.\n\nSoatok emphasizes that the issue is primarily political, not technical, and that solutions like cryptocurrency are not a sufficient fix. Instead, they advocate for collective action and political solutions, citing a Change.org petition and mentioning proposed legislation, while urging caution against divisive behavior like \"GamerGate\".\n\nThe author also suggests the potential of alternative payment systems like the EU's WERO and the US's FedNOW, which would distribute power among more banks and payment providers, lessening the control of Visa and Mastercard. They encourage readers to support these initiatives and hints at a future discussion on GNU Taler. In conclusion, the article promotes organizing and political action to safeguard free expression online from censorship by payment processors.\n",
    "chinese_title": "反对支付处理商审查成人内容",
    "chinese_summary": "一位毛茸茸的（furry）安全工程师Soatok反对将Visa和Mastercard等支付处理商武器化，以审查在线内容，特别是成人内容。他们强调，像Collective Shout和Exodus Cry这样的团体已成功向支付处理商施压，迫使Steam和itch.io等平台删除内容，这引发了人们对这些公司拥有不受约束的权力来决定在线可以购买和销售哪些商品的担忧。\n\n作者批评了Collective Shout的方法，即使承认某些目标内容（如美化强奸的游戏）存在问题。他们担心这种策略会被其他团体采用，可能针对 LGBTQIA+ 内容，甚至针对作者自己的博客，因为其中包含毛茸茸的艺术。\n\nSoatok强调，问题主要在于政治，而非技术，加密货币等解决方案并不足以解决问题。相反，他们提倡集体行动和政治解决方案，引用了Change.org上的请愿书，并提及了拟议的立法，同时告诫人们不要采取像“玩家门（GamerGate）”这样具有分裂性的行为。\n\n作者还提出了欧盟的WERO和美国的FedNOW等替代支付系统的潜力，这些系统会将权力分配给更多的银行和支付提供商，从而减少Visa和Mastercard的控制。他们鼓励读者支持这些举措，并暗示未来将讨论GNU Taler。总之，本文旨在通过组织和政治行动来保护在线自由表达免受支付处理商的审查。"
  },
  {
    "id": "44684729",
    "title": "Meta joins Google in ragequitting EU political ads over onerous regulations",
    "url": "https://www.theregister.com/2025/07/25/meta_eu_political_ads/",
    "summary": "Meta is following Google's lead and will no longer allow political advertising in the EU due to the upcoming Transparency and Targeting of Political Advertising (TTPA) regulation. Meta claims the TTPA, set to go into effect in October, imposes excessive obligations and legal uncertainty, making compliance too difficult and restrictive for advertisers.\n\nThe TTPA requires advertisers to disclose detailed information like who is advertising, the referendum being advertised, the amount paid, and targeting techniques used, and necessitates explicit user consent for targeted ads. Meta believes this puts them in a difficult position, forcing them to offer an ineffective advertising product or cease political advertising altogether. They have chosen the latter, blaming the EU for effectively removing a service from the market.\n\nMeta emphasizes that organic political content will still be allowed on its platforms. Google made a similar decision in November, citing operational challenges and legal uncertainties under the TTPA. Like Meta, Google criticized the EU for a lack of clarity in the regulation. The European Commission did not comment.\n",
    "chinese_title": "Meta因繁重的法规而效仿谷歌，怒退欧盟政治广告。",
    "chinese_summary": "Meta效仿谷歌，因即将实施的政治广告透明化和定向规管(TTPA) ，将不再允许在欧盟投放政治广告。Meta声称，定于10月生效的TTPA施加了过度的义务和法律不确定性，使得合规对广告商来说过于困难和具有限制性。\n\nTTPA要求广告商披露详细信息，如谁在做广告、所广告的公投内容、支付的金额以及使用的定向技术，并且需要用户明确同意定向广告。Meta认为这使其处于困难境地，迫使其提供无效的广告产品或完全停止政治广告。他们选择了后者，指责欧盟实际上将一项服务从市场上移除。\n\nMeta强调，其平台上仍允许发布自然政治内容。谷歌在11月做出了类似的决定，理由是TTPA下的运营挑战和法律不确定性。与Meta一样，谷歌也批评欧盟在该法规中缺乏明确性。欧盟委员会未予置评。"
  },
  {
    "id": "44636534",
    "title": "Modernish – A library for writing programs for POSIX-based shells and utilities",
    "url": "https://github.com/modernish/modernish",
    "summary": "Modernish is a shell scripting library designed to enhance and simplify shell programming for POSIX-based systems, promoting portability and safety. It addresses common scripting issues like quoting complexities and potential errors by providing safer variable expansion, new loop constructs, and other features.\n\nThe library is written entirely in shell, eliminating the need for compiled code and ensuring compatibility across various Unix-like systems. It supports two primary modes of usage: a simple form where modernish is sourced in a shell-specific script, and a portable form which uses a special hashbang to execute the script with modernish-enhanced functionality using the user's default shell.\n\nKey features include modules for safe mode (preventing common scripting errors), enhanced variable and loop constructs (var/loop, var/local, etc.), string manipulation tools (var/string), and modernized versions of basic utilities (sys/base) for consistent behavior across systems.  It also offers tools for hardening external commands, parsing command line options, and managing shell options and trap stacks.\n\nModernish includes extensive shell capability detection, allowing scripts to adapt to different shell implementations. Installation and uninstallation are handled by scripts that can be run interactively or non-interactively.  The library is actively seeking testers and developers to contribute to its development and identify potential issues.\n",
    "chinese_title": "Modernish – 用于为基于POSIX的Shell和实用程序编写程序的库",
    "chinese_summary": "Modernish 是一个 Shell 脚本库，旨在增强和简化基于 POSIX 系统的 Shell 编程，提高可移植性和安全性。它通过提供更安全的变量扩展、新的循环结构和其他功能，解决常见的脚本问题，如引用复杂性和潜在错误。\n\n该库完全用 Shell 编写，无需编译代码，并确保在各种类 Unix 系统上的兼容性。它支持两种主要的使用模式：一种简单模式，其中 modernish 在特定于 Shell 的脚本中被引入；另一种可移植模式，它使用特殊的 Hashbang 来使用用户的默认 Shell 执行具有 modernish 增强功能的脚本。\n\n主要功能包括：用于安全模式的模块（防止常见的脚本错误）、增强的变量和循环结构（var/loop、var/local 等）、字符串操作工具（var/string）以及基本实用程序的现代化版本（sys/base），以确保跨系统的一致行为。它还提供用于强化外部命令、解析命令行选项以及管理 Shell 选项和 Trap 堆栈的工具。\n\nModernish 包括广泛的 Shell 功能检测，允许脚本适应不同的 Shell 实现。安装和卸载由可以交互或非交互运行的脚本处理。该库正在积极寻找测试人员和开发人员来为其开发做出贡献并识别潜在问题。"
  },
  {
    "id": "44683481",
    "title": "Google's shortened goo.gl links will stop working next month",
    "url": "https://www.theverge.com/news/713125/google-url-shortener-links-shutdown-deadline",
    "summary": "Google's goo.gl URL shortener links will cease functioning on August 25th, 2025, returning a 404 error. Google discontinued the tool in 2019, citing evolving internet content discovery methods, but maintained the functionality of existing links until now. The decision to fully deprecate the links stems from a significant decline in their usage, with Google reporting that over 99% of the shortened URLs had no activity in the month preceding the announcement. Users clicking on these links already encounter a warning about the impending shutdown. The article advises individuals and organizations still relying on goo.gl links to transition to alternative URL shortening services before the deadline to avoid broken links. The news emphasizes the importance of updating online content to ensure continued accessibility.\n",
    "chinese_title": "谷歌的 goo.gl 短链接下个月将停止服务。",
    "chinese_summary": "谷歌 goo.gl 短网址将于2025年8月25日停止服务，并返回404错误。谷歌于2019年停止了该工具，理由是互联网内容发现方法不断发展，但保留了现有链接的功能至今。完全弃用这些链接的决定源于其使用量的大幅下降，谷歌报告称，在宣布之前的那个月，超过99%的短网址没有任何活动。点击这些链接的用户已经遇到关于即将关闭的警告。文章建议仍然依赖 goo.gl 链接的个人和组织在截止日期之前过渡到替代的URL缩短服务，以避免链接失效。该新闻强调了更新在线内容以确保持续可访问性的重要性。"
  },
  {
    "id": "44669631",
    "title": "Thunder Compute (YC S24) Is Hiring a C++ Systems Engineer",
    "url": "https://www.ycombinator.com/companies/thunder-compute/jobs/DhML6Uf-c-systems-engineer",
    "summary": "Thunder Compute (YC S24) is hiring a C++ Systems Engineer to work on the core of their GPU cloud platform, which boasts 5x better margins than competitors due to custom virtualization. The company, a 4-person, seed-funded startup with 100%+ MoM revenue growth, is currently based in Atlanta but will relocate to SF or NYC within 6 months.\n\nThe core technical challenge involves network-attaching GPUs over TCP to enable aggressive hardware oversubscription. The ideal candidate will possess top 0.1% C++ ability, experience optimizing NIC/GPU performance, deep understanding of low-level networking/compilers, and experience in latency-sensitive environments. Must-have attributes include high potential for senior leadership, strong communication skills, and a self-driven attitude. Preferred qualifications include a CS PhD/Masters from a top US university and experience at a trading firm or hardware company like NVIDIA.\n\nThe role involves performance optimization, systems debugging, and research into oversubscription and checkpointing. The position is full-time, salaried ($100K - $150K) plus 0.5-1% equity, and reports to the Co-founder/CTO. Thunder Compute aims to be the world's cheapest GPU cloud platform, leveraging its proprietary virtualization stack to improve GPU utilization. They are actively seeking a talented engineer to contribute to this mission.\n",
    "chinese_title": "Thunder Compute (YC S24) 正在招聘 C++ 系统工程师",
    "chinese_summary": "Thunder Compute (YC S24) 招聘 C++ 系统工程师，负责其 GPU 云平台的核心开发。该平台采用定制虚拟化技术，利润率比竞争对手高 5 倍。该公司是一家 4 人、种子轮融资的初创企业，收入每月增长 100% 以上，目前位于亚特兰大，但将在 6 个月内迁至旧金山或纽约。\n\n核心技术挑战包括通过 TCP 将 GPU 连接到网络，以实现积极的硬件超额订阅。理想的候选人应具备顶尖的 C++ 能力，优化 NIC/GPU 性能的经验，对底层网络/编译器有深刻理解，以及在延迟敏感型环境中工作的经验。必备素质包括担任高级领导职务的巨大潜力，强大的沟通能力和积极主动的态度。首选资格包括美国顶尖大学的 CS 博士/硕士学位，以及在贸易公司或 NVIDIA 等硬件公司的工作经验。\n\n该职位涉及性能优化、系统调试以及超额订阅和检查点研究。职位为全职，薪资（10 万美元 - 15 万美元）加上 0.5-1% 的股权，并向联合创始人/CTO 汇报。Thunder Compute 致力于成为世界上最便宜的 GPU 云平台，利用其专有的虚拟化堆栈来提高 GPU 利用率。他们正在积极寻找一位有才华的工程师来为这一使命做出贡献。"
  },
  {
    "id": "44685465",
    "title": "Rivendell Bikes Has Crafted the Rear Derailleur of the Century",
    "url": "https://www.outsideonline.com/outdoor-gear/bikes-and-biking/rivendell-bikes-rear-derailleur?scope=anon",
    "summary": "Eben Weiss's article praises Rivendell Bicycle Works' upcoming Silver OM-1 rear derailleur, a \"low-normal\" (LN) design that offers a compelling alternative to modern electronic and indexed shifting systems. The article highlights Rivendell's commitment to creating \"normal bikes for normal people,\" prioritizing simplicity, comfort, and compatibility.\n\nThe key advantage of the OM-1 is its low-normal action, where the spring pulls the chain to the low gear (largest cog). This contrasts with the more common \"high-normal\" derailleurs, where the spring favors the high gear. Rivendell argues that LN derailleurs offer smoother downshifts, a more intuitive shifting experience when paired with friction shifters, and a default to lower gears in case of cable failure – a bonus on hills.\n\nThe article explains that Rivendell didn't invent the low-normal derailleur, citing Shimano's RapidRise as a past example, but it recognizes its perfect compatibility with friction shifters.  Manufacturing a derailleur is a significant undertaking for a small company, but Rivendell pursued it to create a product that aligns with their values and provides a complete friction drivetrain for riders seeking simplicity and compatibility. The OM-1 promises to be a beautiful, functional component compatible with a wide range of bikes, from vintage to modern, offering a welcome option for those who appreciate the feel and flexibility of friction shifting.\n",
    "chinese_title": "瑞文戴尔自行车打造了世纪后拨。",
    "chinese_summary": "埃本·魏斯的文章赞扬了Rivendell Bicycle Works即将推出的Silver OM-1后拨，这是一款“低位普通”（LN）设计，为现代电子变速和定位变速系统提供了一个引人注目的替代方案。文章强调了Rivendell致力于创造“为普通人设计的普通自行车”，优先考虑简单、舒适和兼容性。\n\nOM-1的主要优势在于其低位普通动作，即弹簧将链条拉到低速档（最大的飞轮片）。这与更常见的“高位普通”后拨形成对比，后者弹簧倾向于高速档。Rivendell认为，LN后拨提供更平滑的降档，与摩擦变速器搭配时提供更直观的变速体验，并且在电缆故障时默认降至较低档位——这是爬坡时的优势。\n\n文章解释说，Rivendell并非低位普通后拨的发明者，并引用了Shimano的RapidRise作为过去的例子，但它承认其与摩擦变速器的完美兼容性。对于一家小公司来说，制造后拨是一项重要的事业，但Rivendell追求它，是为了创造一款符合其价值观的产品，并为寻求简单性和兼容性的骑手提供完整的摩擦传动系统。OM-1有望成为一个美观、功能强大的组件，与从复古到现代的各种自行车兼容，为那些欣赏摩擦变速的手感和灵活性的用户提供一个受欢迎的选择。"
  },
  {
    "id": "44685459",
    "title": "XMPP: When a 25-Year-Old Protocol Becomes Strategic Again",
    "url": "https://www.process-one.net/blog/xmpp-when-a-25-year-old-protocol-becomes-strategic-again/",
    "summary": "This article advocates for the continued relevance and strategic importance of XMPP (Extensible Messaging and Presence Protocol) in the current digital landscape. Despite being a 25-year-old protocol, XMPP's maturity, modularity, and standardization make it a robust foundation for building the future of messaging, particularly in light of European digital sovereignty efforts, the push for interoperability, and the need for vendor-independent infrastructure.\n\nThe article critiques the emergence of XMTP (Extensible Message Transport Protocol), a new blockchain-based messaging protocol, questioning the rationale behind creating a new protocol from scratch when XMPP already provides a solid and extensible foundation. It emphasizes that XMTP, despite its name evoking XMPP, lacks any connection in architecture, interoperability, or community.\n\nThe author argues that XMPP's extensibility, through its ecosystem of open specifications (XEPs), allows it to adapt to modern needs, including blockchain integration, cryptographic message security, and enhanced privacy. XMPP's ability to integrate blockchain identities and function over privacy-preserving transports like Tor makes it a versatile solution without discarding decades of protocol maturity.\n\nThe article concludes by urging the industry to leverage existing, proven technologies like XMPP instead of creating disconnected and potentially overengineered stacks. It argues that XMPP's enduring presence and adaptability make it a valuable asset for building secure, federated, and future-ready messaging systems.\n",
    "chinese_title": "XMPP：一个25年历史的协议再次成为战略重点",
    "chinese_summary": "XMPP：在数字时代依然重要的战略协议"
  },
  {
    "id": "44676817",
    "title": "Scientists may have found a way to eliminate chromosome linked to Down syndrome",
    "url": "https://academic.oup.com/pnasnexus/article/4/2/pgaf022/8016019",
    "summary": "Scientists at the University of California, San Diego, may have developed a novel gene therapy approach that could potentially eliminate the extra chromosome 21 responsible for Down syndrome. The research, published in PNAS Nexus, focuses on using CRISPR-based technology to target and disrupt chromosome 21 in vitro.\n\nThe team engineered a \"CRISPR-dCas9-based synthetic silencing system\" specifically designed to target repetitive sequences on chromosome 21. This system doesn't cut the DNA like traditional CRISPR; instead, it attaches to the chromosome and recruits proteins that effectively silence or condense it, rendering the chromosome inactive and potentially leading to its elimination during cell division.\n\nIn their experiments using induced pluripotent stem cells (iPSCs) derived from individuals with Down syndrome, the researchers successfully demonstrated the silencing and subsequent loss of chromosome 21 in a subset of cells. They observed a reduction in the number of cells carrying the extra chromosome, suggesting the feasibility of this approach.\n\nWhile this research is preliminary and conducted in vitro (in cell cultures) only, it offers a potential therapeutic avenue for Down syndrome. The technology could potentially be used to correct the chromosomal abnormality early in development, although significant challenges remain before it can be applied in vivo (in living organisms) or in humans. These challenges include ensuring the specificity and efficiency of the system, preventing off-target effects, and developing safe and effective delivery methods. Nevertheless, the study represents a significant step forward in exploring gene therapy for Down syndrome.\n",
    "chinese_title": "科学家或已找到消除与唐氏综合征相关染色体的方法",
    "chinese_summary": "加州大学圣地亚哥分校的科学家可能开发出一种新型基因治疗方法，有望消除导致唐氏综合征的额外 21 号染色体。该研究发表在《PNAS Nexus》上，重点是利用基于 CRISPR 的技术在体外靶向并破坏 21 号染色体。\n\n该团队设计了一种“基于 CRISPR-dCas9 的合成沉默系统”，专门用于靶向 21 号染色体上的重复序列。该系统不像传统的 CRISPR 那样切割 DNA；相反，它附着在染色体上，并招募蛋白质来有效地沉默或浓缩它，使染色体失活，并可能导致其在细胞分裂过程中被消除。\n\n在他们使用源自唐氏综合征患者的诱导多能干细胞 (iPSCs) 的实验中，研究人员成功地证明了在部分细胞中 21 号染色体的沉默和随后的丢失。他们观察到携带额外染色体的细胞数量减少，表明该方法的可行性。\n\n虽然这项研究是初步的，并且仅在体外（细胞培养物中）进行，但它为唐氏综合征提供了一种潜在的治疗途径。该技术有可能用于在发育早期纠正染色体异常，但在体内（在活生物体中）或在人类中应用之前，仍然存在重大挑战。这些挑战包括确保系统的特异性和效率、防止脱靶效应以及开发安全有效的递送方法。尽管如此，这项研究代表了在探索唐氏综合征基因治疗方面的重要一步。"
  },
  {
    "id": "44681382",
    "title": "Smartphone Gambling Is a Disaster",
    "url": "https://www.afterbabel.com/p/smartphone-gambling-is-a-disaster",
    "summary": "Cohen and Rose-Berman argue that smartphone gambling is a uniquely dangerous phenomenon, particularly for young men, due to its accessibility, frictionless nature, and addiction-promoting design. Unlike traditional gambling, online platforms offer 24/7 access, personalized betting options, and manipulative tactics mirroring social media to keep users engaged.\n\nThe authors highlight the explosion of online sports betting and iGaming, driven by aggressive advertising and celebrity endorsements, normalizing gambling and increasing problem gambling rates. They cite statistics showing a rise in gambling-related harms like bankruptcies, mental health issues, and addiction, especially among young men.\n\nThey advocate for a shift in gambling regulation, prioritizing player well-being over revenue.  Specifically, they recommend banning online casino games and implementing stricter regulations, including ad restrictions and aggressive enforcement against non-compliant operators. The authors also call on parents and teachers to be aware of the pervasive nature of gambling among young people.\n",
    "chinese_title": "智能手机赌博是一场灾难",
    "chinese_summary": "科恩和罗斯-伯曼认为，智能手机赌博是一种独特的危险现象，尤其是对年轻男性而言，因为它具有易于访问性、无摩擦性以及促进成瘾的设计。与传统赌博不同，在线平台提供全天候访问、个性化投注选项以及模仿社交媒体的操纵性策略，以保持用户参与。\n\n作者强调了在线体育博彩和网络博彩的爆炸式增长，这归功于积极的广告宣传和名人代言，使赌博正常化并提高了问题赌博率。他们引用统计数据表明，与赌博相关的危害（如破产、精神健康问题和成瘾）有所增加，尤其是在年轻男性中。\n\n他们主张转变赌博监管方式，优先考虑玩家福祉而不是收入。具体而言，他们建议禁止在线赌场游戏，并实施更严格的法规，包括广告限制和对不合规运营商的严厉执法。作者还呼吁家长和老师们意识到赌博在年轻人中的普遍性。"
  },
  {
    "id": "44675553",
    "title": "Inter-Planetary Network Special Interest Group",
    "url": "https://www.ipnsig.org",
    "summary": "The Inter-Planetary Network Special Interest Group (IPNSIG) aims to extend the Internet into space, fulfilling the Internet Society's goal of connecting unpopulated areas and ensuring \"The Internet is for Everyone,\" even in space. Founded in 1998 by Vint Cerf and researchers from academia and NASA/JPL, IPNSIG is now a full chapter within the Internet Society.\n\nTheir primary objective is to build and manage a Solar System Internet using Delay and Disruption Tolerant Networking (DTN) technology. They are working towards this through several key initiatives:\n\n*   **Creating a Common Vision:** Collaborating with stakeholders to establish a shared vision for an Interplanetary Network.\n*   **Narrative and Roadmap:** Defining the future of the network by providing a clear narrative and roadmap for its development.\n*   **Promotion of DTN Technology:** Increasing the maturity and adoption of DTN technology through its application in both terrestrial and space environments.\n\nIPNSIG's overall vision is to expand networking to interplanetary space for the benefit of humanity. Key resources available include their Architecture and Governance report and their Strategy Working Group report, both detailing their approach to building a solar system internet.\n",
    "chinese_title": "行星际网络特别兴趣小组",
    "chinese_summary": "行星际网络特别兴趣小组（IPNSIG）旨在将互联网扩展到太空，实现互联网协会连接无人居住区域的目标，并确保“人人享有互联网”，即使在太空也是如此。IPNSIG由Vint Cerf和来自学术界及NASA/JPL的研究人员于1998年创立，现已成为互联网协会的正式分会。\n\n他们的主要目标是使用延迟容忍网络（DTN）技术构建和管理太阳系互联网。他们正通过以下几项关键举措来实现这一目标：\n\n*   **创建共同愿景：** 与利益相关者合作，为行星际网络建立共同愿景。\n*   **叙述和路线图：** 通过为网络发展提供清晰的叙述和路线图，定义网络的未来。\n*   **推广DTN技术：** 通过在陆地和太空环境中的应用，提高DTN技术的成熟度和采用率。\n\nIPNSIG的总体愿景是将网络扩展到行星际空间，以造福人类。可用的关键资源包括他们的架构和治理报告以及他们的战略工作组报告，这两份报告都详细介绍了他们构建太阳系互联网的方法。"
  },
  {
    "id": "44683148",
    "title": "Meta to stop running political ads on Facebook and Instagram in the EU",
    "url": "https://www.euractiv.com/section/tech/news/meta-to-stop-running-political-ads-on-facebook-and-instagram/",
    "summary": "Meta will halt political, electoral, and social issue advertising on Facebook and Instagram in the EU starting in October, citing the upcoming EU's political ad transparency regulation as the reason. The regulation aims to combat disinformation and foreign interference by requiring online platforms to disclose political ad sponsors and whether personal data was used for targeting.\n\nMeta claims the regulation imposes \"an untenable level of complexity and legal uncertainty.\" The company emphasizes that the change won't affect politicians' ability to post content, just their ability to pay to amplify it.\n\nSandro Gozi, the EU regulation's rapporteur, criticized Meta's decision, accusing the company of prioritizing profit over transparency and democratic accountability.\n\nGoogle made a similar decision last year, citing the law's broad definition of \"political advertisement\" as an obstacle to compliance. Both companies' actions raise questions about the effectiveness of their ad review systems in identifying and blocking political ads that might slip through, potentially violating the EU's transparency rules. This isn't the first time Meta has blamed EU laws for altering its advertising practices, as it is also facing Digital Markets Act scrutiny over its \"pay-or-consent\" advertising model.\n",
    "chinese_title": "Meta将在欧盟停止投放Facebook和Instagram上的政治广告",
    "chinese_summary": "Meta将于10月起暂停欧盟地区Facebook和Instagram上的政治、选举和社会议题广告，理由是欧盟即将出台的政治广告透明度监管规定。 该规定旨在打击虚假信息和外国干预，要求在线平台披露政治广告赞助商以及是否使用了个人数据进行定向投放。\n\nMeta声称该规定带来了“难以维持的复杂性和法律不确定性”。该公司强调，这一变化不会影响政客发布内容的能力，只会影响他们付费推广内容的能力。\n\n欧盟监管报告员桑德罗·戈齐批评了Meta的决定，指责该公司将利润置于透明度和民主责任之上。\n\n去年谷歌也做出了类似决定，理由是该法律对“政治广告”的广泛定义阻碍了合规。 两家公司的行为引发了对其广告审查系统有效性的质疑，即该系统在识别和阻止可能漏网的政治广告方面是否有效，这些广告可能会违反欧盟的透明度规则。 这并非Meta首次将改变广告行为归咎于欧盟法律，因为它还因其“付费或同意”的广告模式而面临《数字市场法案》的审查。"
  },
  {
    "id": "44678535",
    "title": "How Anthropic teams use Claude Code",
    "url": "https://www.anthropic.com/news/how-anthropic-teams-use-claude-code",
    "summary": "This article details how various teams at Anthropic are using Claude Code, an AI tool, to improve their workflows and increase productivity. Teams across data infrastructure, product development, security engineering, inference, and others are leveraging Claude Code for various tasks.\n\n**Key Use Cases:**\n\n*   **Data Infrastructure:** Automating data engineering tasks, troubleshooting infrastructure issues (like Kubernetes debugging), creating plain-text workflows for non-technical users (Finance), codebase navigation for new hires, and documenting work sessions.\n*   **Product Development:** Fast prototyping with auto-accept mode, synchronous coding for core features, test generation, bug fixes, and codebase exploration.\n*   **Security Engineering:** Debugging complex infrastructure incidents, Terraform code review and analysis, documentation synthesis (runbooks), test-driven development, and project onboarding.\n*   **Inference:** Codebase comprehension and onboarding, unit test generation with edge case coverage, machine learning concept explanation, cross-language code translation, and Kubernetes management.\n\n**Key Benefits:**\n\n*   **Increased efficiency:** Reduced time for debugging, coding, and documentation.\n*   **Improved code quality:** Automated test generation and bug fixes.\n*   **Bridged skill gaps:** Enabled non-technical staff to perform technical tasks.\n*   **Faster onboarding:** Reduced time for new hires to understand complex systems.\n*   **Enhanced collaboration:** Improved communication and shared understanding.\n\n**Key Tips:**\n\n*   Document workflows and tools extensively in Claude.md files.\n*   Utilize auto-accept mode for asynchronous tasks.\n*   Create self-sufficient loops for Claude to verify its own work.\n*   Craft clear, detailed prompts.\n*   Use custom slash commands to streamline tasks.\n*   Leverage Claude for documentation synthesis.\n*   Start with code generation and verify correctness.\n",
    "chinese_title": "Anthropic 团队如何使用 Claude Code",
    "chinese_summary": "Anthropic各团队如何利用AI工具Claude Code提升工作效率\n\n**主要应用场景：**\n\n*   **数据基础设施：** 自动化数据工程任务，解决基础设施问题（如Kubernetes调试），为非技术用户（财务）创建纯文本工作流，为新员工提供代码库导航，以及记录工作会话。\n*   **产品开发：** 利用自动接受模式进行快速原型设计，核心功能同步编码，测试生成，错误修复，以及代码库探索。\n*   **安全工程：** 调试复杂的IT基础设施事件，Terraform代码审查和分析，文档生成（运维手册），测试驱动开发，以及项目入职培训。\n*   **推理：** 代码库理解和入职培训，生成具有边缘情况覆盖的单元测试，机器学习概念解释，跨语言代码翻译，以及Kubernetes管理。\n\n**主要优势：**\n\n*   **提高效率：** 减少调试、编码和文档编写的时间。\n*   **提升代码质量：** 自动化测试生成和错误修复。\n*   **弥合技能差距：** 使非技术人员能够执行技术任务。\n*   **加快入职速度：** 减少新员工理解复杂系统的时间。\n*   **加强协作：** 改善沟通和共同理解。\n\n**主要技巧：**\n\n*   在Claude.md文件中广泛记录工作流和工具。\n*   利用自动接受模式执行异步任务。\n*   创建自给自足的循环，让Claude验证自己的工作。\n*   编写清晰、详细的提示语。\n*   使用自定义斜杠命令来简化任务。\n*   利用Claude进行文档生成。\n*   从代码生成开始，并验证其正确性。"
  },
  {
    "id": "44684172",
    "title": "Final Benchmarks of Clear Linux on Intel: ~48% Faster Than Ubuntu Out-of-the-Box",
    "url": "https://www.phoronix.com/review/clear-linux-48p-ubuntu",
    "summary": "This article by Michael Larabel from July 2025 benchmarks the final performance of Intel's discontinued Clear Linux distribution against Ubuntu 25.04 on an Intel Xeon Max (Sapphire Rapids) server. Clear Linux, known for its aggressive x86_64 optimizations, was discontinued by Intel due to financial difficulties.\n\nThe testing was conducted on a Supermicro Hyper SuperServer SYS-221H-TNR / X13DEM with dual Xeon Max 9468 processors, 512GB of RAM, and a 7.6TB NVMe SSD. Clear Linux 43760 featured a Linux 6.15.5 kernel, GCC 15.1.1, and Python 3.13. Ubuntu 25.04 was tested in its default configuration (intel_cpufreq scaling driver with \"schedutil\" governor) and with the CPU frequency scaling governor switched to \"performance\" to match Clear Linux.\n\nThe benchmark aims to showcase the performance gains achieved by Clear Linux's optimizations, even on systems beyond Intel's latest generation (Granite Rapids, which they couldn't test due to hardware unavailability). The power consumption of the dual Xeon Max 9468 processors was also monitored during the tests to assess the impact of Clear Linux's optimizations on CPU power usage. The article promises a comparison of performance across various workloads, including Java server applications, video encoding, HPC benchmarks, databases, and deep learning tasks. Further, a similar analysis is planned for AMD systems to show the benefits of Intel's Linux software optimizations on their competitor's hardware. The conclusion (on page 6) highlights overall performance metrics.\n",
    "chinese_title": "英特尔Clear Linux最终基准测试：比Ubuntu开箱即用快约48%",
    "chinese_summary": "迈克尔·拉拉贝尔 2025 年 7 月的文章对英特尔已停止维护的 Clear Linux 发行版与 Ubuntu 25.04 在 Intel Xeon Max (Sapphire Rapids) 服务器上的最终性能进行了基准测试。Clear Linux 以其激进的 x86_64 优化而闻名，但由于财务困难而被英特尔停止维护。\n\n测试在一台 Supermicro Hyper SuperServer SYS-221H-TNR / X13DEM 上进行，该服务器配备了双 Xeon Max 9468 处理器、512GB 内存和一个 7.6TB NVMe SSD。Clear Linux 43760 采用了 Linux 6.15.5 内核、GCC 15.1.1 和 Python 3.13。Ubuntu 25.04 在其默认配置（带有“schedutil”调控器的 intel_cpufreq 缩放驱动程序）以及 CPU 频率缩放调控器切换到“performance”以匹配 Clear Linux 的情况下进行了测试。\n\n该基准测试旨在展示 Clear Linux 的优化所实现的性能提升，即使是在超出英特尔最新一代（Granite Rapids，由于硬件不可用而无法测试）的系统上也是如此。在测试期间还监测了双 Xeon Max 9468 处理器的功耗，以评估 Clear Linux 的优化对 CPU 功耗的影响。该文章承诺比较各种工作负载的性能，包括 Java 服务器应用程序、视频编码、HPC 基准测试、数据库和深度学习任务。此外，还计划对 AMD 系统进行类似的分析，以展示英特尔的 Linux 软件优化在其竞争对手硬件上的优势。结论（在第 6 页）重点介绍了整体性能指标。"
  },
  {
    "id": "44671484",
    "title": "Use Your Type System",
    "url": "https://www.dzombak.com/blog/2025/07/use-your-type-system/",
    "summary": "This article advocates for leveraging the type system to prevent bugs arising from using generic types like integers, strings, and UUIDs for distinct concepts within a codebase. The author observes that passing around raw `int` or `string` values often leads to confusion and errors, such as using a User ID where an Account ID is expected.\n\nThe solution is to define custom types for each domain-specific concept, even if they are based on underlying primitives like `uuid.UUID`, `float64`, or `int`. This allows the compiler to catch errors when values of one type are inadvertently passed where another type is expected. The article illustrates this with examples of `AccountID` and `UserID` types based on `uuid.UUID`, demonstrating how the compiler prevents mixing them up.\n\nThe author also shares a practical example from their `libwx` weather library, where types are defined for various measurements like temperature and humidity. This prevents mistakes such as passing a Fahrenheit temperature to a function expecting Celsius or accidentally swapping the order of arguments, because the compiler can enforce type correctness.\n\nThe core message is to utilize the type system to its full potential to add semantic meaning to simple data types, thereby improving code safety and reliability, even in languages with relatively simple type systems like Go.\n",
    "chinese_title": "使用你的类型系统",
    "chinese_summary": "本文倡导利用类型系统来防止因在代码库中使用诸如整数、字符串和 UUID 等通用类型来表示不同的概念而产生的错误。作者观察到，传递原始 `int` 或 `string` 值通常会导致混淆和错误，例如在需要账户 ID 的地方使用了用户 ID。\n\n解决方案是为每个领域特定的概念定义自定义类型，即使它们基于诸如 `uuid.UUID`、`float64` 或 `int` 之类的底层基元。 这样，当一个类型的值被意外地传递到需要另一个类型的地方时，编译器就可以捕获错误。本文通过基于 `uuid.UUID` 的 `AccountID` 和 `UserID` 类型的示例说明了这一点，展示了编译器如何防止将它们混淆。\n\n作者还分享了来自其 `libwx` 天气库的一个实际示例，其中为各种测量值（如温度和湿度）定义了类型。 这可以防止诸如将华氏温度传递给期望摄氏温度的函数，或意外交换参数顺序等错误，因为编译器可以强制执行类型正确性。\n\n核心信息是充分利用类型系统，为简单数据类型添加语义意义，从而提高代码的安全性和可靠性，即使在像 Go 这样类型系统相对简单的语言中也是如此。"
  },
  {
    "id": "44684467",
    "title": "VTuber agency VShojo shuts down after talent exodus",
    "url": "https://www.theverge.com/news/713343/vshojo-shutting-down-ironmouse-missing-charity-donations",
    "summary": "VTuber agency VShojo is shutting down after a mass exodus of talent, triggered by top performer Ironmouse leaving over unpaid funds and a missing $500,000 charity donation. CEO Justin \"Gunrun\" Ignacio announced the closure, taking full responsibility for mismanagement and financial difficulties. He admitted that the company failed to generate enough revenue to sustain its \"talent-first\" model, despite raising $11 million. Ignacio also acknowledged that funds raised by Ironmouse for charity were spent by the company, based on the belief that they could raise sufficient investment to cover all costs. With 12 out of 13 creators leaving, citing unpaid wages, the agency could not recover and is now closing down, leaving the CEO deeply sorry to the talent, staff, and community.\n",
    "chinese_title": "VTuber事务所VShojo在人才流失后倒闭",
    "chinese_summary": "VTuber事务所VShojo因大量成员出走而倒闭，起因是头部艺人Ironmouse因未支付款项和50万美元慈善捐款失踪而离开。首席执行官Justin \"Gunrun\" Ignacio宣布关闭，并对管理不善和财务困难承担全部责任。他承认，尽管筹集了1100万美元，但该公司未能产生足够的收入来维持其“人才至上”的模式。Ignacio还承认，Ironmouse为慈善事业筹集的资金被公司花费，原因是他们相信能够筹集足够的投资来支付所有费用。由于13位创作者中有12位因工资未付而离开，该事务所无法恢复，现已关闭，首席执行官对此向艺人、员工和社区深感抱歉。"
  },
  {
    "id": "44671373",
    "title": "PSA: SQLite WAL checksums fail silently and may lose data",
    "url": "https://avi.im/blag/2025/sqlite-wal-checksum/",
    "summary": "This article highlights a potential data loss issue in SQLite's WAL (Write-Ahead Logging) mode. While WAL uses checksums to ensure data integrity, SQLite's behavior upon detecting a checksum error is problematic. Instead of raising an error, it silently drops the corrupted frame and all subsequent frames in the WAL, even if those later frames are valid and contain crucial data. This occurs during the WAL index rebuild process (.db-shm file), typically triggered after an unclean shutdown or when the .db-shm file is missing.\n\nThe author emphasizes that this isn't a bug but intentional design. When a checksum mismatch occurs during WAL recovery, SQLite stops processing the WAL at the point of corruption. Because SQLite auto-checkpoints and truncates the WAL, the loss is permanent.\n\nThe article criticizes this behavior because it can lead to unnecessary data loss. A corrupted frame from an older version of a page, or belonging to an unimportant index, can trigger the dropping of newer, valid data. The author proposes that SQLite should throw an error upon corruption detection, allowing developers to handle the situation instead of silently losing data. Alternative behaviors might include an option to ignore corruption and continue or more sophisticated recovery mechanisms.\n\nThe author acknowledges the possible reasoning behind the current design—that SQLite often runs in embedded systems where crashing is less desirable than limping along with potentially corrupt data. However, they argue that the silent data loss is unacceptable.\n",
    "chinese_title": "PSA：SQLite WAL 校验和静默失败可能导致数据丢失",
    "chinese_summary": "本文重点介绍了SQLite的WAL（预写式日志）模式中潜在的数据丢失问题。尽管WAL使用校验和来确保数据完整性，但SQLite在检测到校验和错误时的行为存在问题。它不会引发错误，而是会默默地丢弃损坏的帧以及WAL中的所有后续帧，即使后面的帧有效并包含关键数据。这种情况发生在WAL索引重建过程中（.db-shm文件），通常是在非正常关机后或当.db-shm文件丢失时触发。\n\n作者强调，这不是一个错误，而是有意为之的设计。当在WAL恢复过程中发生校验和不匹配时，SQLite会在损坏点停止处理WAL。由于SQLite会自动执行检查点并截断WAL，因此损失是永久性的。\n\n本文批评了这种行为，因为它可能导致不必要的数据丢失。来自旧版本的页面或属于不重要索引的损坏帧可能会触发删除较新的有效数据。作者建议SQLite应该在检测到损坏时抛出错误，允许开发人员处理这种情况，而不是默默地丢失数据。替代行为可能包括忽略损坏并继续的选项，或更复杂的恢复机制。\n\n作者承认了当前设计背后的可能原因——SQLite通常运行在嵌入式系统中，在这种情况下，崩溃不如带着可能损坏的数据勉强运行那么令人不快。然而，他们认为默默地丢失数据是不可接受的。"
  },
  {
    "id": "44676961",
    "title": "A GPU Calculator That Helps Calculate What GPU to Use",
    "url": "https://calculator.inference.ai/",
    "summary": "This article describes a \"GPU Calculator,\" likely a tool or resource designed to help users determine which GPU (Graphics Processing Unit) is most suitable for their needs. The core function of the calculator is to provide recommendations based on user input. While the article itself is brief, the implication is that the calculator takes into account factors such as:\n\n*   **Intended Use:** The type of tasks the GPU will be used for (gaming, video editing, 3D rendering, AI/machine learning, etc.).\n*   **Budget:** The price range the user is willing to spend.\n*   **Performance Requirements:** Desired frame rates in games, rendering speeds, or processing power for specific applications.\n*   **Other Considerations:** Power consumption, compatibility with existing hardware, and specific features.\n\nUltimately, the GPU calculator aims to simplify the often complex process of selecting a GPU by providing a data-driven recommendation based on individual needs and constraints. It helps users avoid overspending on unnecessary power or underspending and not getting enough performance.\n",
    "chinese_title": "帮助计算该用哪个GPU的GPU计算器",
    "chinese_summary": "本文介绍一种“GPU计算器”，它很可能是一种工具或资源，旨在帮助用户确定哪种GPU（图形处理器）最适合他们的需求。该计算器的核心功能是根据用户输入提供建议。虽然本文本身很简短，但其含义是该计算器考虑了以下因素：\n\n*   **预期用途：** GPU将用于的任务类型（游戏、视频编辑、3D渲染、AI/机器学习等）。\n*   **预算：** 用户愿意花费的价格范围。\n*   **性能\n\n最终，GPU计算器旨在通过基于个人需求和约束提供数据驱动的建议，从而简化通常复杂的GPU选择过程。 它可以帮助用户避免过度消费在不必要的性能上，或者消费不足而无法获得足够的性能。"
  },
  {
    "id": "44676961",
    "title": "A GPU Calculator That Helps Calculate What GPU to Use",
    "url": "https://calculator.inference.ai/",
    "summary": "This article introduces a \"GPU calculator,\" a tool designed to help users determine the most appropriate GPU for their needs. The premise is straightforward: users input specific requirements or performance goals (likely related to gaming, video editing, AI development, or other GPU-intensive tasks), and the calculator outputs a recommendation of suitable GPUs.\n\nThe likely benefit of such a calculator is to simplify the often complex process of GPU selection. Performance characteristics, pricing, power consumption, and compatibility can all influence a buying decision. A well-designed GPU calculator would ideally consider these factors.\n\nThe article's focus suggests a practical utility for both novice and experienced users. New users might benefit from guidance in navigating the complex GPU market, while experienced users might use the tool to quickly compare options based on specific parameters.\n\nUltimately, the article highlights the existence of a resource aimed at demystifying and streamlining the GPU selection process by providing data-driven recommendations based on user-defined criteria.\n",
    "chinese_title": "一个帮你计算用哪个GPU的计算器",
    "chinese_summary": "本文介绍了一种“GPU计算器”，该工具旨在帮助用户确定最适合他们需求的GPU。 其前提很简单：用户输入具体的需求或性能目标（可能与游戏、视频编辑、AI开发或其他GPU密集型任务相关），计算器会输出合适的GPU推荐。\n\n这种计算器的可能好处是简化通常复杂的GPU选择过程。 性能特征、价格、功耗和兼容性都会影响购买决策。 一个设计良好的GPU计算器理想情况下会考虑这些因素。\n\n本文的重点表明它对新手和有经验的用户都具有实际用途。 新用户可能会从指导中受益，从而在复杂的GPU市场中进行导航，而有经验的用户可能会使用该工具根据特定参数快速比较选项。\n\n最终，本文重点介绍了一种资源，旨在通过提供基于用户定义标准的数据驱动建议来简化和消除GPU选择过程的神秘性。"
  },
  {
    "id": "44676315",
    "title": "New Aarch64 Back End",
    "url": "https://ziglang.org/devlog/2025/#2025-07-23",
    "summary": "This article summarizes key developments in the Zig programming language during 2025, focusing on compiler backends and performance improvements.\n\n**Aarch64 Backend:** A new Aarch64 backend developed by Andrew Kelley and Jacob Young has been introduced. Although still under development, it's already performing well in behavior tests and is faster than the x86 backend in some benchmarks. The backend uses machine code instruction encoding for its internal MIR structure and has a bespoke two-pass liveness analysis.\n\n**Parallel Code Generation:** The x86_64 backend has seen a significant performance boost with parallelized code generation. This allows multiple code generation jobs to run simultaneously, resulting in substantial reductions in wall-clock time for compiling Zig projects.\n\n**Self-Hosted x86 Backend Default:** The self-hosted x86 backend is now the default for Debug builds on Linux and macOS, offering significant speed improvements compared to the LLVM backend.\n\n**FreeBSD and NetBSD Cross-Compilation:** Zig now supports cross-compilation for FreeBSD 14.0.0+ and NetBSD 10.1+, using a strategy of extracting public symbol information from pre-built libc libraries to create stub libraries.\n\nThe article also mentions an introductory video on the Zig build system and ongoing work on incremental compilation. Overall, Zig is seeing substantial advancements in compilation speed and backend capabilities, driven by internal development efforts and community contributions.\n",
    "chinese_title": "全新的Aarch64后端",
    "chinese_summary": "本文总结了 Zig 编程语言在 2025 年的主要进展，重点关注编译器后端和性能改进。\n\n**Aarch64 后端：** 由 Andrew Kelley 和 Jacob Young 开发的全新 Aarch64 后端已推出。 虽然仍在开发中，但它在行为测试中表现良好，并且在某些基准测试中比 x86 后端更快。 该后端使用机器代码指令编码作为其内部 MIR 结构，并具有定制的两遍活性分析。\n\n**并行代码生成：** x86_64 后端通过并行代码生成实现了显着的性能提升。 这允许多个代码生成作业同时运行，从而大大缩短了编译 Zig 项目的实际时间。\n\n**自托管 x86 后端默认为：** 自托管 x86 后端现在是 Linux 和 macOS 上 Debug 构建的默认后端，与 LLVM 后端相比，提供了显着的速度提升。\n\n**FreeBSD 和 NetBSD 交叉编译：** Zig 现在支持 FreeBSD 14.0.0+ 和 NetBSD 10.1+ 的交叉编译，采用的策略是从预构建的 libc 库中提取公共符号信息以创建存根库。\n\n本文还提到一个关于 Zig 构建系统的入门视频以及正在进行的增量编译工作。 总的来说，在内部开发工作和社区贡献的推动下，Zig 在编译速度和后端功能方面取得了重大进展。"
  },
  {
    "id": "44682798",
    "title": "Places to Intervene in a System",
    "url": "https://donellameadows.org/archives/leverage-points-places-to-intervene-in-a-system/",
    "summary": "This webpage, hosted by the Donella Meadows Project, is dedicated to preserving and promoting the legacy of Donella H. (Dana) Meadows, a renowned systems thinker, writer, and teacher. The project aims to manage intellectual property rights related to her published works and provide an easily accessible online archive of her materials.\n\nThe website organizes Dana Meadows' work into several key sections: Publications (including books, articles, Global Citizen columns, and Dear Folks letters), Systems Thinking Resources (featuring her influential works like \"Thinking in Systems,\" \"Leverage Points,\" and \"Dancing With Systems,\" along with a comprehensive resource list), and Multimedia (videos and photos). It also includes a collection of quotations, tributes, and a section where users can submit their favorite Dana Meadows quotes.\n\nEssentially, the Donella Meadows Project serves as a centralized hub for anyone interested in learning about or engaging with Dana Meadows' work on systems thinking and its applications to social change. The project's mission is to make her ideas accessible to a broad audience of students, practitioners, and leaders, ensuring her contributions continue to inspire and inform future generations.\n",
    "chinese_title": "干预系统的切入点",
    "chinese_summary": "这个由唐娜拉·梅多斯项目主办的网页，致力于保存和推广著名系统思想家、作家和教师唐娜拉·H·（达娜）·梅多斯的遗产。该项目旨在管理与其出版作品相关的知识产权，并提供一个易于访问的在线资料库。\n\n该网站将达娜·梅多斯的作品分为几个主要部分：出版物（包括书籍、文章、“全球公民”专栏和“亲爱的朋友们”信件），系统思考资源（以其有影响力的作品，如《系统之美》、《杠杆点》和《与系统共舞》为特色，以及一份全面的资源列表）和多媒体（视频和照片）。它还包括一个语录集、致敬和用户可以提交他们最喜欢的达娜·梅多斯语录的部分。\n\n本质上，唐娜拉·梅多斯项目是任何对学习或参与达娜·梅多斯关于系统思考及其在社会变革中的应用感兴趣的人的中心枢纽。该项目的使命是使她的思想能够被广泛的学生、从业者和领导者所访问，确保她的贡献继续激励和启发后代。"
  },
  {
    "id": "44685084",
    "title": "Pylon of the Month",
    "url": "https://www.pylonofthemonth.org/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "每月铁塔",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44634208",
    "title": "Mwm – The smallest usable X11 window manager",
    "url": "https://github.com/lslvr/mwm",
    "summary": "Mwm is presented as an ultra-minimalist X11 window manager, designed with only 20 lines of code for extreme simplicity and hackability. It deliberately lacks features common in other window managers, such as mouse control, virtual desktops, configuration files, title bars, borders, menus, and only allows for fullscreen windows, one visible at a time.\n\nIts core functionality is limited to launching, switching between, and closing windows. Users can customize keybindings using the `grab` and `map` macros as demonstrated in `mwm-custom.c`. The author emphasizes the need for small, modifiable software in a landscape dominated by complex and bloated applications. The build process is described as \"dead simple\" using the provided `build.sh` script. The project champions software that is easily understood and modified, asserting that true free software should be accessible for user customization. The focus is on providing essential functionality and fostering user empowerment through hackability.\n",
    "chinese_title": "Mwm – 最小可用的 X11 窗口管理器",
    "chinese_summary": "Mwm是一个极简主义的X11窗口管理器，仅用20行代码设计，追求极致的简洁性和可 Hack 性。它刻意缺少其他窗口管理器常见的特性，例如鼠标控制、虚拟桌面、配置文件、标题栏、边框、菜单，并且只允许全屏窗口，一次只能显示一个。\n\n其核心功能仅限于启动、切换和关闭窗口。用户可以使用`grab`和`map`宏自定义快捷键，如`mwm-custom.c`所示。作者强调在充斥着复杂臃肿应用程序的环境中，小型、可修改软件的重要性。构建过程被描述为“极其简单”，使用提供的`build.sh`脚本即可。该项目提倡易于理解和修改的软件，并声称真正的自由软件应该便于用户自定义。重点在于提供基本功能，并通过可 Hack 性来培养用户自主性。"
  },
  {
    "id": "44674123",
    "title": "Air Force unit suspends use of Sig Sauer pistol after shooting death of airman",
    "url": "https://www.nhpr.org/nh-news/2025-07-23/sig-sauer-pistol-air-force-shooting-death",
    "summary": "Following the fatal shooting of an airman at F.E. Warren Airforce Base in Wyoming, the U.S. Air Force Global Strike Command has suspended the use of the Sig Sauer M18 pistol pending a \"comprehensive review.\" The airman, 21-year-old Brayden Tyriq Lovan, served in the 90th Security Forces Squadron.\n\nThe suspension comes amidst ongoing concerns about the safety of the Sig Sauer P320, the civilian model upon which the M18 is based. Both pistols have faced allegations of unintentional discharges, leading to numerous civil lawsuits. Sig Sauer has defended the P320, calling safety concerns \"lies and misinformation.\"\n\nThe Air Force confirmed the review is related to the airman's death, but did not indicate if the investigation would expand to other units. The Global Strike Command will use alternative weapons during the investigation, and all bases within the command will conduct inspections of the M18. Sig Sauer has offered assistance to the U.S. Military during its investigation. The Global Strike Command oversees the Air Force's bomber fleet and nuclear command forces.\n",
    "chinese_title": "空军部队暂停使用西格绍尔手枪，此前发生空军士兵枪击死亡事件。",
    "chinese_summary": "Following the fatal shooting of an airman at F.E. Warren Airforce Base in Wyoming, the U.S. Air Force Global Strike Command has suspended the use of the Sig Sauer M18 pistol pending a \"comprehensive review.\" The airman, 21-year-old Brayden Tyriq Lovan, served in the 90th Security Forces Squadron.\n\nThe suspension comes amidst ongoing concerns about the safety of the Sig Sauer P320, the civilian model upon which the M18 is based. Both pistols have faced allegations of unintentional discharges, leading to numerous civil lawsuits. Sig Sauer has defended the P320, calling safety concerns \"lies and misinformation.\"\n\nThe Air Force confirmed the review is related to the airman's death, but did not indicate if the investigation would expand to other units. The Global Strike Command will use alternative weapons during the investigation, and all bases within the command will conduct inspections of the M18. Sig Sauer has offered assistance to the U.S. Military during its investigation. The Global Strike Command oversees the Air Force's bomber fleet and nuclear command forces.\n"
  },
  {
    "id": "44683663",
    "title": "Does [MacOS] even matter anymore?",
    "url": "https://www.macworld.com/article/2827504/does-the-mac-even-matter-anymore.html",
    "summary": "This Macworld article by Roman Loyola explores whether macOS is losing relevance in Apple's ecosystem, particularly in light of the upcoming macOS 26 and its comparison to iPadOS 26. While macOS 26 brings improvements like Liquid Glass, a new Phone app, and enhanced Spotlight Search, it lacks a groundbreaking feature, making it seem overshadowed by Apple's other software releases.\n\nThe article argues that iPadOS 26, with its new macOS-like windowing system, is the more exciting release, positioning the iPad as a potential Mac replacement for many users. The iPad's increasing capabilities for productivity, coupled with its existing strengths, make it a more compelling workstation, especially for students and general users.\n\nLoyola contrasts this with macOS 26, which introduces useful but not revolutionary features. He points out that many average users are unfamiliar with even basic macOS features, suggesting a disconnect between Apple's enhancements and broader user adoption. The article criticizes Apple for prioritizing iOS features on the Mac and failing to deliver exclusive, attention-grabbing Mac innovations.\n\nWhile acknowledging Craig Federighi's stance that the Mac isn't going away or merging with the iPad, the article suggests Apple may be pushing iPadOS to gain more traction as a workstation due to its closed ecosystem, granting Apple greater control and revenue. The article concludes with the irony that while the Mac is considered the \"truck\" in Apple's car/truck metaphor, trucks are actually highly popular, highlighting the enduring appeal of the Mac's utility and capabilities, even though Apple seems to be favoring the iPad. The author expresses concern that Apple is not investing enough in innovative macOS features.\n",
    "chinese_title": "Does [MacOS] even matter anymore?",
    "chinese_summary": "macOS是否正在失去苹果生态系统中的地位？"
  },
  {
    "id": "44634143",
    "title": "Show HN: Tsbro – TypeScript for the browser, no build step",
    "url": "https://github.com/stagas/tsbro",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Tsbro – 浏览器 TypeScript，无需构建步骤",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44682759",
    "title": "Asif Aziz: The billionaire and the tax evading gift shops",
    "url": "https://www.londoncentric.media/p/asf-aziz-london-candy-shops-gift-shop-unpaid-tax",
    "summary": "生成摘要时出错",
    "chinese_title": "Asif Aziz: The billionaire and the tax evading gift shops",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44663074",
    "title": "AMD CEO sees chips from TSMC's US plant costing 5%-20% more",
    "url": "https://www.bloomberg.com/news/articles/2025-07-23/amd-ceo-su-sees-chips-from-us-tsmc-plant-costing-5-to-20-more",
    "summary": "生成摘要时出错",
    "chinese_title": "AMD CEO sees chips from TSMC's US plant costing 5%-20% more",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44671601",
    "title": "Show HN: Nia – MCP server that gives more docs and repos to coding agents",
    "url": "https://www.trynia.ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Nia – MCP server that gives more docs and repos to coding agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44684286",
    "title": "Neural biomarkers identified for obsessive-compulsive disorder symptoms in brain",
    "url": "https://medicalxpress.com/news/2025-07-neural-biomarkers-obsessive-compulsive-disorder.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Neural biomarkers identified for obsessive-compulsive disorder symptoms in brain",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44632783",
    "title": "The POSIX specification of vi",
    "url": "https://pubs.opengroup.org/onlinepubs/9799919799/utilities/vi.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The POSIX specification of vi",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44672003",
    "title": "There is no memory safety without thread safety",
    "url": "https://www.ralfj.de/blog/2025/07/24/memory-safety.html",
    "summary": "生成摘要时出错",
    "chinese_title": "There is no memory safety without thread safety",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44632674",
    "title": "I wasted weeks hand optimizing assembly because I benchmarked on random data",
    "url": "https://www.vidarholen.net/contents/blog/?p=1160",
    "summary": "生成摘要时出错",
    "chinese_title": "I wasted weeks hand optimizing assembly because I benchmarked on random data",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44680881",
    "title": "Open Source Hackathon 2025",
    "url": "https://osshackathon.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Open Source Hackathon 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44676559",
    "title": "Visa and Mastercard: The global payment duopoly (2024)",
    "url": "https://quartr.com/insights/edge/visa-and-mastercard-the-global-payment-duopoly",
    "summary": "生成摘要时出错",
    "chinese_title": "Visa and Mastercard: The global payment duopoly (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44684625",
    "title": "Visualize Your Puppet Data in Grafana with the Observability Data Connector",
    "url": "https://www.puppet.com/blog/tutorial-puppet-grafana-observability",
    "summary": "This tutorial explains how to visualize Puppet data in Grafana using the Observability Data Connector, a feature of Puppet Enterprise Advanced. It guides users through the entire process, starting with module installation and ending with creating insightful Grafana dashboards.\n\nThe steps include:\n\n1.  **Installing the Observability Data Connector module:** Adding the module to the control repository and deploying it.\n2.  **Creating a Profile Class:** Developing a code-based profile class to configure module settings like stale time and drop zone.\n3.  **Classifying the Puppet Server:** Using the Puppet Enterprise console to assign the profile class to the Puppet Server.\n4.  **Verifying Data Collection:** Confirming that data is being written to the designated drop zone in Prometheus format.\n5.  **Setting up a Prometheus Service:** Installing and configuring Prometheus to expose the Puppet data as metrics.\n6.  **Integrating with Grafana:** Connecting Grafana to the Prometheus endpoint to visualize Puppet activity. Creating dashboards to monitor run durations, resource changes, and identify anomalies.\n7.  **Scale and Customize:** Scale your configuration for different environments and tools.\n\nThe tutorial provides specific instructions, code examples, and screenshots to help users successfully integrate Puppet data with Grafana, enabling data-driven decisions for infrastructure management. This allows teams to monitor, troubleshoot, and optimize their infrastructure more effectively.\n",
    "chinese_title": "Visualize Your Puppet Data in Grafana with the Observability Data Connector",
    "chinese_summary": "This tutorial explains how to visualize Puppet data in Grafana using the Observability Data Connector, a feature of Puppet Enterprise Advanced. It guides users through the entire process, starting with module installation and ending with creating insightful Grafana dashboards.\n\nThe steps include:\n\n1.  **Installing the Observability Data Connector module:** Adding the module to the control repository and deploying it.\n2.  **Creating a Profile Class:** Developing a code-based profile class to configure module settings like stale time and drop zone.\n3.  **Classifying the Puppet Server:** Using the Puppet Enterprise console to assign the profile class to the Puppet Server.\n4.  **Verifying Data Collection:** Confirming that data is being written to the designated drop zone in Prometheus format.\n5.  **Setting up a Prometheus Service:** Installing and configuring Prometheus to expose the Puppet data as metrics.\n6.  **Integrating with Grafana:** Connecting Grafana to the Prometheus endpoint to visualize Puppet activity. Creating dashboards to monitor run durations, resource changes, and identify anomalies.\n7.  **Scale and Customize:** Scale your configuration for different environments and tools.\n\nThe tutorial provides specific instructions, code examples, and screenshots to help users successfully integrate Puppet data with Grafana, enabling data-driven decisions for infrastructure management. This allows teams to monitor, troubleshoot, and optimize their infrastructure more effectively.\n"
  },
  {
    "id": "44633024",
    "title": "RE#: High performance derivative-based regular expression matching (2024)",
    "url": "https://arxiv.org/abs/2407.20479",
    "summary": "生成摘要时出错",
    "chinese_title": "RE#: High performance derivative-based regular expression matching (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44670326",
    "title": "UK: Phone networks down: EE, BT, Three, Vodafone, O2 not working in mass outage",
    "url": "https://www.the-independent.com/tech/ee-bt-three-vodafone-o2-down-phone-networks-outage-latest-b2795260.html",
    "summary": "生成摘要时出错",
    "chinese_title": "UK: Phone networks down: EE, BT, Three, Vodafone, O2 not working in mass outage",
    "chinese_summary": "生成摘要出错"
  },
  {
    "id": "44682175",
    "title": "The future is not self-hosted",
    "url": "https://www.drewlyton.com/story/the-future-is-not-self-hosted/",
    "summary": "Drew argues that self-hosting, while seemingly empowering, is not the solution to corporate control over our digital lives. He begins by highlighting Amazon's restricting access to purchased Kindle books, illustrating how users merely \"rent\" digital assets. He extends this concern to other cloud services like Dropbox and Google Photos, where corporations control access and data usage.\n\nHe details his own experiment in self-hosting, building a home server running open-source alternatives to popular cloud apps. While successful, he acknowledges the significant technical challenges and time commitment, making it impractical for most.\n\nThe core argument is that self-hosting, while granting individual control, is inherently isolating and inefficient. It replicates the internet as \"suburbia\" with everyone maintaining duplicate infrastructure and lacking the benefits of interconnected communities.\n\nInstead, Drew advocates for \"community-hosted\" solutions: publicly funded, accessible, and at-cost cloud services, similar to libraries. He envisions services providing storage, photo sharing, and media streaming, emphasizing end-to-end encryption and standardized protocols to prevent vendor lock-in. He suggests these could be run by nonprofits or cooperatives as well.\n\nHe concludes that true freedom from corporate control requires solidarity, mutual aid, and shared, community-owned infrastructure, moving beyond the myth of self-reliance and individual empowerment. He wants the self-hosting community to apply its knowledge to build a better, shared cloud.\n",
    "chinese_title": "The future is not self-hosted",
    "chinese_summary": "Drew argues that self-hosting, while seemingly empowering, is not the solution to corporate control over our digital lives. He begins by highlighting Amazon's restricting access to purchased Kindle books, illustrating how users merely \"rent\" digital assets. He extends this concern to other cloud services like Dropbox and Google Photos, where corporations control access and data usage.\n\nHe details his own experiment in self-hosting, building a home server running open-source alternatives to popular cloud apps. While successful, he acknowledges the significant technical challenges and time commitment, making it impractical for most.\n\nThe core argument is that self-hosting, while granting individual control, is inherently isolating and inefficient. It replicates the internet as \"suburbia\" with everyone maintaining duplicate infrastructure and lacking the benefits of interconnected communities.\n\nInstead, Drew advocates for \"community-hosted\" solutions: publicly funded, accessible, and at-cost cloud services, similar to libraries. He envisions services providing storage, photo sharing, and media streaming, emphasizing end-to-end encryption and standardized protocols to prevent vendor lock-in. He suggests these could be run by nonprofits or cooperatives as well.\n\nHe concludes that true freedom from corporate control requires solidarity, mutual aid, and shared, community-owned infrastructure, moving beyond the myth of self-reliance and individual empowerment. He wants the self-hosting community to apply its knowledge to build a better, shared cloud.\n"
  },
  {
    "id": "44634576",
    "title": "Why concatenative programming matters (2012)",
    "url": "http://evincarofautumn.blogspot.com/2012/02/why-concatenative-programming-matters.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Why concatenative programming matters (2012)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44672329",
    "title": "Hulk Hogan Has Died",
    "url": "https://www.tmz.com/2025/07/24/hulk-hogan-dead/",
    "summary": "生成摘要时出错",
    "chinese_title": "Hulk Hogan Has Died",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44676348",
    "title": "Revisiting Moneyball",
    "url": "https://djpardis.medium.com/revisiting-moneyball-074fc2435b07",
    "summary": "生成摘要时出错",
    "chinese_title": "Revisiting Moneyball",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44675965",
    "title": "Intel CEO Letter to Employees",
    "url": "https://morethanmoore.substack.com/p/intel-ceo-letter-to-employees",
    "summary": "生成摘要时出错",
    "chinese_title": "Intel CEO Letter to Employees",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44678112",
    "title": "Alto turns Apple Notes into a website",
    "url": "https://alto.so/",
    "summary": "生成摘要时出错",
    "chinese_title": "Alto turns Apple Notes into a website",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44661846",
    "title": "CARA – High precision robot dog using rope",
    "url": "https://www.aaedmusa.com/projects/cara",
    "summary": "生成摘要时出错",
    "chinese_title": "CARA – High precision robot dog using rope",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44663227",
    "title": "AI overviews cause massive drop in search clicks",
    "url": "https://arstechnica.com/ai/2025/07/research-shows-google-ai-overviews-reduce-website-clicks-by-almost-half/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI overviews cause massive drop in search clicks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44672145",
    "title": "When swiping supplants scissors: The hidden cost of touchscreens",
    "url": "https://caseorganic.medium.com/when-swiping-supplants-scissors-the-hidden-cost-of-touchscreens-and-how-designers-can-help-dba0fa65f5b7",
    "summary": "生成摘要时出错",
    "chinese_title": "When swiping supplants scissors: The hidden cost of touchscreens",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44683149",
    "title": "Breakneck: China's Quest to Engineer the Future",
    "url": "https://danwang.co/breakneck/",
    "summary": "生成摘要时出错",
    "chinese_title": "Breakneck: China's Quest to Engineer the Future",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44679489",
    "title": "Tap into the \"Hemingway effect\" to finish what you start",
    "url": "https://bigthinkmedia.substack.com/p/tap-into-the-hemingway-effect-to",
    "summary": "生成摘要时出错",
    "chinese_title": "Tap into the \"Hemingway effect\" to finish what you start",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44669858",
    "title": "Open Source Maintenance Fee",
    "url": "https://github.com/wixtoolset/issues/issues/8974",
    "summary": "生成摘要时出错",
    "chinese_title": "Open Source Maintenance Fee",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44635783",
    "title": "Finding Robert Bogucki, the man who disappeared on purpose",
    "url": "https://www.abc.net.au/news/2025-07-06/robert-bogucki-nowhere-man-on-his-43-days-in-the-desert/105234668",
    "summary": "生成摘要时出错",
    "chinese_title": "Finding Robert Bogucki, the man who disappeared on purpose",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44680376",
    "title": "UK Gov Petition: Repeal the Online Safety Act",
    "url": "https://petition.parliament.uk/petitions/722903",
    "summary": "生成摘要时出错",
    "chinese_title": "UK Gov Petition: Repeal the Online Safety Act",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44666896",
    "title": "Apache HTTP Server: 'RewriteCond expr' always evaluates to true",
    "url": "https://github.com/apache/httpd/commit/8abb3d06b23975705ebcf4bf4476464fd0b9bd0b",
    "summary": "生成摘要时出错",
    "chinese_title": "Apache HTTP Server: 'RewriteCond expr' always evaluates to true",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44672859",
    "title": "Major quantum computing advance made obsolete by teenager (2018)",
    "url": "https://www.quantamagazine.org/teenager-finds-classical-alternative-to-quantum-recommendation-algorithm-20180731/",
    "summary": "生成摘要时出错",
    "chinese_title": "Major quantum computing advance made obsolete by teenager (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44636240",
    "title": "Covers as a way of learning music and code",
    "url": "https://ntietz.com/blog/covers-as-a-way-of-learning/",
    "summary": "生成摘要时出错",
    "chinese_title": "Covers as a way of learning music and code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44670319",
    "title": "A valid HTML zip bomb",
    "url": "https://ache.one/notes/html_zip_bomb",
    "summary": "生成摘要时出错",
    "chinese_title": "A valid HTML zip bomb",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44640471",
    "title": "Working on a Programming Language in the Age of LLMs",
    "url": "https://ryelang.org/blog/posts/programming-language-in-age-of-llms/",
    "summary": "生成摘要时出错",
    "chinese_title": "Working on a Programming Language in the Age of LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44657556",
    "title": "Lumo: Privacy-first AI assistant",
    "url": "https://proton.me/blog/lumo-ai",
    "summary": "生成摘要时出错",
    "chinese_title": "Lumo: Privacy-first AI assistant",
    "chinese_summary": "生成摘要时出错"
  }
]