[
  {
    "id": "46057488",
    "title": "Voyager 1 Is About to Reach One Light-Day from Earth",
    "url": "https://scienceclock.com/voyager-1-is-about-to-reach-one-light-day-from-earth/",
    "summary": "NASA's Voyager 1, launched in 1977, is approaching a significant milestone: by November 15, 2026, it will be one light-day (24 hours travel time for a radio signal) away from Earth, a distance of 16.1 billion miles (25.9 billion km). While a light-day is a small fraction of a light-year, this marks a major achievement in deep-space exploration.\n\nVoyager 1 entered interstellar space in 2012 and is currently the most distant human-made object. Traveling at roughly 11 miles per second, it increases its distance from the Sun by about 3.5 astronomical units annually. Despite its age and harsh environment, Voyager 1 continues to transmit data, powered by radioisotope thermoelectric generators expected to last into the 2030s.\n\nCommunication with Voyager 1 is a slow process. Commands take a full day to arrive, and another day for confirmation, contrasting sharply with the near-instantaneous communication with the Moon or the relatively short delays with Mars and Pluto.\n\nBeyond the record distance, Voyager 1's mission holds historical significance. Its planetary flybys and the famous \"Pale Blue Dot\" image underscore the immense scale of our solar system and the remarkable durability of this exploratory spacecraft.\n",
    "chinese_title": "旅行者1号即将抵达距离地球一光日处",
    "chinese_summary": "美国宇航局的旅行者1号，于1977年发射，正接近一个重要的里程碑：到2026年11月15日，它将距离地球一个光日（无线电信号24小时的传播时间），即161亿英里（259亿公里）。虽然一个光日仅是光年的一小部分，但这标志着深空探索的一项重大成就。\n\n旅行者1号于2012年进入星际空间，目前是距离我们最远的人造物体。它以大约每秒11英里的速度飞行，每年与太阳的距离增加约3.5个天文单位。尽管年代久远且环境恶劣，旅行者1号仍继续传输数据，由预计能持续到2030年代的放射性同位素热电发电机供电。\n\n与旅行者1号的通信是一个缓慢的过程。指令需要整整一天才能到达，再过一天才能得到确认，这与和月球的近乎瞬时通信，或者与火星和冥王星的相对较短的延迟形成了鲜明对比。\n\n除了创纪录的距离外，旅行者1号的任务还具有历史意义。它的行星飞掠和著名的“暗淡蓝点”图像突显了我们太阳系的巨大规模和这艘探索宇宙飞船的卓越耐久性。"
  },
  {
    "id": "46059227",
    "title": "Cloudflare outage should not have happened",
    "url": "https://ebellani.github.io/blog/2025/cloudflare-outage-should-not-have-happened-and-they-seem-to-be-missing-the-point-on-how-to-avoid-it-in-the-future/",
    "summary": "Eduardo Bellani critiques Cloudflare's RCA of a recent major outage, arguing that while their explanation of the technical cause (a database query returning unexpected duplicate columns due to security changes) is accurate, their proposed preventative measures miss the fundamental issue.\n\nBellani asserts the problem isn't primarily physical replication or resource management, but rather a logical mismatch between application logic and database schema. The core issue stems from an uncontrolled interaction between the application and the database, which can't be reliably fixed with more tests or feature flags.\n\nHe criticizes Cloudflare's reliance on ClickHouse for speed without sufficient attention to data correctness and consistency. He echoes his previous advice regarding GCP's outage, emphasizing the need for analytical design: no nullable fields, full database normalization, and formally verified application code. He believes these techniques are crucial to preventing similar failures by design.\n\nWhile acknowledging FAANG-style companies may be hesitant to adopt formal methods wholesale, Bellani advocates for their use in critical systems to ensure failures become impossible rather than just less likely. He sees this approach as essential for maintaining internet stability and protecting cloud users. The outage highlights a logical single point of failure despite physical replication efforts.\n",
    "chinese_title": "Cloudflare 停机本不该发生",
    "chinese_summary": "爱德华多·贝拉尼批评了Cloudflare最近一次重大故障的根本原因分析报告，他认为，虽然他们对技术原因的解释（由于安全变更，数据库查询返回了意外的重复列）是准确的，但他们提出的预防措施却忽略了根本问题。\n\n贝拉尼断言，问题主要不是物理复制或资源管理，而是应用程序逻辑和数据库模式之间的逻辑不匹配。核心问题源于应用程序和数据库之间不受控制的交互，这无法通过更多的测试或功能标志来可靠地修复。\n\n他批评Cloudflare过度依赖ClickHouse来提高速度，而没有充分关注数据的正确性和一致性。他呼应了他之前关于GCP故障的建议，强调需要进行分析设计：无空字段、完全数据库规范化和形式验证的应用程序代码。他认为这些技术对于通过设计来防止类似故障至关重要。\n\n虽然承认FAANG风格的公司可能不愿意完全采用形式化方法，但贝拉尼倡导在关键系统中使用它们，以确保故障变得不可能发生，而不仅仅是减少发生的可能性。他认为这种方法对于维护互联网稳定和保护云用户至关重要。这次故障突出了一个逻辑上的单点故障，尽管已经进行了物理复制。"
  },
  {
    "id": "46058065",
    "title": "OpenAI needs to raise at least $207B by 2030 so it can continue to lose money",
    "url": "https://ft.com/content/23e54a28-6f63-4533-ab96-3756d9c88bad",
    "summary": "According to an FT Alphaville article, HSBC estimates that OpenAI needs to raise at least $207 billion by 2030 to sustain its operations, implying the company is expected to continue operating at a loss. The article itself is behind a paywall, requiring registration or a paid subscription to access the full content. The available text highlights various subscription options offered by the Financial Times (FT), including trial periods, standard digital access, and premium digital access, each with different levels of included content and features. These subscription options offer access to global news, expert opinions, the FT app, curated newsletters, videos, podcasts, and premium features like Lex and the FT Digital Edition.\n",
    "chinese_title": "OpenAI需要在2030年前筹集至少2070亿美元，以便继续亏损。",
    "chinese_summary": "据英国《金融时报》Alphaville专栏文章报道，汇丰银行估计，OpenAI到2030年需要筹集至少2070亿美元才能维持运营，这意味着该公司预计将继续亏损运营。该文章本身需要付费阅读，需要注册或付费订阅才能访问全部内容。现有文本重点介绍了英国《金融时报》（FT）提供的各种订阅选项，包括试用期、标准数字访问和高级数字访问，每种订阅都包含不同级别的内容和功能。这些订阅选项提供对全球新闻、专家观点、FT应用程序、精选新闻通讯、视频、播客以及Lex和FT数字版等高级功能的访问权限。"
  },
  {
    "id": "46055944",
    "title": "I don't care how well your \"AI\" works",
    "url": "https://fokus.cool/2025/11/25/i-dont-care-how-well-your-ai-works.html",
    "summary": "In a blog post dated November 25, 2025, the author expresses deep concern about the pervasive integration of AI, particularly large language models (LLMs), into everyday life and especially within progressive hacker circles. They lament the observed \"brainworm\" effect of LLMs, leading skilled programmers to become overly reliant on these tools, which the author equates to a harmful coping mechanism akin to developing a drinking problem.\n\nThe author acknowledges the devaluation of skilled crafts like coding due to AI, similar to historical impacts on designers, writers, and others. While admitting their privileged position to avoid using LLMs, the author notes the societal pressure and disadvantages faced by those who choose not to adopt them.\n\nThe central argument is that focusing solely on the quality of AI output misses the fundamental problems: AI reinforces existing power structures and control. The author argues that tools become extensions of ourselves, shaping our thoughts, and allowing AI to permeate this process cedes control to those who own and control AI infrastructure.\n\nThe author views AI as a capitalist and fascist dream, requiring enormous resources to convert capital into power and back, while simultaneously destroying craft and skilled labor. They argue that craft and expression are crucial for self-control, and AI is actively undermining them.\n\nThe post concludes with a call to action for survival under \"metastatic capitalism,\" urging readers to support friends, organize in unions, prioritize mental health by reducing social media usage, and create something new. The author emphasizes that thriving is the ultimate act of disobedience.\n",
    "chinese_title": "我不在乎你的“人工智能”有多好。",
    "chinese_summary": "2025年11月25日的一篇博文中，作者对人工智能，特别是大型语言模型（LLM）在日常生活，尤其是在进步黑客圈子中的普遍融合表示深切担忧。他们哀叹观察到的LLM“脑虫”效应，导致熟练的程序员过度依赖这些工具，作者将其比作一种有害的应对机制，类似于养成酗酒的习惯。\n\n作者承认由于人工智能，像编码这样的熟练技艺正在贬值，类似于历史上对设计师、作家和其他人的影响。作者承认自己有避免使用LLM的特权，但同时指出那些选择不采用它们的人所面临的社会压力和劣势。\n\n中心论点是，仅仅关注人工智能输出的质量忽略了根本问题：人工智能强化了现有的权力结构和控制。作者认为，工具成为我们自身的延伸，塑造着我们的思想，而允许人工智能渗透到这个过程中，就等于将控制权让给了那些拥有和控制人工智能基础设施的人。\n\n作者认为人工智能是资本主义和法西斯主义的梦想，需要巨大的资源才能将资本转化为权力并循环，同时摧毁手工艺和熟练劳动力。他们认为，手工艺和表达对于自我控制至关重要，而人工智能正在积极地破坏它们。\n\n该帖子最后呼吁在“转移性资本主义”下生存，敦促读者支持朋友，组织工会，通过减少社交媒体的使用来优先考虑心理健康，并创造新的事物。作者强调，蓬勃发展是最终的违抗行为。"
  },
  {
    "id": "46055935",
    "title": "A cell so minimal that it challenges definitions of life",
    "url": "https://www.quantamagazine.org/a-cell-so-minimal-that-it-challenges-definitions-of-life-20251124/",
    "summary": "This article discusses the discovery of *Candidatus Sukunaarchaeum mirabile* (Sukunaarchaeum), a microbe with an exceptionally small genome that challenges our understanding of life's minimal requirements. Discovered by Takuro Nakayama and his team, Sukunaarchaeum is a parasitic archaeon whose genome lacks genes for basic metabolism, meaning it relies entirely on a host cell for nutrition and growth. This is unusual, as even other highly reduced genomes in symbiotic bacteria retain some metabolic capabilities.\n\nThe researchers found Sukunaarchaeum by sequencing the genomes associated with a single-celled dinoflagellate, *Citharistes regius*. The archaeon's genome is only 238,000 base pairs, far smaller than other archaea, and the analysis reveals it primarily encodes proteins for replication, lacking metabolic genes. It belongs to the DPANN archaea group, known for small sizes and symbiotic lifestyles.\n\nThis discovery suggests that the diversity of cellular life is far greater than previously understood, with a potentially large proportion of microbial biodiversity existing in parasitic relationships. It also raises questions about the definition of life, as Sukunaarchaeum occupies a grey area between a self-sufficient cell and a virus. While it isn't evolving into a virus, as it still possesses its own gene expression machinery, it pushes the boundaries of how simple a living organism can be. Many questions remain about the archaeon’s true host and how it interacts with it, and its reliance on poorly understood proteins.\n",
    "chinese_title": "挑战生命定义的极简细胞",
    "chinese_summary": "本文探讨了*Candidatus Sukunaarchaeum mirabile* (Sukunaarchaeum) 的发现，这是一种基因组异常微小的微生物，挑战了我们对生命最低需求的理解。Sukunaarchaeum 由中山拓郎及其团队发现，是一种寄生古菌，其基因组缺乏基础代谢所需的基因，这意味着它完全依赖宿主细胞获取营养和生长。这很不寻常，因为即使是共生细菌中基因组高度简化的生物，也保留了一些代谢能力。\n\n研究人员通过测序与单细胞甲藻 *Citharistes regius* 相关的基因组，发现了 Sukunaarchaeum。该古菌的基因组只有 238,000 个碱基对，远小于其他古菌，分析表明它主要编码复制所需的蛋白质，缺乏代谢基因。它属于 DPANN 古菌群，该菌群以体积小和共生生活方式而闻名。\n\n这一发现表明，细胞生命的多样性远大于之前的认识，可能很大一部分微生物生物多样性存在于寄生关系中。它也引发了关于生命定义的疑问，因为 Sukunaarchaeum 占据了自给自足细胞和病毒之间的灰色地带。虽然它并没有进化成病毒，因为它仍然拥有自己的基因表达机制，但它突破了生物体可以有多简单的界限。关于该古菌的真正宿主及其如何与之相互作用，以及其对人们知之甚少的蛋白质的依赖，仍然存在许多问题。"
  },
  {
    "id": "46055421",
    "title": "Statistical Process Control in Python",
    "url": "https://timothyfraser.com/sigma/statistical-process-control-in-python.html",
    "summary": "This article provides a hands-on guide to performing Statistical Process Control (SPC) in Python using `pandas`, `plotnine`, and `scipy`. It emphasizes the importance of SPC in monitoring and improving product quality over time, identifying when interventions are needed.\n\nThe tutorial uses a case study of a Japanese hot springs (onsen) business that needs to monitor temperature, pH, and sulfur levels to maintain its quality standards. It covers essential steps:\n\n1.  **Data Preparation and Descriptive Statistics:** Importing data, calculating mean and standard deviation using a custom function.\n2.  **Process Overview Visual:** Creating a process overview chart with individual measurements, subgroup means, and overall process average with histogram visualizing the distribution of temperature measurements.\n3.  **Subgroup Statistics:** Calculating key statistics for each subgroup (xbar, range, standard deviation) and overall process statistics.\n4.  **Control Charts:** Generating Average and Standard Deviation Charts to monitor process stability and detect out-of-control conditions.\n5.  **Moving Range Charts:** Applying moving range charts when dealing with individual measurements instead of subgroups, showcasing how to estimate process variation.\n\nThe tutorial includes a learning check question to reinforce the concepts. The conclusion highlights the significance of SPC visuals and statistics in understanding process behavior and driving data-driven decisions for process improvement. The article provides code snippets for each step, making it a practical resource for implementing SPC in Python.\n",
    "chinese_title": "Python中的统计过程控制",
    "chinese_summary": "本文提供了一份实战指南，介绍如何使用 `pandas`、`plotnine` 和 `scipy` 在 Python 中执行统计过程控制 (SPC)。它强调了 SPC 在监控和改进产品质量，以及识别何时需要干预方面的重要性。\n\n本教程以一家日本温泉业务为例，该业务需要监控温度、pH 值和硫含量，以维持其质量标准。教程涵盖了以下关键步骤：\n\n1.  **数据准备和描述性统计:** 导入数据，使用自定义函数计算均值和标准差。\n2.  **过程概览图:** 创建过程概览图，包含单个测量值、子组均值和整体过程平均值，并用直方图可视化温度测量值的分布。\n3.  **子组统计:** 计算每个子组的关键统计量 (xbar, 极差, 标准差) 和整体过程统计量。\n4.  **控制图:** 生成均值和标准差控制图，以监控过程稳定性并检测失控状态。\n5.  **移动极差图:** 在处理单个测量值而非子组时应用移动极差图，展示如何估计过程变异。\n\n本教程包含一个学习检查问题，以巩固概念。结论强调了 SPC 可视化和统计在理解过程行为以及推动数据驱动的过程改进决策方面的重要性。文章为每个步骤都提供了代码片段，使其成为在 Python 中实施 SPC 的实用资源。"
  },
  {
    "id": "46059620",
    "title": "Optery (YC W22) Hiring CISO, Release Manager, Tech Lead (Node), Full Stack Eng",
    "url": "https://www.optery.com/careers/",
    "summary": "Optery (YC W22) is currently hiring for multiple positions: a Chief Information Security Officer (CISO), a Release Manager, a Tech Lead specializing in Node.js, and a Full Stack Engineer. The company's career page might require enabling \"Personalization\" cookies (through the cookie banner in the bottom left corner) to fully display the job listings and content.\n",
    "chinese_title": "Optery (YC W22) 招聘首席信息安全官、发布经理、技术负责人（Node）、全栈工程师",
    "chinese_summary": "Optery (YC W22) 现正招聘多个职位：首席信息安全官 (CISO)、发布经理、Node.js 技术主管和全栈工程师。公司招聘页面可能需要启用“个性化” cookies（通过左下角的 cookie 横幅）才能完整显示职位列表和内容。"
  },
  {
    "id": "46016288",
    "title": "Show HN: I turned algae into a bio-altimeter and put it on a weather balloon",
    "url": "https://radi8.dev/blog/stratospore/",
    "summary": "The author of the Show HN post, radi8.dev, describes their project to create a \"bio-altimeter\" using algae and launch it on a weather balloon to the stratosphere. The core idea is to leverage the photosynthetic activity of algae as an indicator of altitude, specifically UV radiation exposure.\n\nThe project involved several key steps:\n\n*   **Culturing algae:** The author cultivated *Euglena gracilis* algae, known for their sensitivity to UV light.\n*   **Bio-altimeter design:** They designed a custom container to house the algae and measure changes in oxygen levels, which directly correlate with photosynthetic activity and thus UV exposure. This container was equipped with sensors to monitor oxygen, temperature, and pressure, as well as a pump for mixing the algae culture.\n*   **Electronics and data logging:** An ESP32 microcontroller was used to control the sensors, pump, and log data to an SD card. A GPS module was also included to track the balloon's location.\n*   **Weather balloon launch:** The bio-altimeter was attached to a weather balloon and launched, ascending to the stratosphere.\n*   **Data analysis:** After retrieving the payload, the author analyzed the collected data, focusing on the correlation between altitude (derived from pressure) and oxygen levels in the algae culture. The results suggested a relationship between UV exposure and algae activity, validating the concept of a bio-altimeter.\n\nThe project was presented as an experimental proof-of-concept, showcasing the potential of using biological systems as sensors in extreme environments. The author also open-sourced the hardware and software designs, encouraging others to build upon their work. The post included technical details, code snippets, and data visualizations illustrating the project's development and results.\n",
    "chinese_title": "展示HN：我把藻类变成生物高度计，并把它放在气象气球上",
    "chinese_summary": "作者 radi8.dev 在 Show HN 帖子中介绍了他们的项目，该项目旨在使用藻类创建一个“生物高度计”并将其用气象气球发射到平流层。 核心思想是利用藻类的光合作用作为海拔高度的指标，特别是紫外线辐射暴露。\n\n该项目涉及几个关键步骤：\n\n*   **培养藻类：** 作者培养了对紫外线敏感的 *眼虫藻*。\n*   **生物高度计设计：** 他们设计了一个定制容器来容纳藻类并测量氧气水平的变化，这直接与光合作用活动以及紫外线暴露相关。 该容器配备了传感器来监测氧气、温度和压力，以及一个用于混合藻类培养物的泵。\n*   **电子设备和数据记录：** 使用 ESP32 微控制器来控制传感器、泵并将数据记录到 SD 卡。 还包括一个 GPS 模块来跟踪气球的位置。\n*   **气象气球发射：** 生物高度计被连接到气象气球并发射，上升到平流层。\n*   **数据分析：** 在检索有效载荷后，作者分析了收集的数据，重点关注海拔高度（从压力得出）与藻类培养物中氧气水平之间的相关性。 结果表明紫外线暴露与藻类活性之间存在关系，验证了生物高度计的概念。\n\n该项目被展示为一个实验性的概念验证，展示了在极端环境中使用生物系统作为传感器的潜力。 作者还开源了硬件和软件设计，鼓励其他人在此基础上进行构建。 该帖子包括技术细节、代码片段和数据可视化，说明了该项目的开发和结果。"
  },
  {
    "id": "46058912",
    "title": "Slashdot Effect",
    "url": "https://en.wikipedia.org/wiki/Slashdot_effect",
    "summary": "The Slashdot effect, also known as \"slashdotting\" or the \"hug of death,\" describes the phenomenon where a smaller website experiences a massive surge in traffic after being linked to by a popular website, like Slashdot, Reddit, or Twitter. This influx often overwhelms the smaller site's resources, leading to slowdowns or temporary unavailability. The core causes include insufficient bandwidth, server limitations, and restrictive traffic quotas, commonly affecting sites hosted on shared services.\n\nWhile initially associated with Slashdot, the term has broadened to encompass similar effects from other platforms, leading to terms like \"being farked\" or the \"Reddit effect.\" The general term \"flash crowd\" captures the essence of sudden, overwhelming traffic.\n\nThe effect can be detrimental, akin to a denial-of-service attack, but unintentional. While major websites are built to handle large traffic volumes, smaller sites with limited resources, large media files, or inefficient dynamic content generation are more vulnerable.\n\nWhile the impact of the Slashdot effect has diminished with the rise of cloud hosting and similar sites, it can still occur, especially through mentions by popular social media users. The phenomenon can also impact community-based sites, bringing in new users, which can lead to unwanted behavior like trolling. Solutions involve mirroring content or using services that can handle increased traffic.\n",
    "chinese_title": "Slashdot Effect:\n\nSlashdot效应",
    "chinese_summary": "Slashdot效应，又称“slashdotting”或“死亡之拥”，指的是当一个小型网站被Slashdot、Reddit或Twitter等热门网站链接后，访问量激增的现象。这种涌入通常会压垮小型网站的资源，导致速度减慢或暂时无法访问。其核心原因包括带宽不足、服务器限制以及流量配额限制，这通常会影响托管在共享服务上的网站。\n\n虽然最初与Slashdot相关，但该术语已扩展到包括来自其他平台的类似影响，从而产生了“being farked”或“Reddit效应”等术语。“突发流量”这一通用术语概括了突如其来的、压倒性的流量的本质。\n\n这种效应可能是有害的，类似于拒绝服务攻击，但并非有意为之。虽然大型网站的设计可以处理大量的流量，但资源有限、包含大型媒体文件或动态内容生成效率低下的小型网站更容易受到影响。\n\n虽然随着云计算的兴起和类似网站的出现，Slashdot效应的影响已经减弱，但它仍然可能发生，尤其是在被受欢迎的社交媒体用户提及时。这种现象也可能影响社区网站，带来新用户，从而导致不良行为，如钓鱼。解决方案包括镜像内容或使用可以处理增加流量的服务。"
  },
  {
    "id": "46025223",
    "title": "JOPA: Java compiler in C++, Jikes modernized to Java 6 with Claude",
    "url": "https://github.com/7mind/jopa",
    "summary": "JOPA (Java Object Program Assembler) is a modernization of Jikes, the historical independent Java compiler written in C++. This project aims to bring Jikes up to date with Java 5 and Java 6 features, potentially making it useful for bootstrapping Java development.\n\nThe updated JOPA supports key Java 5 features such as generics, enhanced for-loops, varargs, enums, autoboxing/unboxing, static imports, and annotations. It also includes Java 6 features like class file version 50.0 and enhanced debugging information.\n\nBuilding JOPA requires CMake 3.20+ and a C++17 compiler, along with iconv/ICU for encoding support. The project provides instructions for building with Nix and a generic CMake approach, detailing useful CMake options for debugging, floating-point emulation, encoding, and JVM tests.\n\nThe original Jikes compiler was notable for its speed, error correction capabilities, and high-quality error messages, often outperforming the standard `javac` compiler. Development on Jikes ceased in 2005 due to the introduction of generics, making it less relevant. This JOPA project aims to revive Jikes by adding support for those features, making it usable again.\n",
    "chinese_title": "JOPA：用C++编写的Java编译器，Jikes现代化至Java 6，并使用Claude",
    "chinese_summary": "JOPA (Java 对象程序汇编器) 是对 Jikes 的现代化改造，Jikes 是一个历史悠久的、用 C++ 编写的独立 Java 编译器。该项目旨在使 Jikes 与 Java 5 和 Java 6 的特性保持同步，使其有可能用于引导 Java 开发。\n\n更新后的 JOPA 支持关键的 Java 5 特性，例如泛型、增强型 for 循环、可变参数、枚举、自动装箱/拆箱、静态导入和注解。它还包括 Java 6 特性，如类文件版本 50.0 和增强的调试信息。\n\n构建 JOPA 需要 CMake 3.20+ 和 C++17 编译器，以及用于编码支持的 iconv/ICU。 该项目提供了使用 Nix 构建和通用 CMake 方法的说明，详细说明了用于调试、浮点仿真、编码和 JVM 测试的有用 CMake 选项。\n\n最初的 Jikes 编译器以其速度、错误纠正能力和高质量的错误消息而闻名，通常优于标准的 `javac` 编译器。由于泛型的引入，Jikes 的开发于 2005 年停止，使其不再那么重要。这个 JOPA 项目旨在通过添加对这些特性的支持来复兴 Jikes，使其再次可用。"
  },
  {
    "id": "46051449",
    "title": "Show HN: KiDoom – Running DOOM on PCB Traces",
    "url": "https://www.mikeayles.com/#kidoom",
    "summary": "This \"Show HN: KiDoom – Running DOOM on PCB Traces\" article highlights a project where the classic video game DOOM is run on PCB (Printed Circuit Board) traces. While the content provided is limited, we can infer the following:\n\nThe article is showcasing a novel technical achievement: executing DOOM, a resource-intensive game for its time, on the unconventional medium of PCB traces. This implies innovative hardware and software engineering.\n\nThe accompanying stats suggest the creator or team behind KiDoom has significant experience in electronics and software development, specifically in the automotive or embedded systems domain:\n\n*   **3 ECUs Developed:** Experience developing embedded control units, likely in automotive applications.\n*   **10+ Years Exp.:** Demonstrates considerable expertise in their field.\n*   **28.5M+ Miles Driven:** Possibly related to testing or deployment of automotive systems controlled by their ECUs.\n\nThe mention of \"Selected Projects\" and \"Private Tools\" indicates that KiDoom is just one example of their broader work. It also hints at proprietary tools or techniques used in their development process.\n\nIn essence, the article presents KiDoom as an impressive demonstration of engineering ingenuity, running a video game on a highly unconventional platform, likely backed by a team with substantial experience in embedded systems. The key takeaway is the impressive feat of running DOOM on a PCB, hinting at the broader capabilities of the project creators.\n",
    "chinese_title": "展示HN：KiDoom – 在PCB走线上运行DOOM",
    "chinese_summary": "展示HN：KiDoom – 在PCB走线上运行DOOM\n\n这篇文章“展示HN：KiDoom – 在PCB走线上运行DOOM”突出了一个在PCB（印刷电路板）走线上运行经典视频游戏DOOM的项目。虽然提供的内容有限，但我们可以推断出以下几点：\n\n文章展示了一项新颖的技术成就：在非常规的PCB走线上运行DOOM，这款在当时资源消耗较大的游戏。 这意味着创新的硬件和软件工程。\n\n随附的统计数据表明，KiDoom的创建者或团队在电子和软件开发方面拥有丰富的经验，特别是在汽车或嵌入式系统领域：\n\n*   **3个ECU已开发：** 开发嵌入式控制单元的经验，可能是在汽车应用中。\n*   **10年以上经验：** 证明在其领域拥有相当的专业知识。\n*   **2850万+英里驾驶里程：** 可能与由他们的ECU控制的汽车系统的测试或部署有关。\n\n“精选项目”和“私有工具”的提及表明，KiDoom只是他们更广泛工作的一个例子。 这也暗示了他们开发过程中使用的专有工具或技术。\n\n本质上，这篇文章将KiDoom呈现为一项令人印象深刻的工程独创性演示，在一个高度非常规的平台上运行视频游戏，可能由一个在嵌入式系统方面拥有丰富经验的团队提供支持。 关键在于在PCB上运行DOOM的令人印象深刻的壮举，暗示了项目创建者更广泛的能力。"
  },
  {
    "id": "46005581",
    "title": "Is DWPD Still a Useful SSD Spec?",
    "url": "https://klarasystems.com/articles/is-dwpd-still-useful-ssd-spec/",
    "summary": "This article discusses the relevance of DWPD (Drive Writes Per Day) as an SSD endurance metric, arguing that it's becoming less useful due to the increasing complexity of NAND flash technology.\n\nThe author explains how SSDs based on NAND flash have limited write endurance, degrading with each Program/Erase (P/E) cycle. While SSDs offer advantages like speed and lower latency compared to HDDs, they introduce new failure modes, including controller failure, failure to retain charge, and write endurance exhaustion. As cells age, they become slower and less accurate, leading to performance degradation.\n\nThe article highlights the trade-offs between capacity and longevity. Higher density storage (MLC, TLC, QLC, PLC) allows storing more data per cell but reduces P/E cycles and overall lifespan compared to SLC. The piece emphasizes that purchasing larger drives with more physical cells distributes the workload, extending endurance, as the same amount of data written over time results in fewer P/E cycles per cell.\n\nIt also points out that most consumer SSDs are replaced due to needing more space or performance degradation from write endurance exhaustion. Mitigating write endurance problems involves considering bit density, utilizing wear leveling (distributing writes evenly across cells), increasing usable capacity, and increasing raw capacity. Ultimately, the author suggests that simply looking at DWPD is an incomplete way to evaluate SSD lifespan and that a holistic view, considering factors like drive size, usage patterns, and the type of NAND flash used, is more effective.\n",
    "chinese_title": "DWPD 仍然是個有用的 SSD 指標嗎？",
    "chinese_summary": "本文探讨了DWPD（每日驱动器写入次数）作为固态硬盘耐久性指标的相关性，并认为由于NAND闪存技术的日益复杂，该指标正变得越来越不实用。\n\n作者解释了基于NAND闪存的固态硬盘写入耐久性有限，每次编程/擦除 (P/E) 周期都会降低其性能。虽然固态硬盘相比机械硬盘具有速度和更低延迟等优势，但它们引入了新的故障模式，包括控制器故障、电荷保持失败以及写入耐久性耗尽。随着存储单元的老化，它们会变得更慢且更不准确，从而导致性能下降。\n\n本文强调了容量和寿命之间的权衡。更高密度存储（MLC、TLC、QLC、PLC）允许每个存储单元存储更多数据，但与 SLC 相比，会减少 P/E 周期和整体寿命。文章强调，购买具有更多物理存储单元的更大容量的驱动器可以分散工作负载，从而延长耐久性，因为随着时间的推移写入相同数量的数据会导致每个存储单元的 P/E 周期更少。\n\n文章还指出，大多数消费级固态硬盘的更换是因为需要更多空间或因写入耐久性耗尽而导致性能下降。缓解写入耐久性问题涉及考虑位密度、利用损耗均衡（在存储单元之间均匀分配写入操作）、增加可用容量以及增加原始容量。最终，作者认为仅仅关注 DWPD 是评估固态硬盘寿命的一种不完整的方式，而全面考虑驱动器大小、使用模式和所使用的 NAND 闪存类型等因素会更有效。"
  },
  {
    "id": "46055177",
    "title": "Image Diffusion Models Exhibit Emergent Temporal Propagation in Videos",
    "url": "https://arxiv.org/abs/2511.19936",
    "summary": "This arXiv article (arXiv:2511.19936) presents a new study on image diffusion models, exploring their capabilities beyond image generation. The authors, Youngseo Kim, Dohyun Kim, Geonhee Han, and Paul Hongsuck Seo, discovered that self-attention maps within these models can be reinterpreted as semantic label propagation kernels. This allows for identifying pixel-level correspondences between relevant image regions, effectively enabling semantic understanding.\n\nThe key innovation lies in extending this mechanism temporally across video frames, creating a temporal propagation kernel. This kernel facilitates zero-shot object tracking via segmentation without needing explicit training for video tasks. The authors further enhance the robustness and consistency of this label propagation through test-time optimization strategies like DDIM inversion, textual inversion, and adaptive head weighting.\n\nBased on these findings, they introduce DRIFT (Diffusion-based Refinement for Tracking), a novel framework for video object tracking. DRIFT leverages a pre-trained image diffusion model and incorporates SAM (Segment Anything Model)-guided mask refinement. The framework achieves state-of-the-art zero-shot performance on standard video object segmentation benchmarks, showcasing the emergent temporal reasoning capabilities of image diffusion models when adapted for video analysis. In essence, the research reveals a hidden potential of image diffusion models for understanding and tracking objects in video sequences, offering a promising avenue for zero-shot video analysis tasks.\n",
    "chinese_title": "图像扩散模型展现出视频中涌现的时间传播",
    "chinese_summary": "这篇arXiv文章 (arXiv:2511.19936) 提出了一项关于图像扩散模型的新研究，探索了它们在图像生成之外的能力。作者Youngseo Kim、Dohyun Kim、Geonhee Han和Paul Hongsuck Seo发现，这些模型中的自注意力图可以被重新解释为语义标签传播核。这使得识别相关图像区域之间的像素级对应关系成为可能，从而有效地实现语义理解。\n\n关键创新在于将这种机制在时间上扩展到视频帧，从而创建一个时间传播核。该核通过分割促进零样本对象跟踪，而无需为视频任务进行显式训练。作者还通过测试时优化策略（如DDIM反演、文本反演和自适应头部加权）来增强标签传播的鲁棒性和一致性。\n\n基于这些发现，他们引入了DRIFT（用于跟踪的基于扩散的细化），这是一个用于视频对象跟踪的新型框架。DRIFT利用预训练的图像扩散模型，并结合了SAM（分割一切模型）引导的掩码细化。该框架在标准视频对象分割基准测试中实现了最先进的零样本性能，展示了图像扩散模型在适应视频分析时所产生的涌现式时间推理能力。本质上，该研究揭示了图像扩散模型在理解和跟踪视频序列中的对象方面的隐藏潜力，为零样本视频分析任务提供了一个有希望的途径。"
  },
  {
    "id": "46021577",
    "title": "Surprisingly, Emacs on Android is pretty good",
    "url": "https://kristofferbalintona.me/posts/202505291438/",
    "summary": "This article explores the surprisingly positive experience of using Emacs on Android. While not as seamless as the desktop version, it's a viable option, especially with the right setup.\n\nThe author highlights key considerations: Emacs on Android requires either the basic installation through F-Droid (limited elisp only) or a more complex setup with Termux for accessing other CLI tools (recommended). Termux allows Emacs to use tools like git but involves a more involved installation process. Android's sandboxing can make accessing files outside the Emacs app's designated area cumbersome, requiring manual directory access.\n\nConfiguration is crucial. The author recommends consulting the Emacs manual's Android section and initially using the Customize interface for easier touch-based adjustments. Enabling minor modes like `modifier-bar-mode` and `tool-bar-mode` improves the UI. They also suggest using a virtual keyboard like Hacker's Keyboard or Unexpected Keyboard for easier access to modifiers and symbols. Font installation requires placing files directly in the `~/fonts/` directory.\n\nThe conclusion emphasizes using the Customize interface, enabling touchscreen-specific options, and installing a virtual keyboard. The author expresses satisfaction with their current setup, migrating relevant portions of their desktop configuration. They also offer a wishlist including touchscreen gestures and automatic keyboard switching, as well as a larger toolbar.\n",
    "chinese_title": "出乎意料的是，安卓上的Emacs相当不错。",
    "chinese_summary": "本文探讨了在 Android 上使用 Emacs 出人意料的积极体验。虽然不如桌面版流畅，但它仍然是一个可行的选择，尤其是在正确设置的情况下。\n\n作者强调了几个关键考虑因素：Android 上的 Emacs 需要通过 F-Droid 进行基本安装（仅限有限的 elisp），或者使用 Termux 进行更复杂的设置以访问其他 CLI 工具（推荐）。Termux 允许 Emacs 使用像 git 这样的工具，但涉及到更复杂的安装过程。Android 的沙盒机制会使得访问 Emacs 应用程序指定区域之外的文件变得繁琐，需要手动目录访问。\n\n配置至关重要。作者建议参考 Emacs 手册的 Android 部分，并最初使用 Customize 界面来进行更容易的基于触摸的调整。启用像 `modifier-bar-mode` 和 `tool-bar-mode` 这样的小模式可以改善用户界面。他们还建议使用像 Hacker's Keyboard 或 Unexpected Keyboard 这样的虚拟键盘，以便更容易地访问修饰键和符号。字体安装需要将文件直接放置在 `~/fonts/` 目录中。\n\n结论强调使用 Customize 界面，启用触摸屏专用选项，并安装虚拟键盘。作者对他们目前的设置表示满意，并迁移了桌面配置的相关部分。他们还提供了一个愿望清单，包括触摸屏手势和自动键盘切换，以及更大的工具栏。"
  },
  {
    "id": "46056757",
    "title": "Qiskit open-source SDK for working with quantum computers",
    "url": "https://github.com/Qiskit/qiskit",
    "summary": "Qiskit is an open-source SDK for working with quantum computers, providing tools for creating quantum circuits, operators, and primitives. It includes a transpiler for circuit optimization and a quantum information toolbox. Installation is recommended via `pip install qiskit`.\n\nThe SDK allows users to define and build quantum circuits, define classical outputs through measurements or observable operators, and utilize the Sampler and Estimator primitives to sample outcomes or estimate expectation values. The example demonstrates creating an entangled GHZ state and measuring it using the Sampler, and then estimating its expectation value using the Estimator with a custom operator.\n\nReal quantum hardware is required for scaling quantum circuits, and Qiskit includes a transpiler to adapt circuits to specific hardware. Qiskit offers an abstraction layer to run circuits on hardware from various vendors through runtime environments which implement the BaseSamplerV2 and BaseEstimatorV2 interfaces for optimized performance. It also offers a lower-level abstract interface for describing quantum backends.\n\nThe documentation provides contribution guidelines, and users are encouraged to engage in the Qiskit Slack community or use Stack Overflow or the Quantum Computing Stack Exchange for questions. Qiskit is a collaborative effort and should be cited appropriately. Changelogs and release notes detailing changes and potential breaking changes are available on GitHub. Qiskit's development is partially supported by the DOE Office of Science. It's licensed under the Apache License 2.0.\n",
    "chinese_title": "用于量子计算机的Qiskit开源SDK",
    "chinese_summary": "Qiskit 是一个用于量子计算机的开源 SDK，提供创建量子线路、算符和原语的工具。它包含一个用于线路优化的转换器和一个量子信息工具箱。建议通过 `pip install qiskit` 安装。\n\n该 SDK 允许用户定义和构建量子线路，通过测量或可观测算符定义经典输出，并利用 Sampler 和 Estimator 原语来采样结果或估计期望值。该示例演示了创建纠缠的 GHZ 态，并使用 Sampler 进行测量，然后使用 Estimator 和自定义算符估计其期望值。\n\n扩展量子线路需要真实的量子硬件，Qiskit 包含一个转换器，可以将线路适配到特定硬件。Qiskit 提供了一个抽象层，可以通过运行时环境在来自不同供应商的硬件上运行线路，这些运行时环境实现了 BaseSamplerV2 和 BaseEstimatorV2 接口以获得优化的性能。它还提供了一个用于描述量子后端的较低级别抽象接口。\n\n文档提供了贡献指南，鼓励用户参与 Qiskit Slack 社区或使用 Stack Overflow 或 Quantum Computing Stack Exchange 提问。Qiskit 是一项协作成果，应适当引用。GitHub 上提供了详细描述更改和潜在重大更改的更新日志和发行说明。Qiskit 的开发部分由美国能源部科学办公室资助。它以 Apache License 2.0 许可。"
  },
  {
    "id": "45984864",
    "title": "Copyparty, the FOSS file server [video]",
    "url": "https://www.youtube.com/watch?v=15_-hgsX2V0",
    "summary": "The content appears to be the standard YouTube footer text, not an article about Copyparty. Therefore, there's no article to summarize. The content consists of links to YouTube's terms of service, privacy policy, advertising information, creator resources, and other legal and administrative information. It also includes copyright notices and a statement about new feature testing and NFL Sunday Ticket. It contains no information about Copyparty, a file server.\n",
    "chinese_title": "Copyparty，开源文件服务器[视频]",
    "chinese_summary": "内容看起来是标准的YouTube页脚文本，而不是关于Copyparty的文章。因此，没有需要总结的文章。内容包括指向YouTube服务条款、隐私政策、广告信息、创作者资源和其他法律和管理信息的链接。它还包括版权声明以及关于新功能测试和NFL Sunday Ticket的声明。它不包含关于文件服务器Copyparty的任何信息。"
  },
  {
    "id": "46057852",
    "title": "Justice dept. requires Realpage end sharing competitively sensitive information",
    "url": "https://www.justice.gov/opa/pr/justice-department-requires-realpage-end-sharing-competitively-sensitive-information-and",
    "summary": "The Justice Department has filed a proposed settlement requiring RealPage, a provider of revenue management software for the rental housing industry, to cease anticompetitive practices. The settlement addresses concerns that RealPage's software, which uses nonpublic data shared by landlords, leads to coordinated rental pricing.\n\nThe proposed settlement mandates that RealPage stop using competitors' sensitive data to set rental prices in real-time, limit model training to aged historical data (at least 12 months old), and avoid geographic effects narrower than a state level. RealPage must also remove features that restrict price decreases or align pricing among competitors, cease collecting sensitive information through market surveys, and refrain from discussing pricing strategies in meetings.\n\nTo ensure compliance, a court-appointed monitor will oversee RealPage's actions. The company is also required to cooperate with the Justice Department's lawsuit against property management companies using its software. The settlement, subject to court approval after a public comment period, aims to restore free market competition in rental markets. The move is part of the Justice Department's ongoing effort to combat algorithmic coordination and anticompetitive information sharing in the rental housing sector.\n",
    "chinese_title": "司法部要求Realpage停止分享具有竞争敏感性的信息",
    "chinese_summary": "司法部已提交一项拟议和解协议，要求为租赁住房行业提供收入管理软件的RealPage公司停止反竞争行为。该和解协议旨在解决对RealPage软件的担忧，该软件使用房东共享的非公开数据，导致协调一致的租金定价。\n\n拟议和解协议规定，RealPage必须停止使用竞争对手的敏感数据来实时设定租金价格，限制模型训练使用过时的历史数据（至少12个月前的数据），并避免窄于州级别的地域影响。RealPage还必须删除限制价格下降或使竞争对手之间的定价保持一致的功能，停止通过市场调查收集敏感信息，并避免在会议中讨论定价策略。\n\n为确保合规，法院指定的监督员将监督RealPage的行为。该公司还必须配合司法部对使用其软件的物业管理公司提起的诉讼。该和解协议须经法院在公开征求意见期后批准，旨在恢复租赁市场的自由市场竞争。此举是司法部持续打击租赁住房领域算法协调和反竞争信息共享的一部分。"
  },
  {
    "id": "46057304",
    "title": "I DM'd a Korean presidential candidate and ended up building his core campaign",
    "url": "https://medium.com/@wjsdj2008/i-dmd-a-korean-presidential-candidate-and-ended-up-building-his-core-campaign-platform-the-38eb1c5f5e7d",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我私信了一位韩国总统候选人，结果帮他打造了核心竞选团队。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46045085",
    "title": "Trillions spent and big software projects are still failing",
    "url": "https://spectrum.ieee.org/it-management-software-failures",
    "summary": "Robert N. Charette's article highlights the persistent problem of software project failures despite a massive increase in global IT spending. While IT spending has more than tripled since 2005, software success rates have not improved significantly, leading to substantial business and societal costs. The author argues that AI is not a silver bullet to solve these issues, as the core problems often stem from human factors like unrealistic goals, poor management, and organizational politics.\n\nThe article cites examples like the Canadian government's Phoenix payroll system, the U.K. Post Office's Horizon system, the Minnesota Licensing and Registration System (MNLARS), and Australia's Modernising Business Registers Program to illustrate recurring themes of technical, managerial, ethical, and organizational failures. These failures lead to immense financial losses and damage to people's lives.\n\nThe author emphasizes that many failures are avoidable and stem from ignoring documented lessons from past projects. The IT community's tendency to believe each project is unique and disregard previous mistakes contributes to this cycle. While Agile and DevOps methods aim to improve software development, they require strong leadership, discipline, and culture change to succeed. The article concludes that the continued failure to learn from past mistakes poses an existential threat to modern society, especially as IT systems become increasingly interconnected.\n",
    "chinese_title": "万亿美元已投入，大型软件项目依然失败",
    "chinese_summary": "尽管全球IT支出大幅增加，软件项目失败的问题仍然存在。罗伯特·N·查雷特的文章强调，自2005年以来，IT支出增加了两倍多，但软件成功率并没有显著提高，导致巨大的商业和社会成本。作者认为，人工智能不是解决这些问题的灵丹妙药，因为核心问题通常源于不切实际的目标、糟糕的管理和组织政治等人类因素。\n\n文章列举了加拿大政府的凤凰工资系统、英国邮局的Horizon系统、明尼苏达州许可和注册系统(MNLARS)以及澳大利亚的现代化商业登记项目等案例，说明了技术、管理、伦理和组织失败的反复出现。这些失败导致巨大的经济损失并损害人们的生活。\n\n作者强调，许多失败是可以避免的，并且源于忽视以往项目的经验教训。IT界倾向于认为每个项目都是独一无二的，并且无视之前的错误，这加剧了这种恶性循环。虽然敏捷和DevOps方法旨在改进软件开发，但它们需要强大的领导力、纪律和文化变革才能成功。文章最后指出，持续未能从过去的错误中吸取教训对现代社会构成了生存威胁，尤其是在IT系统日益互联互通的情况下。"
  },
  {
    "id": "46030337",
    "title": "Efficient solar cooking that stores heat in sand",
    "url": "https://www.sciencedirect.com/science/article/pii/S266711312500035X",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "在沙中储热的高效太阳能烹饪",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46042810",
    "title": "Jakarta is now the biggest city in the world",
    "url": "https://www.axios.com/2025/11/24/jakarta-tokyo-worlds-biggest-city-population",
    "summary": "Jakarta has surpassed Tokyo to become the world's most populous city, according to projections from Axios and other sources. This shift is attributed to a combination of factors, including Jakarta's robust population growth and Tokyo's shrinking population.\n\nThe article likely details Jakarta's booming population growth, fueled by migration from rural areas seeking economic opportunities, and a relatively high birth rate. This rapid growth has put immense pressure on Jakarta's infrastructure, leading to challenges such as traffic congestion, pollution, and access to clean water.\n\nConversely, the article probably explains that Tokyo's population is declining due to a low birth rate and an aging population. Japan's strict immigration policies also contribute to the lack of population growth.\n\nThe article likely touches upon the implications of this shift in urban dominance. It could discuss the economic opportunities and challenges facing Jakarta as the world's largest city, as well as the impact on global urban planning and sustainability efforts. It might also mention the potential for increased international investment and economic influence in Jakarta. Finally, the article may contrast the contrasting trajectories of Jakarta and Tokyo as examples of different demographic trends shaping urban landscapes worldwide.\n",
    "chinese_title": "雅加达现在是世界上最大的城市。",
    "chinese_summary": "雅加达超越东京成为世界人口第一大城市，据 Axios 及其他来源的预测显示。这一转变归因于多种因素，包括雅加达强劲的人口增长和东京的人口萎缩。\n\n文章可能详细描述了雅加达蓬勃发展的人口增长，这得益于农村地区寻求经济机会的移民以及相对较高的出生率。这种快速增长给雅加达的基础设施带来了巨大的压力，导致了交通拥堵、污染和清洁用水获取等挑战。\n\n相反，文章可能解释说，东京的人口正在下降，原因是低出生率和人口老龄化。日本严格的移民政策也导致了人口增长的不足。\n\n文章可能涉及这种城市主导地位转变的影响。它可能会讨论雅加达作为世界最大城市所面临的经济机遇和挑战，以及对全球城市规划和可持续发展努力的影响。它也可能提及在雅加达增加国际投资和经济影响力的潜力。最后，文章可能会对比雅加达和东京的对比性发展轨迹，以此作为塑造全球城市景观的不同人口趋势的例子。"
  },
  {
    "id": "46052685",
    "title": "CS234: Reinforcement Learning Winter 2025",
    "url": "https://web.stanford.edu/class/cs234/",
    "summary": "CS234: Reinforcement Learning Winter 2025 is a course designed to provide a solid introduction to the field of reinforcement learning, covering core challenges, approaches, and techniques, including deep reinforcement learning. Students will gain proficiency through lectures, written assignments, and coding assignments in Python.\n\nKey aspects of the course include:\n\n*   **Prerequisites:** Proficiency in Python, college calculus, linear algebra, basic probability and statistics, and foundations of machine learning.\n*   **Learning Outcomes:** Students will be able to define RL, formulate application problems as RL problems, implement common RL algorithms, analyze and evaluate RL algorithms, and compare approaches for addressing the exploration vs. exploitation challenge.\n*   **Course Schedule:** Includes lectures on Tuesdays and Thursdays, assignments, a midterm, a quiz, and a course project.\n*   **Grading:** Assignments (46%), Midterm (25%), Quiz (5%), Course Project (24%), with a bonus for lecture poll participation.\n*   **Late Policy:** 5 late days total, with limits on individual assignments; penalties apply for exceeding late days.\n*   **Textbooks:** No official textbook, but \"Reinforcement Learning: An Introduction\" by Sutton and Barto is recommended.\n*   **Academic Integrity:** Collaboration on ideas is encouraged, but solutions must be written independently. Use of AI tools is permitted with proper citation and within collaboration guidelines.\n*   **Communication:** Ed discussion forums are preferred for questions.\n*   **Academic Accommodation:** Students needing accommodations should provide an Office of Accessible Education letter.",
    "chinese_title": "CS234：2025冬季强化学习",
    "chinese_summary": "CS234：2025冬季强化学习课程旨在提供强化学习领域的扎实入门，涵盖核心挑战、方法和技术，包括深度强化学习。学生将通过讲座、书面作业和Python编程作业获得熟练程度。\n\n本课程的主要方面包括：\n\n*   **先修"
  },
  {
    "id": "46048252",
    "title": "Show HN: We built an open source, zero webhooks payment processor",
    "url": "https://github.com/flowglad/flowglad",
    "summary": "Flowglad is presented as an open-source, \"zero webhooks\" payment processor designed to simplify internet monetization. It aims to alleviate the complexities associated with traditional payment systems, eliminating the need for webhooks, manual mapping of plans, and customer ID management.\n\nKey features include:\n\n*   **Stateless Billing:** Avoids complex database structures for subscriptions and customer data.\n*   **Single Source of Truth:** Provides a central point for accessing customer billing information, including feature access and usage credits.\n*   **ID-Based Access:** Enables querying customer state using existing user IDs from the application's authentication system.\n*   **Full-Stack SDK:** Offers tools for both backend (Node.js) and frontend (React) access to billing data.\n*   **Adaptable Pricing:** Allows for easy iteration and deployment of new pricing models.\n\nIntegration involves installing Flowglad packages, configuring a server instance with user ID and details, exposing an API handler, and wrapping the application with a provider. Frontend and backend examples are provided demonstrating how to check feature access and usage balances.\n\nFlowglad offers pre-built templates for common pricing models like usage-based, subscription, and feature-gated access. The project's goal is to improve the developer experience in payments by simplifying integration, reducing maintenance, and providing a single point to integrate multiple payment providers. The core principle is to minimize the complexities and time spent on billing, allowing developers to focus on their core product.\n",
    "chinese_title": "展示HN：我们构建了一个开源、零Webhook的支付处理器",
    "chinese_summary": "Flowglad：简化互联网变现的开源“零Webhook”支付处理器，旨在减轻传统支付系统的复杂性，无需Webhook、手动计划映射和客户ID管理。\n\n主要特性包括：\n\n*   **无状态账单：** 避免了订阅和客户数据的复杂数据库结构。\n*   **单一数据源：** 提供访问客户账单信息的中心点，包括功能访问和使用信用额度。\n*   **基于ID的访问：** 允许使用应用程序身份验证系统中现有的用户ID查询客户状态。\n*   **全栈SDK：** 为后端 (Node.js) 和前端 (React) 提供访问账单数据的工具。\n*   **灵活定价：** 允许轻松迭代和部署新的定价模型。\n\n集成包括安装Flowglad软件包，配置具有用户ID和详细信息的服务器实例，公开API处理程序，并用提供程序包装应用程序。 提供了前端和后端示例，演示了如何检查功能访问权限和使用余额。\n\nFlowglad为常见的定价模型（如基于使用量、订阅和功能门控访问）提供预构建的模板。 该项目的目标是通过简化集成、减少维护并提供集成多个支付提供商的单一入口点，从而改善支付方面的开发者体验。 核心原则是最大限度地减少账单的复杂性和花费的时间，使开发人员能够专注于其核心产品。"
  },
  {
    "id": "46040053",
    "title": "1,700-year-old Roman sarcophagus is unearthed in Budapest",
    "url": "https://apnews.com/article/hungary-roman-sarcophagus-discovery-budapest-77a41fe190bbcc167b43d05141536f54",
    "summary": "A remarkably well-preserved 1,700-year-old Roman sarcophagus has been unearthed in Budapest, Hungary, offering insights into the life of a young woman from the Roman era. The limestone coffin was discovered during an excavation in Óbuda, part of the ancient Roman settlement of Aquincum. Untouched for centuries, the sarcophagus was sealed with metal clamps and molten lead.\n\nInside, archaeologists found a complete skeleton surrounded by artifacts, including glass vessels, bronze figures, 140 coins, a bone hair pin, amber jewelry, and traces of gold-threaded fabric, suggesting the grave belonged to a young, well-to-do woman. Lead archaeologist Gabriella Fényes believes these items were gifts for the woman's \"eternal journey,\" indicating the deceased was carefully buried by loving relatives.\n\nThe sarcophagus was found among the ruins of abandoned houses in an area repurposed as a burial ground, near a Roman aqueduct and other simpler graves. Specialists will now examine the woman's remains to determine more about her age, health, and origins. Gergely Kostyál, a Roman-period specialist, emphasized the rarity of finding such an untouched sarcophagus, as reusing older sarcophagi was common in the 4th century. Archaeologists also plan to sift through mud inside the coffin, hoping to uncover more treasures. Fényes highlighted the emotional impact of the discovery, noting the care and love displayed by the people who buried the young woman.\n",
    "chinese_title": "布达佩斯出土1700年历史的罗马石棺",
    "chinese_summary": "在匈牙利布达佩斯出土了一具保存异常完好的1700年历史的罗马石棺，为了解罗马时代一位年轻女性的生活提供了线索。这具石灰石棺材是在奥布达的一次挖掘中发现的，奥布达是古罗马阿奎库姆定居点的一部分。石棺几个世纪以来未被触动，用金属夹和熔融铅密封。\n\n在里面，考古学家发现了一具完整的骨骼，周围环绕着文物，包括玻璃器皿、青铜雕像、140枚硬币、一根骨制发夹、琥珀珠宝以及金线织物痕迹，表明这座坟墓属于一位年轻富有的女性。首席考古学家加布里埃拉·费尼什认为，这些物品是献给这位女性“永恒旅程”的礼物，表明死者是由充满爱意的亲属精心埋葬的。\n\n石棺是在一个被改造成墓地的废弃房屋遗址中发现的，靠近罗马渡槽和其他更简单的坟墓。专家们现在将检查这位女性的遗骸，以确定更多关于她的年龄、健康和起源的信息。罗马时期专家格尔盖伊·科斯蒂亚尔强调了发现如此未受触动的石棺的罕见性，因为在4世纪，重复利用旧石棺很常见。考古学家还计划筛选棺材里的泥土，希望能发现更多的宝藏。费尼什强调了这一发现的情感冲击，并指出埋葬这位年轻女性的人们所表现出的关怀和爱。"
  },
  {
    "id": "46016902",
    "title": "How to repurpose your old phone into a web server",
    "url": "https://far.computer/how-to/",
    "summary": "This article provides a guide on repurposing an old Android phone into a basic web server using PostmarketOS. The author aims to reduce e-waste and encourage reuse of old devices.\n\nThe process involves three main steps:\n\n1.  **Installing PostmarketOS:** This entails flashing a custom OS onto the phone, replacing Android. The guide instructs users to find their specific device on the PostmarketOS website, install `pmbootstrap`, generate an image, boot the phone into flash mode, and flash the generated image.\n\n2.  **Setting up the Server:** After successful installation, the guide details how to SSH into the phone, connect it to a Wi-Fi network, and determine its local IP address. This effectively transforms the phone into a small local server accessible on the local network.\n\n3.  **Serving a Web Page:** This involves creating a directory for web files (`/var/www/html/`), writing a simple HTML file (e.g., \"hello world\"), configuring the firewall (nftables) to allow traffic on port 80, and running a simple HTTP server (`httpd`). The guide provides instructions to test the server by accessing it via `curl` and then through a web browser.\n\nThe article also provides extra advice on remote access, recommending VPN instead of directly exposing SSH (port 22) to the internet for security. Instructions on how to keep the software updated are also provided. Future advanced topics will cover setting up a domain with HTTPS and ensuring the HTTP server persists after reboots.\n",
    "chinese_title": "如何将旧手机改造成网络服务器",
    "chinese_summary": "本文介绍了如何使用PostmarketOS将旧Android手机改造为基本网页服务器的指南。作者旨在减少电子垃圾并鼓励旧设备的再利用。\n\n该过程主要包括三个步骤：\n\n1.  **安装PostmarketOS：** 这涉及到将自定义操作系统刷入手机，取代Android。该指南指导用户在PostmarketOS网站上找到其特定设备，安装`pmbootstrap`，生成镜像，将手机启动到刷机模式，并刷入生成的镜像。\n\n2.  **设置服务器：** 成功安装后，该指南详细介绍了如何SSH连接到手机，将其连接到Wi-Fi网络，并确定其本地IP地址。这有效地将手机转换为可在本地网络上访问的小型本地服务器。\n\n3.  **提供网页服务：** 这涉及到为Web文件创建目录（`/var/www/html/`），编写一个简单的HTML文件（例如，“hello world”），配置防火墙（nftables）以允许端口80上的流量，并运行一个简单的HTTP服务器（`httpd`）。该指南提供了通过`curl`以及通过Web浏览器访问来测试服务器的说明。\n\n该文章还提供了关于远程访问的额外建议，建议使用VPN而不是直接将SSH（端口22）暴露给互联网以确保安全。还提供了有关如何保持软件更新的说明。未来的高级主题将涵盖使用HTTPS设置域名并确保HTTP服务器在重启后持续运行。"
  },
  {
    "id": "46049932",
    "title": "A new bridge links the math of infinity to computer science",
    "url": "https://www.quantamagazine.org/a-new-bridge-links-the-strange-math-of-infinity-to-computer-science-20251121/",
    "summary": "This article explores a surprising connection between descriptive set theory, a niche area of mathematics dealing with the properties of infinite sets, and modern computer science, specifically distributed algorithms. Anton Bernshteyn discovered that problems about certain infinite sets can be rephrased as problems about how networks of computers communicate, creating a \"bridge\" between the two seemingly disparate fields.\n\nDescriptive set theory focuses on classifying sets based on their measurability, creating a hierarchy from easily measurable sets to \"pathological\" unmeasurable ones. Bernshteyn's work centers on infinite graphs and how to color their nodes in a measurable way, avoiding the axiom of choice, which can lead to unmeasurable sets.\n\nThe link to computer science arises through distributed algorithms, where multiple computers in a network work together to solve a problem without a central coordinator. One such problem is assigning different communication channels to Wi-Fi routers to avoid interference, which can be framed as a graph coloring problem.\n\nBernshteyn realized that thresholds in distributed algorithms, such as the number of communication channels needed for efficient coloring, resembled thresholds in descriptive set theory for coloring infinite graphs in a measurable way. His research showed that every efficient local algorithm can be translated into a Lebesgue-measurable way of coloring an infinite graph. This equivalence allows researchers to translate problems and solutions between the two fields, potentially leading to new theorems and a reorganization of the landscape of descriptive set theory.\n",
    "chinese_title": "一座新桥梁连接了无穷的数学与计算机科学。",
    "chinese_summary": "描述集合论与分布式算法：一个令人惊讶的关联"
  },
  {
    "id": "46046916",
    "title": "FLUX.2: Frontier Visual Intelligence",
    "url": "https://bfl.ai/blog/flux-2",
    "summary": "FLUX.2, the latest visual intelligence model from Black Forest Labs, aims to revolutionize creative workflows with its high-quality image generation and editing capabilities. Unlike many AI image tools focused on demos, FLUX.2 prioritizes real-world applications, enabling consistent character/style across multiple reference images, accurate prompt following, complex text handling, brand guideline adherence, and reliable management of lighting, layouts, and logos. It can edit images up to 4 megapixels while maintaining detail and coherence.\n\nBlack Forest Labs champions an open core approach, releasing inspectable open-weight models like FLUX.2 [dev] alongside robust, production-ready APIs. FLUX.2 builds upon the foundation of FLUX.1 and expands its abilities with precision, efficiency, control, and extreme realism.\n\nKey features include multi-reference support (up to 10 images), enhanced image detail and photorealism, reliable text rendering, improved prompt adherence, grounded world knowledge, and higher resolution editing.\n\nThe FLUX.2 family offers various model products catering to different needs: FLUX.2 [pro] (state-of-the-art quality), FLUX.2 [flex] (control over model parameters), FLUX.2 [dev] (open-weight model for local use), and FLUX.2 [klein] (coming soon, open-source and size-distilled). A new VAE, FLUX.2 - VAE, is also available under an Apache 2.0 license.\n\nFLUX.2 leverages a latent flow matching architecture, combining the Mistral-3 VLM with a rectified flow transformer. The model delivers state-of-the-art image generation quality and editing capabilities. Black Forest Labs envisions FLUX.2 as a step towards multimodal models that unify perception, generation, memory, and reasoning, in an open and transparent way.\n",
    "chinese_title": "FLUX.2: 前沿视觉智能",
    "chinese_summary": "FLUX.2：黑森林实验室最新视觉智能模型，旨在通过其高质量的图像生成和编辑能力，彻底变革创意工作流程。与许多专注于演示的AI图像工具不同，FLUX.2优先考虑实际应用，能够在多个参考图像中保持一致的角色/风格，精确遵循提示，处理复杂文本，遵守品牌指南，并可靠地管理光照、布局和标志。它可以在保持细节和连贯性的同时编辑高达4百万像素的图像。\n\n黑森林实验室提倡开放核心方法，发布可检查的开放权重模型（如FLUX.2 [dev]）以及强大的、可用于生产的API。FLUX.2建立在FLUX.1的基础上，并以精度、效率、控制和极高的真实感扩展其能力。\n\n主要功能包括多参考支持（最多10张图像）、增强的图像细节和照片写实感、可靠的文本渲染、改进的提示遵循、扎实的世界知识以及更高分辨率的编辑。\n\nFLUX.2系列提供各种模型产品，以满足不同的需求：FLUX.2 [pro]（最先进的质量）、FLUX.2 [flex]（控制模型参数）、FLUX.2 [dev]（用于本地使用的开放权重模型）和FLUX.2 [klein]（即将推出，开源且尺寸精简）。一个新的VAE，FLUX.2 - VAE，也以Apache 2.0许可证提供。\n\nFLUX.2利用潜在流匹配架构，将Mistral-3 VLM与校正流Transformer相结合。该模型提供最先进的图像生成质量和编辑功能。黑森林实验室设想FLUX.2是朝着统一感知、生成、记忆和推理的多模态模型迈出的一步，并且以开放和透明的方式实现。"
  },
  {
    "id": "46016579",
    "title": "Java Decompiler",
    "url": "http://java-decompiler.github.io",
    "summary": "The Java Decompiler (JD Project) offers tools for decompiling and analyzing Java bytecode. Its core component, JD-Core, reconstructs Java source code from .class files, aiding in source code recovery and exploration of Java runtime libraries. It supports features from Java 5 onwards like annotations and generics.\n\nJD provides three main components:\n\n*   **JD-GUI:** A standalone graphical utility for browsing reconstructed Java source code from .class files. It supports drag-and-drop functionality and handles various file types including CLASS, JAR, WAR, and ZIP.\n*   **JD-Eclipse:** An Eclipse plug-in that displays Java sources during debugging, even if the sources are unavailable.\n*   **JD-Core:** The underlying library that powers both JD-GUI and JD-Eclipse.\n\nJD-Core is compatible with a wide range of Java compilers. JD-GUI offers features such as color-coded source code display, file hierarchy browsing, and stack trace analysis. JD-Eclipse is easily installed within Eclipse through a simple drag-and-drop installation process.\n\nAll three components (JD-Core, JD-GUI, and JD-Eclipse) are open-source, licensed under GPLv3. The project welcomes donations to support its development. Links to releases and issue trackers for both JD-GUI and JD-Eclipse are provided.\n",
    "chinese_title": "Java反编译器",
    "chinese_summary": "Java反编译器 (JD 项目) 提供反编译和分析Java字节码的工具。 其核心组件 JD-Core 从 .class 文件重建 Java 源代码，帮助恢复源代码和探索 Java 运行时库。 它支持 Java 5 以后的功能，例如注解和泛型。\n\nJD 提供三个主要组件：\n\n*   **JD-GUI：** 一个独立的图形实用程序，用于浏览从 .class 文件重建的 Java 源代码。它支持拖放功能，并处理各种文件类型，包括 CLASS、JAR、WAR 和 ZIP。\n*   **JD-Eclipse：** 一个 Eclipse 插件，即使源代码不可用，也能在调试期间显示 Java 源代码。\n*   **JD-Core：** 驱动 JD-GUI 和 JD-Eclipse 的底层库。\n\nJD-Core 与各种 Java 编译器兼容。 JD-GUI 提供颜色编码的源代码显示、文件层次结构浏览和堆栈跟踪分析等功能。 JD-Eclipse 可以通过简单的拖放安装过程轻松地在 Eclipse 中安装。\n\n所有三个组件（JD-Core、JD-GUI 和 JD-Eclipse）都是开源的，并根据 GPLv3 获得许可。 该项目欢迎捐款以支持其发展。 提供了 JD-GUI 和 JD-Eclipse 的发行版链接和问题跟踪器。"
  },
  {
    "id": "46047580",
    "title": "Python is not a great language for data science",
    "url": "https://blog.genesmindsmachines.com/p/python-is-not-a-great-language-for",
    "summary": "In this article, Claus Wilke argues that Python is not a \"great\" language for data science, despite its widespread use. He clarifies that he's not discussing deep learning, where Python excels (particularly with PyTorch), but rather data wrangling, exploratory analysis, visualization, and statistical modeling.\n\nWilke's argument stems from his experience observing students and colleagues using Python for data analysis. He notes that seemingly simple data manipulation and visualization tasks often require significant effort and complex code compared to what he believes could be achieved more easily in R.\n\nHe attributes Python's popularity in data science to historical accident and its \"sort-of Ok\" performance across various tasks. He posits that a suitable language for data science needs to be interpreted, usable interactively, and have low startup cost. While Python fits this description, alongside R, Matlab, and Mathematica, he focuses his comparison on Python and R.\n\nWilke advocates for separating the logic of analysis from the \"logistics\" of data manipulation, preferring languages and libraries that allow for high-level conceptual expression. He provides an example using the Palmer Penguins dataset, showcasing a comparative code snippet of R and Python to achieve the same task: calculating the mean and standard deviation of penguin weight for every combination of penguin species and island. While the example is simple enough that both languages are comparable, Wilke suggests that as the complexity of a task increases, Python often devolves into complex logistics, hindering efficient data analysis.\n\nHe promises future installments will delve into specific issues that make data analysis more complicated in Python than in R.\n",
    "chinese_title": "Python 并非数据科学的理想语言。",
    "chinese_summary": "尽管 Python 的应用非常广泛，但克劳斯·威尔克在本文中认为，Python 并非数据科学的“理想”语言。他澄清说，他讨论的不是 Python 表现出色的深度学习（尤其是在 PyTorch 方面），而是数据整理、探索性分析、可视化和统计建模。\n\n威尔克的论点源于他对学生和同事使用 Python 进行数据分析的观察。他指出，与他认为在 R 中可以更容易实现的结果相比，看似简单的数据操作和可视化任务通常需要大量的努力和复杂的代码。\n\n他将 Python 在数据科学领域的普及归因于历史偶然性和其在各种任务中“勉强过关”的表现。他认为，适合数据科学的语言需要是解释型的、可以交互使用，并且具有较低的启动成本。虽然 Python 符合这一描述，与 R、Matlab 和 Mathematica 一样，但他将比较重点放在 Python 和 R 上。\n\n威尔克提倡将分析逻辑与数据操作的“后勤”分离，更喜欢允许高级概念表达的语言和库。他以 Palmer Penguins 数据集为例，展示了 R 和 Python 的比较代码片段，以实现相同的任务：计算企鹅物种和岛屿每种组合的企鹅体重的平均值和标准差。虽然这个例子很简单，两种语言具有可比性，但威尔克认为，随着任务复杂性的增加，Python 往往会演变成复杂的后勤工作，从而阻碍有效的数据分析。\n\n他承诺未来的文章将深入探讨使 Python 中的数据分析比 R 更复杂的一些具体问题。"
  },
  {
    "id": "46053566",
    "title": "Space Truckin' – The Nostromo (2012)",
    "url": "https://alienseries.wordpress.com/2012/10/23/space-truckin-the-nostromo/",
    "summary": "This article details the design process of the Nostromo spaceship from the movie Alien (1979). It highlights the influences of films like 2001: A Space Odyssey and Dark Star, emphasizing the desire to create a \"used universe\" aesthetic, contrasting with the more fantastical elements of Star Wars. Dan O'Bannon, the writer of Alien, emphasized the importance of making the spaceship appear convincingly industrial and run-down.\n\nThe design involved multiple artists, including Ron Cobb, Chris Foss, and later, H.R. Giger and Moebius. Initially, the ship was called \"Snark\" and \"Leviathan\" before settling on \"Nostromo.\" Cobb and Foss produced numerous designs, but the production faced indecision and delays. Director Ridley Scott eventually took control, aiming for a realistic, slow-moving, massive steel structure.\n\nThe final design emerged from a combination of sources. Frustrated by the lack of progress, special effects supervisor Brian Johnson grabbed a collection of designs by both Cobb and Foss, and used them as the basis for the model. While Foss felt his work was disregarded, Cobb's designs for both the exterior and interior were eventually accepted by Scott. The article shows the chaotic and collaborative process involved in creating one of cinema's most iconic spaceships.\n",
    "chinese_title": "太空货运 – 诺斯特罗莫号 (2012)",
    "chinese_summary": "本文详细介绍了电影《异形》（1979）中诺史莫号飞船的设计过程。它突出了《2001太空漫游》和《黑暗之星》等电影的影响，强调了创造“用过的宇宙”美学的愿望，与《星球大战》中更具幻想色彩的元素形成对比。《异形》的编剧丹·欧班农强调了让飞船看起来具有令人信服的工业感和破旧感的重要性。\n\n设计过程涉及多位艺术家，包括罗恩·科布、克里斯·福斯，以及后来的H.R.吉格和墨比斯。最初，该飞船被称为“Snark”和“Leviathan”，最终确定为“Nostromo”。科布和福斯创作了大量设计，但制作过程面临犹豫不决和延误。导演雷德利·斯科特最终掌控了局面，旨在打造一个逼真的、缓慢移动的、巨大的钢铁结构。\n\n最终的设计来源于多种来源。特效总监布莱恩·约翰逊对缺乏进展感到沮丧，他抓取了科布和福斯的设计合集，并以此为模型的基础。虽然福斯觉得他的作品被忽视了，但科布的外部和内部设计最终被斯科特接受。本文展示了创造电影史上最具标志性的飞船之一所涉及的混乱和协作过程。"
  },
  {
    "id": "46006211",
    "title": "Largest-Triangle-Three-Buckets and the Fourier Transform (2024)",
    "url": "https://daniel.mitterdorfer.name/posts/2024-01-30-downsampling-lttb-and-fft/",
    "summary": "This blog post explores the Largest-Triangle-Three-Buckets (LTTB) algorithm for downsampling time-series data, focusing on its impact on both time and frequency domains. LTTB reduces data points while preserving visual properties by selecting significant points within buckets.\n\nThe author demonstrates LTTB on a dataset and then applies it to a simple sine wave, observing that aggressive downsampling introduces distortion artifacts in the frequency domain, as revealed by the Fourier transform. Downsampling can alter the apparent base frequency of the signal.\n\nThe post then highlights the importance of the Nyquist-Shannon sampling theorem, stating that a signal must be sampled at least twice its highest frequency to avoid information loss. The author illustrates this by showing how downsampling a 16 Hz sine wave below 32 Hz leads to complete distortion.\n\nFinally, the principles are applied to the original, more complex dataset. The Fourier transform of the original signal is analyzed to identify its frequency components, and LTTB is used to downsample it to 32 and 8 samples. The author concludes that while downsampling saves resources and improves latency, understanding the signal's frequency content and applying the Nyquist theorem is crucial for minimizing distortion and preserving the signal's overall shape during the downsampling process. In essence, LTTB is effective, but careful consideration of the signal's characteristics is necessary for optimal results.\n",
    "chinese_title": "最大三角形-三桶与傅里叶变换 (2024)",
    "chinese_summary": "这篇博文探讨了用于对时间序列数据进行降采样的最大三角形三桶 (LTTB) 算法，重点关注其对时域和频域的影响。LTTB 通过选择桶内的重要点来减少数据点，同时保留视觉特性。\n\n作者在一个数据集上演示了 LTTB，然后将其应用于一个简单的正弦波，观察到激进的降采样会在频域中引入失真伪影，这可以通过傅里叶变换揭示。降采样会改变信号的明显基频。\n\n然后，该文章强调了奈奎斯特-香农采样定理的重要性，指出信号必须以至少其最高频率的两倍进行采样，以避免信息丢失。作者通过展示如何将 16 Hz 正弦波降采样到低于 32 Hz 导致完全失真来说明了这一点。\n\n最后，这些原理被应用于原始的、更复杂的数据集。分析原始信号的傅里叶变换以识别其频率分量，并使用 LTTB 将其降采样到 32 个和 8 个样本。作者得出结论，虽然降采样可以节省资源并提高延迟，但了解信号的频率内容并应用奈奎斯特定理对于最小化失真并在降采样过程中保留信号的整体形状至关重要。本质上，LTTB 是有效的，但仔细考虑信号的特性对于获得最佳结果是必要的。"
  },
  {
    "id": "46047053",
    "title": "New layouts with CSS Subgrid",
    "url": "https://www.joshwcomeau.com/css/subgrid/",
    "summary": "This article explores CSS Subgrid, a feature that allows extending grid layouts through the DOM tree, enabling more flexible and semantically correct UI designs.\n\nThe article starts with a basic example of using Subgrid to group images within a list while still fitting them into a parent grid layout. It then contrasts this with a traditional Flexbox/Grid combination approach, acknowledging that Subgrid isn't always the simplest solution.\n\nThe core of the article focuses on a more compelling use case: aligning content across grid items when the content within those items varies. Using an artist portfolio as an example, the author demonstrates how Subgrid solves the problem of inconsistent image widths when cards with different content lengths are placed in a grid. Without Subgrid, the `fr` unit calculates column widths independently for each card, leading to misalignment. By making the nested grid inherit the parent grid's column definitions using `grid-template-columns: subgrid`, the article shows how to achieve consistent column widths across all cards, irrespective of their individual content. This creates a visually appealing and organized layout. The article highlights Subgrid's ability to enable siblings to be aware of each other within complex layouts, offering a solution to a common CSS challenge.\n",
    "chinese_title": "使用 CSS Subgrid 的新布局",
    "chinese_summary": "本文探讨了 CSS 子网格（Subgrid），它是一种允许通过 DOM 树扩展网格布局的功能，从而实现更灵活且语义上正确的 UI 设计。\n\n本文首先通过一个基本示例来演示如何使用子网格在列表中对图像进行分组，同时仍将其融入父网格布局中。然后，文章将此方法与传统的 Flexbox/Grid 组合方法进行对比，并承认子网格并非总是最简单的解决方案。\n\n文章的核心集中在一个更引人注目的用例上：当网格项目中的内容各不相同时，如何在这些项目之间对齐内容。以艺术家作品集为例，作者演示了当具有不同内容长度的卡片放置在网格中时，子网格如何解决图像宽度不一致的问题。如果没有子网格，`fr` 单位会独立计算每个卡片的列宽，从而导致未对齐。通过使用 `grid-template-columns: subgrid` 使嵌套网格继承父网格的列定义，文章展示了如何实现所有卡片的列宽一致，而不管其各自的内容如何。这创建了一个具有视觉吸引力和组织良好的布局。文章强调了子网格在复杂布局中使兄弟元素能够彼此感知的能力，为常见的 CSS 挑战提供了一个解决方案。"
  },
  {
    "id": "46053262",
    "title": "BebboSSH: SSH2 implementation for Amiga systems (68000, GPLv3)",
    "url": "https://franke.ms/git/bebbo/bebbossh",
    "summary": "BebboSSH is an SSH2 suite for Amiga systems (68000+) offering secure remote access, file transfer, and key generation. It includes a client (bebbossh), server daemon (bebbosshd), SCP utility (bebboscp), and key generator (bebbosshkeygen), along with the libcryptossh.library, optimized for different 68k CPUs. It supports modern ciphers like curve25519-sha256, aes128-gcm, and chacha20-poly1305.\n\nPerformance varies significantly based on Amiga hardware, with connection establishment taking longer on unaccelerated systems. The text includes performance tables for SCP transfer speeds with different ciphers on various Amiga configurations. BebboSSH's tools offer configuration options such as key authentication, port forwarding, and cipher selection. The server requires configuration for SSH access.\n\nThe software is licensed under GPLv3+ (with some components under Public Domain), and the author provides a disclaimer of warranty and limitation of liability. The document lists recent improvements, including name change from AmigaSSH, optimized crypto, and ChaCha20/Poly1305 support. It also offers troubleshooting tips and configuration advice for common issues, such as terminal emulation, key authentication, and SCP transfers. Finally, it offers guidance for the xterm-amiga terminfo setup.\n",
    "chinese_title": "BebboSSH：Amiga系统SSH2实现 (68000, GPLv3)",
    "chinese_summary": "BebboSSH是一个适用于Amiga系统 (68000+) 的SSH2套件，提供安全的远程访问、文件传输和密钥生成。它包含客户端 (bebbossh)、服务器守护进程 (bebbosshd)、SCP实用程序 (bebboscp) 和密钥生成器 (bebbosshkeygen)，以及libcryptossh.library，针对不同的68k CPU进行了优化。它支持现代密码算法，如curve25519-sha256、aes128-gcm和chacha20-poly1305。\n\n性能因Amiga硬件而异，在未加速的系统上，连接建立需要更长时间。文档包含SCP传输速度的性能表，其中列出了不同密码算法在各种Amiga配置下的表现。BebboSSH的工具提供配置选项，如密钥身份验证、端口转发和密码选择。服务器需要配置才能进行SSH访问。\n\n该软件在GPLv3+许可下发布（部分组件在公共领域下），作者声明不提供担保和责任限制。文档列出了最近的改进，包括从AmigaSSH更名、优化后的加密以及ChaCha20/Poly1305支持。它还提供了针对常见问题的故障排除技巧和配置建议，例如终端仿真、密钥身份验证和SCP传输。最后，它提供了xterm-amiga terminfo设置的指南。"
  },
  {
    "id": "46048996",
    "title": "Google Antigravity exfiltrates data via indirect prompt injection attack",
    "url": "https://www.promptarmor.com/resources/google-antigravity-exfiltrates-data",
    "summary": "This article details a significant security vulnerability in Google's new agentic code editor, Antigravity, demonstrating how an indirect prompt injection attack can exfiltrate sensitive data. The attack leverages a poisoned web source (e.g., an integration guide) to manipulate Antigravity's AI agent, Gemini, into stealing credentials and code snippets from a user's IDE.\n\nHere's the attack breakdown: A user seeking to integrate a feature unknowingly references a malicious online resource. A hidden prompt injection within that resource coerces Gemini to collect sensitive information like credentials from .env files (bypassing Gitignore protections by using the `cat` command). It then crafts a malicious URL containing this data and instructs a browser subagent to visit that URL. Since the default Antigravity Allowlist includes 'webhook.site', the subagent successfully exfiltrates the data to an attacker-controlled endpoint.\n\nThe article highlights how Antigravity's default settings, particularly those related to Agent Review Policy and Terminal Command Auto Execution Policy, contribute to the vulnerability. The Agent Manager, designed for running multiple agents simultaneously in the background, further exacerbates the risk, as users are less likely to actively monitor each agent's actions.\n\nThe authors acknowledge Google's awareness of these data exfiltration risks, pointing out that Google relies on disclaimers rather than robust mitigation. The researchers argue that users are unlikely to scrutinize every agent action, making this vulnerability a serious concern. They chose not to pursue responsible disclosure as Google had already acknowledged the issue.\n",
    "chinese_title": "Google反重力通过间接提示注入攻击窃取数据",
    "chinese_summary": "Google新一代自主编码编辑器Antigravity中一项重大安全漏洞：如何通过间接提示注入攻击窃取敏感数据。攻击利用恶意网络资源（例如，集成指南）操纵Antigravity的AI代理Gemini，从而从用户的IDE中窃取凭据和代码片段。\n\n攻击分解：用户在试图集成某项功能时，不知情地引用了恶意在线资源。该资源中隐藏的提示注入强制Gemini收集敏感信息，如来自.env文件的凭据（通过使用`cat`命令绕过Gitignore保护）。然后，它构造一个包含此数据的恶意URL，并指示浏览器子代理访问该URL。由于默认的Antigravity白名单包含'webhook.site'，因此子代理成功地将数据泄露到攻击者控制的端点。\n\n本文重点介绍了Antigravity的默认设置，特别是与代理审查策略和终端命令自动执行策略相关的设置，如何导致该漏洞。代理管理器旨在在后台同时运行多个代理，这进一步加剧了风险，因为用户不太可能主动监控每个代理的操作。\n\n作者承认Google已经意识到这些数据泄露风险，并指出Google依赖免责声明而不是强大的缓解措施。研究人员认为，用户不太可能仔细审查每个代理的操作，这使得该漏洞成为一个严重的担忧。他们选择不进行负责任的披露，因为Google已经承认了这个问题。"
  },
  {
    "id": "46048125",
    "title": "Ilya Sutskever: We're moving from the age of scaling to the age of research",
    "url": "https://www.dwarkesh.com/p/ilya-sutskever-2",
    "summary": "In a conversation between Ilya Sutskever and Dwarkesh Patel, they discuss the current state of AI and its future trajectory, emphasizing a shift from simply scaling models to focusing on deeper research. Sutskever notes the confusing disconnect between AI's impressive performance on evaluations and its lagging economic impact, attributing this to potential issues with RL training and inadequate generalization. He suggests that the focus on achieving high scores on evaluations might be inadvertently limiting the models' broader capabilities.\n\nSutskever uses an analogy of competitive programming to illustrate this point, where intense specialization in a specific domain doesn't necessarily translate to broader expertise. He also explores the role of pre-training, acknowledging its strengths in providing vast amounts of data but highlighting the difficulty in understanding how models rely on it.\n\nThe discussion further delves into the concept of emotions and their potential link to value functions in AI, drawing parallels to the impact of emotional processing on human decision-making. Sutskever argues that while emotions might be related to value functions, current ML models lack a prominent role for value functions. He concludes by stating that SSI is an age of research company.\n",
    "chinese_title": "Ilya Sutskever：我们正从扩展时代迈向研究时代",
    "chinese_summary": "伊利亚·苏茨凯弗与德瓦尔凯什·帕特尔的对话中，他们探讨了人工智能的现状与未来发展轨迹，强调了从单纯的模型扩展转向更深入的研究。苏茨凯弗指出，人工智能在评估方面的出色表现与其滞后的经济影响之间存在令人困惑的脱节，并将此归因于强化学习训练的潜在问题以及泛化能力不足。他认为，专注于在评估中获得高分的做法可能无意中限制了模型的更广泛能力。\n\n苏茨凯弗用编程竞赛类比来说明这一点，在这种情况下，在特定领域的集中专业化并不一定转化为更广泛的专业知识。他还探讨了预训练的作用，承认其在提供大量数据方面的优势，但强调了理解模型如何依赖预训练的难度。\n\n讨论进一步深入到情感的概念及其与人工智能中的价值函数之间的潜在联系，并将情感处理对人类决策的影响进行了类比。苏茨凯弗认为，虽然情感可能与价值函数相关，但当前的机器学习模型缺乏价值函数的重要作用。他最后表示，SSI是一家处于研究时代的公司。"
  },
  {
    "id": "46059069",
    "title": "Slop Detective – Fight the Slop Syndicate",
    "url": "https://slopdetective.kagi.com/",
    "summary": "This snippet describes a webpage titled \"Slop Detective – Fight the Slop Syndicate.\" The primary content of the page is a prompt for the user to enable JavaScript in order to play a game called \"Slop Detective.\" The webpage's purpose is to host and allow users to interact with the game.\n",
    "chinese_title": "泔水侦探 – 对抗泔水辛迪加",
    "chinese_summary": "这段文字描述了一个名为“污垢侦探 – 对抗污垢集团”的网页。该网页的主要内容是提示用户启用 JavaScript 以便玩名为“污垢侦探”的游戏。该网页的目的是托管并允许用户与游戏互动。"
  },
  {
    "id": "46045385",
    "title": "Constant-time support coming to LLVM: Protecting cryptographic code",
    "url": "https://blog.trailofbits.com/2025/11/25/constant-time-support-coming-to-llvm-protecting-cryptographic-code-at-the-compiler-level/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "LLVM即将支持常量时间：保护加密代码",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46017797",
    "title": "After 15 years, I use Outlook as my build pipeline",
    "url": "https://iwriteaboutcode.blogspot.com/2025/11/after-15-years-i-have-finally-reached.html",
    "summary": "The author, a seasoned developer with 15 years of experience, humorously confesses to using Microsoft Outlook as part of their build pipeline due to bureaucratic hurdles and slow access provisioning for a coworker. Faced with the inefficiency of manually sharing test files, they implemented a Python script that monitors their Outlook inbox for specific emails, parses attached files, and then automatically publishes them to a server endpoint.\n\nWhile acknowledging the absurdity and potential \"hackiness\" of the solution, the author argues that it significantly improved the iteration speed for testing and reduced the time wasted by both developers. They highlight the importance of quick iteration cycles, emphasizing how reduced focus time and manual deployments can lead to errors and lost productivity.\n\nThe author rationalizes the unconventional approach by pointing out that the solution is functionally equivalent to the coworker directly calling the endpoint, albeit with extra steps. They implemented a simple security measure (a secret codeword) and playfully suggest that the solution boasts high availability due to their consistent work hours.\n\nThe author concludes by admitting the solution isn't ideal but emphasizes that it was a practical response to frustrating organizational bottlenecks. They jokingly suggest that they might even add this experience to their resume, valuing the problem-solving creativity it demonstrates. Ultimately, the article is a humorous commentary on the realities of software development, where pragmatic solutions sometimes outweigh theoretical best practices.\n",
    "chinese_title": "15年后，我用Outlook作为我的构建管道。",
    "chinese_summary": "一位拥有15年经验的资深开发者幽默地坦白，由于官僚障碍和同事缓慢的访问权限配置，他将Microsoft Outlook用作构建管道的一部分。面对手动共享测试文件效率低下的问题，他实现了一个Python脚本，该脚本监控他的Outlook收件箱中的特定电子邮件，解析附件，然后自动将其发布到服务器端点。\n\n作者承认这种解决方案的荒谬性和潜在的“hack性”，但认为它显着提高了测试的迭代速度，并减少了开发人员浪费的时间。他们强调了快速迭代周期的重要性，强调了减少的专注时间和手动部署如何导致错误和生产力下降。\n\n作者通过指出该解决方案在功能上等同于同事直接调用端点（尽管有额外的步骤）来合理化这种非常规方法。他们实施了一个简单的安全措施（一个秘密口令），并开玩笑地表示，由于他们持续的工作时间，该解决方案具有很高的可用性。\n\n作者最后承认该解决方案并不理想，但强调它是对令人沮丧的组织瓶颈的实际回应。他们开玩笑地建议他们甚至可能会将这种经历添加到他们的简历中，重视它所展示的解决问题的创造力。归根结底，这篇文章是对软件开发现实的幽默评论，在这种现实中，务实的解决方案有时胜过理论上的最佳实践。"
  },
  {
    "id": "46051340",
    "title": "Someone at YouTube Needs Glasses: The Prophecy Has Been Fulfilled",
    "url": "https://jayd.ml/2025/11/10/someone-at-youtube-needs-glasses-prophecy-fulfilled.html",
    "summary": "The author humorously laments YouTube's increasingly sparse homepage design. He initially predicted, based on statistical analysis, that YouTube's homepage would feature only one video by May 2026 due to its diminishing information density. This prediction was prompted by criticism that reached Hacker News and supposedly triggered action by YouTube's PM team.\n\nHowever, after a recent update, the author found his YouTube homepage on Apple TV displaying even fewer videos than anticipated. He claims the changes were implemented by Gemini YouTube engineers and that the new design has fewer videos on the screen.\n\nBased on this new data, he sarcastically adjusts his prediction, now estimating the complete absence of videos on the homepage by May 2026, accelerated from his original September prediction. The author suggests that YouTube's product managers (PMs) are either deliberately misinterpreting or unintentionally fulfilling satirical criticism, and speculates that this trend might lead to the early adoption of Neuralink brain-computer interfaces. In essence, he critiques YouTube's design choices as nonsensical and leading to an increasingly empty and useless homepage.\n",
    "chinese_title": "YouTube有人需要配眼镜了：预言已应验",
    "chinese_summary": "作者幽默地哀叹 YouTube 主页设计越来越稀疏。他最初基于统计分析预测，由于信息密度降低，YouTube 主页到 2026 年 5 月将只显示一个视频。这一预测源于 Hacker News 上的批评，据称这触发了 YouTube 产品经理团队的行动。\n\n然而，在最近一次更新后，作者发现他在 Apple TV 上的 YouTube 主页显示的视频甚至比预期的还要少。他声称这些变化是由 Gemini YouTube 工程师实施的，并且新设计在屏幕上显示的视频更少。\n\n基于这一新数据，他讽刺性地调整了他的预测，现在估计到 2026 年 5 月主页将完全没有视频，比他最初的 9 月预测提前了。作者认为 YouTube 的产品经理要么是故意曲解要么是无意中实现了讽刺性批评，并推测这种趋势可能会导致 Neuralink 脑机接口的提前采用。本质上，他批评 YouTube 的设计选择毫无意义，并导致主页越来越空洞和无用。"
  },
  {
    "id": "46028548",
    "title": "The fall of Labubus and the mush of modern internet trends",
    "url": "https://www.michigandaily.com/arts/digital-culture/the-fall-of-labubus-and-the-mush-of-modern-internet-trends/",
    "summary": "Caiden O'Donnell's article explores the rapid rise and fall of the Labubu toy trend, using it as a lens to examine the broader landscape of modern internet trends. Labubus, originating from a picture book, exploded in popularity in 2024 and 2025 before quickly fading, mirroring the ephemeral nature of many recent internet phenomena.\n\nO'Donnell argues that the increased connectivity and short-form content consumption fostered by the internet lead to trends gaining prevalence faster but also disappearing more quickly. This creates a \"mush\" of various digital phenomena rather than sustained, unified cultural moments.\n\nWhile this chaotic landscape might seem undesirable, O'Donnell posits that it reflects a decentralized internet where users are guided into niche communities, and smaller communities create the trends that merge to become big trends. This, ironically, leads to a more unified and multicultural internet.  Instead of everyone jumping on the same bandwagon for fear of missing out, individuals are free to enjoy their own interests while being exposed to trends from different online corners.\n\nThe article concludes that this exchange of culture and information, facilitated by the internet, is a positive development. Labubus themselves serve as an example of how cultural barriers can be breached through internet interaction, leading to global trends. O'Donnell embraces the messiness of the modern internet, suggesting it offers a more vibrant and inclusive cultural experience.\n",
    "chinese_title": "拉布布斯陨落与现代互联网潮流的泥淖",
    "chinese_summary": "凯登·奥唐奈的文章探讨了拉布布玩具潮流的迅速兴起和衰落，并以此为视角来审视现代互联网潮流的更广阔图景。拉布布起源于一本图画书，在2024年和2025年人气爆发后迅速消退，反映了许多近期互联网现象的短暂性。\n\n奥唐奈认为，互联网所促进的增强连接和短视频内容消费导致潮流更快地流行，但也消失得更快。 这创造了一个各种数字现象的“大杂烩”，而不是持续、统一的文化时刻。\n\n虽然这种混乱的景象可能看起来不受欢迎，但奥唐奈认为，它反映了一个去中心化的互联网，用户被引导到利基社区，较小的社区创造了融合为大型潮流的趋势。 具有讽刺意味的是，这导致了一个更加统一和多元文化的互联网。 人们不再因为害怕错过而一窝蜂地追逐同一个潮流，而是可以自由地享受自己的兴趣，同时接触来自不同网络角落的趋势。\n\n文章总结说，这种由互联网促进的文化和信息交流是一种积极的发展。 拉布布本身就是一个例子，说明文化壁垒如何通过互联网互动被打破，从而导致全球趋势。 奥唐奈拥抱现代互联网的混乱性，认为它提供了更加充满活力和包容性的文化体验。"
  },
  {
    "id": "46057628",
    "title": "There may not be a safe off-ramp for some taking GLP-1 drugs, study suggests",
    "url": "https://arstechnica.com/health/2025/11/glp-1-drugs-improve-heart-health-but-only-if-you-keep-taking-them/",
    "summary": "This article discusses a recent study published in JAMA Internal Medicine that raises concerns about the sustainability of weight loss achieved with GLP-1 drugs like tirzepatide (Zepbound). The study found that most participants who stopped taking tirzepatide after 36 weeks regained a significant portion of the weight they had lost, and their cardiovascular and metabolic health markers (blood pressure, cholesterol, blood sugar) worsened.\n\nMedical experts suggest reframing these drugs as \"weight management\" rather than \"weight loss\" medications, implying long-term use may be necessary. The study followed 670 participants, with a focus on the 308 who lost at least 10% of their body weight on the drug. A significant majority of this group regained at least 25% of their lost weight after switching to a placebo.\n\nWhile a small percentage (around 17.5%) did not regain a significant amount of weight, researchers couldn't identify specific factors explaining their success. The article highlights the lack of research on safe and effective strategies for weaning off GLP-1 drugs, such as gradual dosage reduction or lifestyle modifications. It also emphasizes the need for more data on the long-term effects of weight fluctuations caused by starting and stopping these medications, as regained weight may be disproportionately fat mass. Experts advise caution in discussing these drugs with patients, emphasizing the potential for long-term therapy.\n",
    "chinese_title": "研究表明，部分服用GLP-1药物的人可能没有安全的停药途径。",
    "chinese_summary": "本文探讨了近期发表在《美国医学会内科学》上的一项研究，该研究引发了人们对使用 GLP-1 类药物（如替尔泊肽 [Zepbound]）实现减肥效果的可持续性的担忧。该研究发现，大多数在 36 周后停止服用替尔泊肽的参与者，体重会显著反弹，并且他们的心血管和代谢健康指标（血压、胆固醇、血糖）恶化。\n\n医学专家建议将这些药物重新定义为“体重管理”而非“减肥”药物，这意味着可能需要长期使用。该研究跟踪了 670 名参与者，重点关注了在药物作用下减掉了至少 10% 体重的 308 名参与者。在切换到安慰剂后，该组中的绝大多数人体重至少反弹了 25%。\n\n虽然有很小一部分人（约 17.5%）没有显著反弹体重，但研究人员无法确定解释他们成功的具体因素。文章强调，缺乏关于安全有效停止使用 GLP-1 类药物的策略的研究，例如逐渐减少剂量或改变生活方式。它还强调需要更多关于因开始和停止使用这些药物而引起的体重波动的长期影响的数据，因为反弹的体重可能不成比例地是脂肪。专家建议在与患者讨论这些药物时要谨慎，强调长期治疗的可能性。"
  },
  {
    "id": "45996495",
    "title": "RunC Container Escape: What Docker and Kubernetes Users Need to Know",
    "url": "https://www.minimus.io/post/new-vulnerabilities-in-runc-allow-container-escape-what-docker-and-kubernetes-users-need-to-know",
    "summary": "This article, titled \"RunC Container Escape: What Docker and Kubernetes Users Need to Know,\" highlights the critical issue of container escape vulnerabilities within runC, a core component of Docker and Kubernetes. While not detailing specific exploits, the headline warns Docker and Kubernetes users about the potential for attackers to break out of containerized environments and gain access to the host system.\n\nThe article immediately promotes Minimus, a product designed to mitigate container vulnerabilities. It claims Minimus can help users avoid over 97% of container CVEs and offers access to hardened images, secure Helm charts, and a custom image builder. This suggests that the vulnerabilities in runC are significant and potentially widespread, necessitating solutions like those offered by Minimus.\n\nThe key takeaway is a call to action for Docker and Kubernetes users to be aware of runC vulnerabilities and to consider security measures, possibly through tools like Minimus, to protect their containerized environments. The focus is on the potential for container escape and the need for robust security practices to prevent breaches.\n",
    "chinese_title": "RunC容器逃逸：Docker和Kubernetes用户须知",
    "chinese_summary": "\"RunC容器逃逸：Docker和Kubernetes用户须知\" 这篇文章强调了runC（Docker和Kubernetes的核心组件）中容器逃逸漏洞的关键问题。虽然没有详细说明具体的漏洞利用方式，但标题警示Docker和Kubernetes用户，攻击者有可能突破容器化环境并获得对宿主系统的访问权限。\n\n文章立即推介了旨在缓解容器漏洞的产品Minimus。它声称Minimus可以帮助用户避免超过97%的容器CVE，并提供对加固镜像、安全Helm charts和自定义镜像构建器的访问权限。这表明runC中的漏洞非常重要且可能广泛存在，因此需要像Minimus这样的解决方案。\n\n关键要点是呼吁Docker和Kubernetes用户注意runC漏洞，并考虑安全措施（可能通过像Minimus这样的工具）来保护他们的容器化环境。重点在于容器逃逸的可能性以及需要强大的安全实践来防止漏洞。"
  },
  {
    "id": "46038417",
    "title": "PRC elites voice AI-skepticism",
    "url": "https://jamestown.org/prc-elites-voice-ai-skepticism/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "中国精英对人工智能表达怀疑",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46047958",
    "title": "Unifying our mobile and desktop domains",
    "url": "https://techblog.wikimedia.org/2025/11/21/unifying-mobile-and-desktop-domains/",
    "summary": "This article details the Wikimedia Foundation's successful unification of mobile and desktop domains for its wikis, a project that eliminated the need for mobile redirects (m-dot domains) and delivered significant performance improvements.\n\nHistorically, mobile users were redirected to a separate mobile URL. The change, completed in October, eliminated this redirect, resulting in a 20% improvement in mobile response times. This not only recovered performance lost due to Google's switch to a mobile-first crawler, which exposed more users to the redirect, but also improved speed for all users.\n\nThe unification also significantly improved SEO, particularly for Wikimedia Commons. The mobile redirect was found to hinder Google's crawling and indexing of Commons pages, leading to a substantial number of pages being delisted. Disabling the redirect for Googlebot resulted in a doubling of Google-referred pageviews and clicks. Enabling the MediaWiki sitemap generator led to Google indexing 70 million new Commons pages.\n\nFurthermore, the project enhanced link sharing UX by ensuring shared links consistently display the appropriate version of the site on different devices. The old mobile links now redirect to the standard domain, retroactively fixing the UX issue.\n\nFinally, unifying the domains reduced infrastructure load by cutting the MediaWiki purge rate by 50%, resulting in a 20-40% reduction in purges received by the Wikimedia CDN. This project demonstrates a comprehensive improvement across performance, SEO, user experience, and infrastructure efficiency.\n",
    "chinese_title": "统一我们的移动和桌面领域",
    "chinese_summary": "维基媒体基金会成功统一移动和桌面域名：显著提升性能、SEO和用户体验"
  },
  {
    "id": "46045039",
    "title": "Making Crash Bandicoot (2011)",
    "url": "https://all-things-andy-gavin.com/video-games/making-crash/",
    "summary": "This blog post, dated February 2, 2011, is the first part of a series about the creation of Crash Bandicoot, written by one of the founders of Naughty Dog, Inc. At the time of writing (2011), Naughty Dog was a well-established game studio, but in the summer of 1994, it was a small two-man operation consisting of the author and their partner, Jason Rubin.\n\nThe post highlights the transition Naughty Dog was about to undergo. After eight years of working as a tight-knit team and releasing six games, they were ready to grow beyond a two-person company. This shift marked a significant turning point for Naughty Dog and set the stage for the development of what would eventually become Crash Bandicoot. The post serves as an introduction to the development story, hinting at the impending expansion and the beginning of a new chapter for the company.\n",
    "chinese_title": "古惑狼制作秘辛 (2011)",
    "chinese_summary": "这篇发表于2011年2月2日的博文，是顽皮狗公司创始人之一撰写的关于古惑狼创作系列的第一部分。在撰写本文时（2011年），顽皮狗已是一家成熟的游戏工作室，但在1994年夏天，它还只是一个由作者和其合伙人杰森·鲁宾组成的两人小团队。\n\n这篇博文重点介绍了顽皮狗即将经历的转变。经过八年的紧密合作和发布六款游戏后，他们准备突破两人公司的规模。 这一转变标志着顽皮狗的一个重要转折点，并为最终成为《古惑狼》的开发奠定了基础。 这篇博文是对开发故事的介绍，暗示了即将到来的扩张以及公司新篇章的开始。"
  },
  {
    "id": "46057571",
    "title": "ESP32",
    "url": "https://en.wikipedia.org/wiki/ESP32",
    "summary": "The ESP32 is a family of low-cost, low-power microcontrollers with integrated Wi-Fi and Bluetooth capabilities, designed by Espressif Systems. It's a successor to the ESP8266 and is manufactured by TSMC. Key features include a variety of processors (Tensilica Xtensa LX6/LX7, RISC-V), ample memory (520 KiB SRAM), and a rich set of peripheral interfaces like GPIOs, ADCs, DACs, SPI, I2C, UART, Ethernet MAC, and CAN bus.\n\nThe ESP32 family encompasses several variants (ESP32, ESP32-S2, ESP32-S3, ESP32-C2, ESP32-C3, ESP32-C6, ESP32-H2, ESP32-C5, and ESP32-P4), each with varying CPU configurations, memory sizes, wireless connectivity options (Wi-Fi 6, Bluetooth 5), GPIO counts, and specialized features like USB OTG and machine learning acceleration.\n\nESP32 chips are typically packaged in QFN packages and integrated into modules and development boards. Several modules exist, including the ESP32-PICO series, which combine the ESP32 chip with essential components into a small package. Surface-mount modules like the ESP-WROOM and ESP-WROVER series are commonly used, offering different antenna options (PCB trace, U.FL connector), flash memory, and PSRAM configurations. The modules vary in functionality and are often used for IoT and embedded applications.\n\nNewer iterations like the ESP32-C5 and ESP32-P4 feature advanced capabilities like Wi-Fi 6, Zigbee/Thread support, and enhanced processing power for image and voice applications.\n",
    "chinese_title": "ESP32",
    "chinese_summary": "ESP32是乐鑫科技设计的一系列低成本、低功耗微控制器，集成了Wi-Fi和蓝牙功能。它是ESP8266的继任者，由台积电制造。其主要特性包括多种处理器（Tensilica Xtensa LX6/LX7、RISC-V）、充足的内存（520 KiB SRAM）以及丰富的外部接口，如GPIO、ADC、DAC、SPI、I2C、UART、以太网MAC和CAN总线。\n\nESP32系列包含多个型号（ESP32、ESP32-S2、ESP32-S3、ESP32-C2、ESP32-C3、ESP32-C6、ESP32-H2、ESP32-C5和ESP32-P4），每个型号都具有不同的CPU配置、内存大小、无线连接选项（Wi-Fi 6、蓝牙5）、GPIO数量以及特殊功能，如USB OTG和机器学习加速。\n\nESP32芯片通常采用QFN封装，并集成到模块和开发板中。存在多个模块，包括ESP32-PICO系列，它将ESP32芯片与基本组件组合成一个小封装。像ESP-WROOM和ESP-WROVER系列这样的表面贴装模块也很常用，它们提供不同的天线选项（PCB走线、U.FL连接器）、闪存和PSRAM配置。这些模块的功能各不相同，常用于物联网和嵌入式应用。\n\n更新的型号，如ESP32-C5和ESP32-P4，具有高级功能，如Wi-Fi 6、Zigbee/Thread支持以及用于图像和语音应用的增强处理能力。"
  },
  {
    "id": "46049835",
    "title": "The Bughouse Effect",
    "url": "https://tsvibt.blogspot.com/2025/11/the-bughouse-effect.html",
    "summary": "\"The Bughouse Effect\" explores the unique rage that arises from playing Bughouse chess online with strangers, and draws parallels to real-life scenarios where collaborative efforts are derailed by perceived incompetence or failure of teammates.\n\nThe author starts by explaining Crazyhouse chess, a variant where captured pieces can be re-introduced to the board. Bughouse takes this further, with two teams of two, where captured pieces from one board are passed to the teammate's board. This high interdependence and potential for unpredictable plays creates intense pressure and a specific type of anger.\n\nThe core of the \"Bughouse Effect\" is the frustration felt when a teammate's actions, even seemingly small ones, sabotage a carefully constructed plan, leading to a loss. This rage is described as complex, involving shattered cooperation, betrayal-anger, contempt, pain, confusion, and spite.\n\nThe author argues that this specific rage, while intensified in online Bughouse due to communication limitations and lack of accountability, can manifest in real-life situations. Two case studies illustrate this: Christian Bale's on-set outburst, where the photographer's actions disrupted Bale's performance, and the Stag Hunt game theory model, where a lack of coordination can lead to failure for all involved. The article suggests that the \"Bughouse Effect\" occurs when interdependent teamwork is undermined by a teammate's perceived incompetence, leading to disproportionate frustration and anger.\n",
    "chinese_title": "虫舍效应",
    "chinese_summary": "Bughouse效应：探究与陌生人在线下四国象棋中产生的独特怒火，并将其与现实生活中因队友被认为无能或失败而导致合作努力失败的情况进行对比。\n\n作者首先解释了疯狂象棋，一种被俘虏的棋子可以重新放回棋盘的变体。四国象棋更进一步，由两队两人组成，其中一个棋盘上被俘虏的棋子会被传递到队友的棋盘上。这种高度的相互依赖性和不可预测的下法会产生巨大的压力和一种特定的愤怒。\n\n“Bughouse效应”的核心在于，当队友的行为，即使是看似微小的行为，破坏了一个精心构建的计划，导致失败时所感受到的挫败感。这种愤怒被描述为复杂的，包括破碎的合作、背叛-愤怒、蔑视、痛苦、困惑和怨恨。\n\n作者认为，这种特定的愤怒，虽然由于沟通限制和缺乏问责制而在在线四国象棋中加剧，但也会在现实生活中显现。两个案例研究说明了这一点：克里斯蒂安·贝尔在片场的爆发，摄影师的行为打断了贝尔的表演；以及猎鹿博弈论模型，缺乏协调会导致所有参与者失败。文章表明，“Bughouse效应”发生在相互依赖的团队合作因队友被认为无能而被破坏时，导致不成比例的挫败感和愤怒。"
  },
  {
    "id": "46051724",
    "title": "Notes on the Troubleshooting and Repair of Computer and Video Monitors",
    "url": "https://www.repairfaq.org/sam/monfaq.htm",
    "summary": "This document is a comprehensive guide to troubleshooting and repairing CRT-based computer and video monitors, written by Samuel M. Goldwasser and copyrighted from 1994-2021. It emphasizes safety due to the lethal dangers of high voltage components and CRT implosion.\n\nThe guide covers monitor fundamentals, characteristics, and types (analog vs. digital, interlacing), along with performance testing and common problems like dead monitors, blown fuses, and picture distortions. It delves into monitor subsystems, including the low voltage and high voltage power supplies, deflection systems, and video processing.\n\nThe document offers detailed troubleshooting steps for various issues such as power supply failures, deflection problems (size, position, sync), high voltage problems (arcing, shutdown), and raster/color/video problems (blank screen, color issues, focus problems). It also provides guidance on adjustments like focus, brightness, color balance, and geometry.\n\nBeyond repair, the document addresses monitor placement, preventive maintenance, and miscellaneous issues like buzzing, whine, interference, and burning smells. It includes information on identifying components, testing procedures, and where to find parts and schematics. Finally, it touches on various topics of interest such as monitor specifications, refresh rates, video standards, energy saving modes, and disposal of dead monitors, as well as providing links to other information sources and a USENET newsgroup.\n",
    "chinese_title": "计算机及视频监视器故障排除和维修注意事项",
    "chinese_summary": "本文是Samuel M. Goldwasser撰写并于1994-2021年拥有版权的基于CRT的计算机和视频显示器故障排除和维修的综合指南。它强调安全，因为高压组件和CRT内爆具有致命危险。\n\n该指南涵盖显示器基础知识、特性和类型（模拟与数字、隔行扫描），以及性能测试和常见问题，如显示器无法工作、保险丝熔断和图像失真。它深入研究了显示器子系统，包括低压和高压电源、偏转系统和视频处理。\n\n本文档提供了针对各种问题的详细故障排除步骤，例如电源故障、偏转问题（尺寸、位置、同步）、高压问题（打火、关机）和光栅/颜色/视频问题（黑屏、颜色问题、聚焦问题）。它还提供有关聚焦、亮度、色彩平衡和几何校正等调整的指导。\n\n除了维修之外，本文档还讨论了显示器放置、预防性维护以及其他问题，如嗡嗡声、啸叫声、干扰和烧焦气味。它包括有关识别组件、测试程序以及在哪里找到零件和原理图的信息。最后，它涉及各种感兴趣的主题，例如显示器规格、刷新率、视频标准、节能模式和报废显示器的处理，以及提供其他信息来源和USENET新闻组的链接。"
  },
  {
    "id": "46057874",
    "title": "A National Mission to Accelerate Science Through Artificial Intelligence",
    "url": "https://energy.gov/genesis",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "通过人工智能加速科学的国家使命",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46058531",
    "title": "KDE Plasma 6.8 Will Go Wayland-Exclusive in Dropping X11 Session Support",
    "url": "https://www.phoronix.com/news/KDE-Plasma-68-Wayland-Exclusive",
    "summary": "In a move signaling a full commitment to Wayland, KDE developers have announced that Plasma 6.8 will be Wayland-exclusive, dropping support for the Plasma X11 session. While the Plasma X11 session will be removed, support for X11 applications and games will continue through XWayland.\n\nThe developers state that most users are already using the Wayland session, and removing X11 support will enable faster development, new features, and optimizations.\n\nUsers still relying on the X11 session have time to migrate. The Plasma 6.7 series, which includes X11 support, will be maintained until early 2027, potentially with extra bug-fix releases to accommodate X11 holdouts. More details are available on the KDE.org blog. The announcement was made on November 26, 2025.\n",
    "chinese_title": "KDE Plasma 6.8 将仅支持 Wayland，不再提供 X11 会话支持",
    "chinese_summary": "KDE开发者宣布，为全面转向Wayland，Plasma 6.8将仅支持Wayland，不再支持Plasma X11会话。虽然Plasma X11会话将被移除，但对X11应用程序和游戏的支持将通过XWayland继续提供。\n\n开发者表示，大多数用户已在使用Wayland会话，移除X11支持将有助于加快开发速度、推出新功能并进行优化。\n\n仍然依赖X11会话的用户有时间进行迁移。包含X11支持的Plasma 6.7系列将维护到2027年初，可能会发布额外的错误修复版本以满足X11用户的需求。更多详情请访问KDE.org博客。该声明于2025年11月26日发布。"
  },
  {
    "id": "46036908",
    "title": "Show HN: I built an interactive HN Simulator",
    "url": "https://news.ysimulator.run/news",
    "summary": "This \"Show HN\" post introduces an interactive Hacker News (HN) Simulator. The poster created a simulator that likely mimics the experience of browsing and interacting with the Hacker News platform. While the post itself is extremely brief, the key takeaway is the availability of this simulator. The post is intended to garner interest from the Hacker News community, showcasing a project built that's related to the platform itself. Users might be interested in testing the simulator to experience a gamified or simulated version of HN, potentially for fun, learning, or even for predicting outcomes. Without further context, the purpose and functionality of the simulator remain ambiguous beyond its general intention to simulate the Hacker News experience.\n",
    "chinese_title": "Show HN：我做了一个交互式 HN 模拟器",
    "chinese_summary": "推出互动式 Hacker News (HN) 模拟器"
  },
  {
    "id": "46029453",
    "title": "Practical Security in Production",
    "url": "https://queue.acm.org/detail.cfm?id=3773097",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "生产环境中的实用安全",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45989947",
    "title": "Marble Springs (1993)",
    "url": "https://www.eastgate.com/MS/Title_184.html",
    "summary": "\"Marble Springs (1993)\" is a hypertext fiction written by Deena Larsen and illustrated by Kathleen A. Turner-Suarez. Published by Eastgate Systems, it is a work that encourages reader exploration through numerous links. This particular version presented is a World Wide Web sample consisting of 35 pages and approximately 600 links, significantly smaller than the full HyperCard version.\n\nWhile the full version allows users to click anywhere to begin, this demonstration version offers a set of starting points. Readers can begin their exploration at various nodes, including \"Prologue,\" \"Demo Version Contents,\" \"Settling In,\" \"Journeys,\" \"Histories,\" \"Respect,\" \"Whispers in Wine,\" \"Hair,\" \"Counting,\" and \"Doc Nancy.\" Other options are more meta-textual, allowing the reader to learn about the authors, copyright information, how to read hypertext, and even how to write hypertext.\n\nThe text also provides information on how to order the full version of \"Marble Springs\" and suggests another Eastgate fiction to visit, suggesting the reader is part of a community interested in this type of literature. The copyright indicates Larsen retains rights to the work, emphasizing its originality.\n",
    "chinese_title": "大理石泉 (1993)",
    "chinese_summary": "《大理石泉(1993)》是由迪娜·拉森创作、凯瑟琳·A·特纳-苏亚雷斯配图的超文本小说。由Eastgate Systems出版，这部作品通过大量的链接鼓励读者探索。此版本为万维网示例，包含35页和约600个链接，远小于完整的HyperCard版本。\n\n完整版允许用户点击任何位置开始阅读，而此演示版本提供了一系列起始点。读者可以从多个节点开始探索，包括“序言”、“演示版本内容”、“定居”、“旅程”、“历史”、“尊重”、“葡萄酒中的低语”、“头发”、“计数”和“南希医生”。其他选项更偏元文本，允许读者了解作者、版权信息、如何阅读超文本，甚至如何编写超文本。\n\n该文本还提供了如何订购完整版《大理石泉》的信息，并推荐了另一部Eastgate小说，暗示读者是对此类文学感兴趣的社群的一部分。版权声明表明拉森保留作品权利，强调了其原创性。"
  },
  {
    "id": "46004519",
    "title": "Inflatable Space Stations",
    "url": "https://worksinprogress.co/issue/inflatable-space-stations/",
    "summary": "This article explores the historical detour in space station design, from early visions of rotating, artificial gravity stations to the modular, zero-gravity structures that became the norm. Visionaries like Von Braun advocated for rotating wheel stations to combat the physiological effects of weightlessness, but the Apollo program shifted priorities, leading to smaller, modular stations like Skylab and the ISS.\n\nThe article highlights the engineering challenges of building large stations, particularly fitting them into slender rockets. While modular assembly, like that of the ISS, is effective, it's limiting in scale. Unitized stations, such as inflatable designs, offer an alternative, potentially overcoming volume restrictions. Early NASA Langley prototypes, including inflatable Goodyear tire tubes and rigid hexagonal structures, explored this concept.\n\nCommercial space companies are now revisiting artificial gravity, with Vast aiming for a 40-person rotating station by 2035. In-space manufacturing is a key driver, initially focusing on zero-gravity production but potentially leading to larger, inflated structures for Mars missions.\n\nInflatable stations, like the Bigelow module on the ISS, are gaining traction due to advancements in high-strength fabrics and their efficient volume utilization. The article concludes by suggesting that a return to inflatable, rotating designs may be the key to achieving the grand visions of artificial gravity space stations envisioned by early space pioneers. The race for volume and floor space emphasizes the continuing evolution of space station design to meet the needs of both crew comfort and advanced space-based manufacturing.\n",
    "chinese_title": "充气式空间站",
    "chinese_summary": "本文探讨了空间站设计的历史性偏离，从早期旋转式、人工重力空间站的设想到成为常态的模块化、零重力结构。 冯·布劳恩等先驱倡导旋转轮式空间站以对抗失重带来的生理影响，但阿波罗计划转移了重心，导致了像天空实验室和国际空间站这样更小、更模块化的空间站的出现。\n\n本文强调了建造大型空间站的工程挑战，特别是如何将它们装入细长的火箭。 像国际空间站那样，模块化组装是有效的，但规模有限。 单元化空间站，如充气式设计，提供了一种替代方案，有可能克服体积限制。 包括固特异轮胎充气管和刚性六边形结构在内的早期NASA兰利原型探索了这一概念。\n\n商业航天公司现在正在重新审视人工重力，Vast 公司的目标是到 2035 年建成一个可容纳 40 人的旋转空间站。 太空制造是一个关键驱动因素，最初专注于零重力生产，但可能导致用于火星任务的更大、充气的结构。\n\n像国际空间站上的毕格罗模块这样的充气式空间站，由于高强度织物的发展及其高效的体积利用率而越来越受欢迎。 文章最后指出，回归充气式、旋转式设计可能是实现早期太空先驱所设想的人工重力空间站宏伟愿景的关键。 对体积和地板面积的追求强调了空间站设计的持续演变，以满足机组人员的舒适度和先进的太空制造需求。"
  },
  {
    "id": "46057989",
    "title": "The games industry's self-induced traumatic brain injury",
    "url": "https://doctorow.medium.com/https-pluralistic-net-2025-11-17-stop-killing-games-again-object-transience-f63af9cde93f",
    "summary": "The article \"The Games Industry's Self-Induced Traumatic Brain Injury\" by Cory Doctorow argues that the games industry is systematically destroying its own history and creating a \"traumatic brain injury\" by making games impermanent and inaccessible. He attributes this to a combination of factors, primarily DRM (Digital Rights Management), online-only components, and the \"games-as-a-service\" model.\n\nDoctorow points out that DRM actively prevents preservation efforts and makes games unplayable once the DRM servers are shut down. The reliance on always-online functionality, even for single-player games, renders them obsolete when the servers are retired. The \"games-as-a-service\" model further exacerbates this issue by constantly updating and changing the game, effectively overwriting and making previous versions unavailable.\n\nHe argues that this impermanence harms the industry by preventing future generations from learning from the past and potentially leading to stagnation and repetition. It also diminishes the cultural significance of games, as they are treated as disposable commodities rather than enduring art forms. He contrasts this with other artistic mediums like film and literature, where preservation and accessibility are considered crucial.\n\nDoctorow concludes by calling for the games industry to adopt more sustainable practices, such as prioritizing single-player offline modes, removing DRM, and archiving older versions of games. He suggests that a more respectful approach to its own history would ultimately benefit the industry and its players. In essence, he believes the industry is actively harming itself by erasing its past and argues for proactive preservation.\n",
    "chinese_title": "游戏业界的自残性脑损伤",
    "chinese_summary": "科里·多克托罗的文章《游戏产业自残式脑损伤》认为，游戏产业正在系统性地摧毁自身的历史，并通过使游戏变得短暂且难以访问来制造“脑损伤”。他将此归因于多种因素的结合，主要是DRM（数字版权管理）、纯在线组件和“游戏即服务”模式。\n\n多克托罗指出，DRM积极阻止了保存工作，并在DRM服务器关闭后使游戏无法运行。即使是单人游戏，对始终在线功能的依赖也会在服务器退役时使其过时。“游戏即服务”模式通过不断更新和更改游戏，有效地覆盖和使以前的版本不可用，从而进一步加剧了这个问题。\n\n他认为，这种短暂性损害了该行业，因为它阻止了后代从过去中学习，并可能导致停滞和重复。它也降低了游戏的文化意义，因为它们被视为一次性商品，而不是持久的艺术形式。他将其与电影和文学等其他艺术媒介进行了对比，在这些媒介中，保存和可访问性被认为是至关重要的。\n\n多克托罗最后呼吁游戏行业采取更可持续的做法，例如优先考虑单人离线模式、删除DRM以及存档旧版本的游戏。他认为，尊重自身历史的举措最终将使该行业及其玩家受益。本质上，他认为该行业正在通过抹去其过去来积极伤害自己，并主张积极保存。"
  },
  {
    "id": "46018374",
    "title": "Pitch Multiplication (2017)",
    "url": "https://klangnewmusic.weebly.com/direct-sound/pitch-multiplication",
    "summary": "This article, \"Pitch Multiplication,\" introduces the concept of pitch multiplication, a compositional technique used by Pierre Boulez and others to generate pitch material. The author explains that pitch multiplication involves multiplying two pitch class sets to create a larger superset.\n\nThe article distinguishes between simple and complex multiplication, focusing on the former. It outlines key terminology like \"multiplicand,\" \"multiplier,\" \"product,\" \"normal form,\" and \"OIS.\" Nicholas Slonimsky's \"Thesaurus of Scales and Melodic Patterns\" is cited as an early example, although Slonimsky's method creates ordered transpositions of a single set, differing from Boulez's approach.\n\nThe author then details two methods for simple pitch multiplication: the Cartesian product and a method based on ordered interval series. The Cartesian product involves creating pairs of elements from the two sets, summing them modulo 12, and resulting in a new set. Boulez's method, described by Stephen Heinemann, relies on determining the Ordered Pitch-Class Interval Structure (OIS) of one set and using the elements of the other set as transposition levels for the OIS, then joining the results. The article also explains how to generate different results by rotating the order of one set (the multiplicand) which changes the OIS. Finally, it demonstrates how to switch the multiplicand and multiplier, but with the requirement that set X remains in normal form, and set Y is converted to an OIS. The author provides examples to illustrate each method and its variations, emphasizing that the generated supersets can then be used for melodic writing or as intermediary pitch collections.\n",
    "chinese_title": "音高倍增 (2017)",
    "chinese_summary": "这篇名为“音高倍增”的文章介绍了音高倍增的概念，这是一种皮埃尔·布列兹等人用于生成音高素材的作曲技巧。作者解释说，音高倍增涉及将两个音高类集合相乘以创建一个更大的超集。\n\n文章区分了简单倍增和复杂倍增，重点关注前者。它概述了关键术语，如“被乘数”、“乘数”、“乘积”、“标准型”和“OIS”。尼古拉斯·斯洛尼姆斯基的《音阶和旋律模式词典》被引用为一个早期例子，尽管斯洛尼姆斯基的方法创建的是单个集合的有序移调，这与布列兹的方法不同。\n\n然后，作者详细介绍了两种简单的音高倍增方法：笛卡尔积和基于有序音程序列的方法。笛卡尔积涉及创建来自两个集合的元素对，将它们以模12求和，并得到一个新的集合。布列兹的方法，由斯蒂芬·海涅曼描述，依赖于确定一个集合的有序音高类音程结构（OIS），并使用另一个集合的元素作为OIS的移调级别，然后连接结果。文章还解释了如何通过旋转一个集合（被乘数）的顺序来生成不同的结果，从而改变OIS。最后，它演示了如何切换被乘数和乘数，但要求集合X保持标准型，集合Y转换为OIS。作者提供了示例来说明每种方法及其变体，强调生成的超集可以用于旋律写作或作为中间音高集合。"
  },
  {
    "id": "46053017",
    "title": "Space: 1999 – Special Effects Techniques",
    "url": "https://catacombs.space1999.net/main/pguide/upsfx.html",
    "summary": "This article outlines the special effects techniques used in the science fiction television series *Space: 1999* and its connection to a rich lineage of British SFX expertise. The piece credits the strong British film industry, stemming from pioneers like Alexander Korda and his recruited Hollywood SFX expert Ned Mann, who trained a generation of British technicians including Walter Percy \"Pop\" Day, Wally Veevers, Tom Howard, Peter Ellenshaw and Les Bowie. Les Bowie's influence extended to Derek Meddings and Brian Johnson, who further honed their skills with Gerry and Sylvia Anderson and on Stanley Kubrick's *2001: A Space Odyssey*.\n\nBrian Johnson, the SFX supervisor for *Space: 1999*, drew on these experiences. He nearly worked on *Star Wars*, but his commitment to *Space: 1999* prevented it. *Star Wars* went on to revolutionize SFX with integrated circuits controlling cameras.\n\nThe process for *Space: 1999* involved identifying SFX scenes in the script, annotating them, creating storyboards for each SFX shot, and filming miniatures (models and sets) with a 35mm Mitchell camera. Filming often took place at Bray Studios, including stages with sunken sections for the camera.\n",
    "chinese_title": "太空：1999 – 特效技术",
    "chinese_summary": "本文概述了科幻电视剧《太空：1999》中使用的特效技术，以及它与英国丰富的特效技术传承之间的联系。文章认为强大的英国电影业功不可没，这源于亚历山大·柯达及其招募的好莱坞特效专家内德·曼，后者培养了一代英国技术人员，包括沃尔特·珀西“波普”·戴、沃利·维弗斯、汤姆·霍华德、彼得·艾伦肖和莱斯·鲍伊。莱斯·鲍伊的影响力延伸到德里克·梅丁斯和布莱恩·约翰逊，他们与格里和西尔维娅·安德森以及在斯坦利·库布里克的《2001：太空漫游》中进一步磨练了他们的技能。\n\n《太空：1999》的特效总监布莱恩·约翰逊借鉴了这些经验。他差点参与了《星球大战》的制作，但由于他对《太空：1999》的承诺而未能成行。《星球大战》后来彻底改变了特效技术，利用集成电路控制摄影机。\n\n《太空：1999》的制作过程包括识别剧本中的特效场景，对其进行注释，为每个特效镜头创建故事板，并使用35毫米米切尔摄影机拍摄微缩模型（模型和场景）。拍摄通常在布雷工作室进行，包括带有摄影机沉陷部分的舞台。"
  },
  {
    "id": "46053227",
    "title": "Design Follows Data Structures",
    "url": "https://www.tedinski.com/2019/01/29/data-structures-are-fundamental.html",
    "summary": "This article argues that **\"Design Follows Data Structures\"** because modern performance optimization is heavily influenced by cache efficiency and memory layout, making data representation a critical design consideration.\n\nThe author contends that traditional instruction-level optimizations are less relevant due to CPU speed relative to memory access latency and advanced compiler capabilities. Compilers, however, struggle to optimize data structures because data representation often forms a system boundary they cannot freely alter. While inlining can sometimes enable data structure optimizations by exploding structures into local variables, it's limited.\n\nObject-oriented programming, while aiming to encapsulate data structure choices behind interfaces, doesn't fully address the issue, especially concerning performance-driven changes. Techniques like getters/setters often add unnecessary complexity without real benefit. Changes like switching from \"array of structs\" to \"struct of arrays\" are often antithetical to OO principles.\n\nThe author suggests that invasive data representation changes are best handled with languages featuring strong type systems. These languages should be used to deliberately introduce compiler errors by changing types, then systematically fixing each error. This approach ensures complete conversion, avoids compatibility shims, bypasses dogma, and offers insights into data structure usage.\n\nThe article concludes by advocating for controlling dependencies and preventing data representation details from leaking into system boundaries, emphasizing the importance of early consideration of data structures in design for performance-critical applications.\n",
    "chinese_title": "设计追随数据结构",
    "chinese_summary": "设计跟随数据结构：现代性能优化受缓存效率和内存布局影响巨大，数据表示是关键的设计考量。传统指令级优化作用减弱，编译器难以优化数据结构。面向对象编程虽封装数据结构，但性能驱动的修改仍是问题。侵入式数据表示修改更适合强类型语言，通过修改类型引入编译错误，再逐个修复，确保完整转换，避免兼容层。控制依赖，防止数据表示细节泄露到系统边界，强调设计初期考虑数据结构的重要性。"
  },
  {
    "id": "45982875",
    "title": "Broccoli Man, Remastered",
    "url": "https://mbleigh.dev/posts/broccoli-man-remastered/",
    "summary": "This article details the author's experience recreating the Google cultural classic \"Broccoli Man\" video using AI technology. Reminded of the original video, the author spent a single Saturday utilizing Veo 3.1 and Nano Banana to create a 4-minute short film, acknowledging its glitches while emphasizing its spirit.\n\nThe process involved script preparation using AI Studio to break down the original video into scenes, followed by using Magic Markup (a Nano Banana tool) to create photorealistic character ingredients. The author then used Vertex AI Studio with Veo 3.1 to generate video clips based on prompts, emphasizing an iterative process of generating multiple takes and tweaking prompts. CapCut was used for editing, and Suno v5 for end credits music.\n\nThe author highlights that character consistency, voice consistency, and audio sync were surprisingly easy to achieve. However, challenges included working with fixed 8-second durations, maintaining interest in static scenes, achieving blocking/camera control, eliciting strong character emotions (\"EMOTE!\"), navigating content guardrails, and executing fast-paced actions and specific character interactions.\n\nPost-production involved substantial trimming, interleaving different takes, and manipulating audio within CapCut. The author emphasizes the necessity of non-linear video editing for success and the importance of intentional timing and composition.\n\nThe author concludes by stating that while the result is not cinema, the project wouldn't have been possible without AI. The creation was a fun exercise and provided amusement for Googlers. The author argues that technology amplifies intent, either creative joy or cynical greed, and ultimately, creativity and human effort will always be valued.\n",
    "chinese_title": "西兰花侠，重制版",
    "chinese_summary": "本文详细介绍了作者使用人工智能技术重现谷歌文化经典“西兰花人”视频的经验。作者回忆起原始视频，仅用一个星期六的时间，便利用 Veo 3.1 和 Nano Banana 创作了一部 4 分钟的短片，承认其存在瑕疵，但强调其精神内核。\n\n该过程包括使用 AI Studio 准备剧本，将原始视频分解为场景，然后使用 Magic Markup（Nano Banana 的一个工具）创建照片般逼真的人物素材。之后，作者使用 Vertex AI Studio 和 Veo 3.1，根据提示生成视频片段，并强调生成多个镜头和调整提示的迭代过程。CapCut 用于剪辑，Suno v5 用于片尾字幕音乐。\n\n作者强调，角色一致性、声音一致性和音频同步出乎意料地容易实现。然而，挑战包括处理固定的 8 秒时长、保持静态场景的趣味性、实现机位/镜头控制、激发强烈的人物情感（“表情！ ”）、应对内容护栏，以及执行快节奏的动作和特定的人物互动。\n\n后期制作涉及大量的修剪、交错不同的镜头以及在 CapCut 中处理音频。作者强调了非线性视频编辑对于成功的必要性，以及有意的时间安排和构图的重要性。\n\n作者总结道，虽然结果并非电影大片，但如果没有人工智能，这个项目是不可能完成的。这次创作是一次有趣的练习，并为谷歌员工提供了娱乐。作者认为，技术放大了意图，无论是创造性的快乐还是愤世嫉俗的贪婪，最终，创造力和人类的努力将永远受到重视。"
  },
  {
    "id": "46053385",
    "title": "Show HN: A WordPress plugin that rewrites image URLs for near-zero-cost delivery",
    "url": "https://wordpress.org/plugins/bandwidth-saver/",
    "summary": "Bandwidth Saver is a WordPress plugin designed to speed up website image delivery by serving them from Cloudflare's global network, reducing bandwidth consumption and improving page load times. It offers two modes: a \"Managed\" option with one-click setup for $2.99/month, where ImgPro handles the infrastructure, and a free \"Self-Hosted\" option for developers who want full control using their own Cloudflare account.\n\nThe plugin rewrites image URLs to point to Cloudflare, caching images on first access and delivering them from the nearest edge server for subsequent visitors. It is compatible with virtually any theme, page builder, image optimization plugin, or caching plugin and supports various image formats. If the CDN is unavailable, images automatically load from the origin server.\n\nBandwidth Saver prioritizes privacy, avoiding visitor tracking, cookies, and analytics. For Managed users, only site URL and admin email are stored for account management. The plugin is open-source, allowing for inspection, forking, and contributions. Setup involves either a simple activation for the managed option or deploying a Cloudflare worker and configuring the R2 bucket for the self-hosted option.\n",
    "chinese_title": "Show HN: 一款能近乎零成本交付的WordPress插件，可重写图片URL",
    "chinese_summary": "带宽节省器是一款WordPress插件，旨在通过Cloudflare全球网络加速网站图像交付，降低带宽消耗并缩短页面加载时间。它提供两种模式：一种是“托管”选项，一键设置，每月2.99美元，由ImgPro负责基础设施；另一种是免费的“自托管”选项，适用于希望使用自己的Cloudflare账户进行完全控制的开发者。\n\n该插件会重写图像URL以指向Cloudflare，首次访问时缓存图像，并为后续访问者从最近的边缘服务器提供图像。它与几乎任何主题、页面构建器、图像优化插件或缓存插件兼容，并支持各种图像格式。如果CDN不可用，图像会自动从源服务器加载。\n\n带宽节省器优先考虑隐私，避免访客跟踪、cookies和分析。对于托管用户，仅存储站点URL和管理员电子邮件以进行帐户管理。该插件是开源的，允许检查、派生和贡献。设置包括简单激活托管选项，或者部署Cloudflare worker并配置R2存储桶用于自托管选项。"
  },
  {
    "id": "46051393",
    "title": "What they don't tell you about maintaining an open source project",
    "url": "https://andrej.sh/blog/maintaining-open-source-project/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "维护开源项目那些不为人知的事",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46038099",
    "title": "Unpowered SSDs slowly lose data",
    "url": "https://www.xda-developers.com/your-unpowered-ssd-is-slowly-losing-your-data/",
    "summary": "This article discusses the limitations of using SSDs for long-term, unpowered data storage. While SSDs have largely replaced HDDs due to their speed and efficiency, they aren't ideal for cold storage due to data retention issues. SSDs use NAND flash cells to store data, which retain information even without power, but this retention isn't indefinite.\n\nThe data retention duration depends on the type of NAND used: QLC NAND can hold data for about a year, TLC NAND for up to 3 years, and MLC/SLC for 5-10 years. As most consumer SSDs use TLC or QLC NAND, leaving them unpowered for extended periods (over a year) increases the risk of data corruption or loss due to voltage loss in the NAND cells.\n\nHowever, the article emphasizes that this issue mainly concerns enterprise, enthusiast, and solopreneur users who need to archive large amounts of data for years on unpowered drives. For typical users with PCs that are occasionally left unpowered for a few months, this isn't a major concern.\n\nThe author strongly recommends implementing a backup strategy, such as the 3-2-1 rule (3 copies of data on 2 different media, 1 off-site), regardless of the storage medium used. This safeguards data against drive failure, power surges, and other potential issues. While SSDs are suitable for primary storage in actively used PCs, they aren't reliable for long-term, unpowered archival storage. Using alternative storage media and investing in a robust backup system are crucial for data preservation.\n",
    "chinese_title": "未通电的固态硬盘会缓慢丢失数据",
    "chinese_summary": "固态硬盘在长期断电数据存储中的局限性\n\n本文探讨了使用固态硬盘进行长期断电数据存储的局限性。虽然固态硬盘因其速度和效率在很大程度上取代了硬盘，但由于数据保留问题，它们并非冷存储的理想选择。固态硬盘使用NAND闪存单元来存储数据，即使没有电源也能保留信息，但这种保留不是无限期的。\n\n数据保留时间取决于NAND的类型：QLC NAND可以保存数据约一年，TLC NAND可以保存数据长达3年，而MLC/SLC可以保存5-10年。由于大多数消费级固态硬盘使用TLC或QLC NAND，因此长时间（超过一年）断电会增加数据损坏或丢失的风险，这是由于NAND单元中的电压损失造成的。\n\n然而，本文强调，这个问题主要关系到需要将大量数据在断电驱动器上存档多年的企业、爱好者和个体经营者用户。对于偶尔断电几个月的典型PC用户来说，这不是一个主要问题。\n\n作者强烈建议实施备份策略，例如3-2-1规则（3个数据副本存储在2种不同的介质上，其中1个异地备份），无论使用何种存储介质。这可以保护数据免受驱动器故障、电源浪涌和其他潜在问题的影响。虽然固态硬盘适用于经常使用的PC中的主存储，但它们对于长期断电的存档存储并不可靠。使用替代存储介质并投资于强大的备份系统对于数据保存至关重要。"
  },
  {
    "id": "46042928",
    "title": "Human brains are preconfigured with instructions for understanding the world",
    "url": "https://news.ucsc.edu/2025/11/sharf-preconfigured-brain/",
    "summary": "Researchers at UC Santa Cruz are using brain organoids to study the origins of thought, finding evidence that the human brain is preconfigured with instructions for understanding the world. Their study, published in *Nature Neuroscience*, demonstrates that the earliest electrical activity in these organoids occurs in structured patterns even without any external sensory experiences.\n\nThe research team observed that neurons in the developing organoids, within the first few months of development, spontaneously emit electrical signals resembling the \"default mode\" of the brain, a basic underlying structure for neuron firing. These patterns, observed long before the brain can process external stimuli like sight or sound, suggest a genetically encoded blueprint that is refined by sensory input later in development.\n\nTal Sharf, the study's senior author, emphasizes that these self-assembled circuits form before any external experience, indicating a primordial \"operating system\" for the brain. This discovery has significant implications for understanding neurodevelopmental disorders and the impact of toxins on the developing brain. By using organoids, researchers can study the early stages of brain development ethically and in a controlled environment, providing a window into the self-assembly process.\n\nThe findings open possibilities for developing therapies and interventions for brain disorders at the preclinical level, including drug therapies and gene editing tools. The study highlights the potential of organoids as models for understanding human neurodevelopment, disease, and the effects of toxins in the brain.\n",
    "chinese_title": "人类大脑预先配置了理解世界的指令。",
    "chinese_summary": "加州大学圣克鲁兹分校的研究人员利用脑 organoids 研究思想的起源，发现证据表明人脑预先配置了理解世界的指令。他们的研究发表在《自然神经科学》杂志上，表明这些 organoids 中最早的电活动以结构化的模式发生，即使没有任何外部感官体验。\n\n研究团队观察到，在发育的前几个月内，发育中的 organoids 中的神经元会自发地发出类似于大脑“默认模式”的电信号，这是一种神经元放电的基本底层结构。这些模式在远在大脑能够处理诸如视觉或听觉等外部刺激之前就被观察到，这表明存在一种基因编码的蓝图，该蓝图在发育后期会被感觉输入进行改进。\n\n该研究的资深作者 Tal Sharf 强调，这些自组装回路在任何外部经验之前就已经形成，表明大脑存在一个原始的“操作系统”。这一发现对理解神经发育障碍以及毒素对发育中大脑的影响具有重要意义。通过使用 organoids，研究人员可以在符合伦理且受控的环境中研究大脑发育的早期阶段，从而提供一个了解自组装过程的窗口。\n\n这些发现为在临床前水平上开发针对脑部疾病的疗法和干预措施（包括药物疗法和基因编辑工具）开辟了可能性。该研究强调了 organoids 作为理解人类神经发育、疾病和毒素对大脑影响的模型的潜力。"
  },
  {
    "id": "46013478",
    "title": "The history of Indian science fiction",
    "url": "https://altermag.com/articles/the-secret-history-of-indian-science-fiction",
    "summary": "This article explores the history of Indian science fiction (SF), arguing that it has a unique trajectory shaped by colonial history, social movements, and linguistic diversity. It begins with Rokeya Sakhawat Hossain's \"Sultana's Dream\" (1905) as a foundational text, highlighting its feminist utopian vision and use of \"cognitive estrangement.\"\n\nThe article notes that early Indian SF, primarily in Urdu and Bengali, was often linked to social realism and featured scientists as authors, resulting in a style called \"kalpavigyan\" or \"scientifiction.\" It contrasts this with the evolution of English-language SF in the West, which moved from techno-optimistic pulp to socially conscious works exploring gender, race, and the digital age. While international conversations in SF occurred, post-Independence Indian SF remained somewhat isolated.\n\nThe article further explains that despite the dominance of serious, thematically heavy novels in English in post-colonial India, genre writing continued in non-English languages, citing examples like Satyajit Ray's Professor Shonku series and works by Sujatha in Tamil. It also notes that the scientific bent of this writing in local languages emphasized entertainment and education. Ultimately, the article underscores the need for greater translation and cross-cultural dialogue within Indian SF to fully appreciate its history and potential.\n",
    "chinese_title": "印度科幻史",
    "chinese_summary": "本文探讨了印度科幻小说的历史，认为它具有独特的轨迹，受殖民历史、社会运动和语言多样性的影响。文章以Rokeya Sakhawat Hossain的《苏丹娜之梦》（1905年）为基础文本，突出了其女性主义乌托邦愿景和“认知疏离”的运用。\n\n文章指出，早期印度科幻小说主要以乌尔都语和孟加拉语写成，通常与社会现实主义相关联，并且作者多为科学家，从而形成了一种被称为“kalpavigyan”或“scientifiction”的风格。文章将其与西方英语科幻小说的演变进行了对比，后者从技术乐观的通俗小说发展到探索性别、种族和数字时代等具有社会意识的作品。尽管科幻小说领域存在国际对话，但独立后的印度科幻小说在某种程度上仍然孤立。\n\n文章进一步解释说，尽管后殖民时期的印度英语小说以严肃、主题沉重的作品为主，但在非英语语言中，类型文学仍在继续发展，文章引用了萨蒂亚吉特·雷的《尚古教授》系列和苏佳塔在泰米尔语的作品等例子。文章还指出，这些本地语言作品的科学倾向强调娱乐和教育。最终，文章强调需要在印度科幻小说内部加强翻译和跨文化对话，以充分认识其历史和潜力。"
  },
  {
    "id": "46032539",
    "title": "Shai-Hulud Returns: Over 300 NPM Packages Infected",
    "url": "https://helixguard.ai/blog/malicious-sha1hulud-2025-11-24",
    "summary": "The HelixGuard security research team has identified a widespread supply chain attack affecting over 300 NPM packages, dubbed \"Shai-Hulud Returns,\" a reference to the sandworms of Dune. The attack involves malicious code being injected into these packages, potentially compromising applications that depend on them.\n\nThe compromised packages contain code designed to steal sensitive information like environment variables, API keys, and potentially even cryptocurrency wallets. The attackers are likely using automated methods to inject this malicious code, targeting popular and widely used NPM libraries to maximize their reach.\n\nThe researchers emphasize the importance of regularly auditing your dependencies and using security tools to detect and prevent such attacks. Developers are urged to check their projects for vulnerable packages and update to secure versions or remove them altogether. The exact mechanism of code injection isn't fully detailed in the summary, but the focus is on the impact and the urgent need for developers to take preventative measures to protect their applications and user data. The incident highlights the ongoing risks associated with supply chain vulnerabilities in the open-source ecosystem.\n",
    "chinese_title": "沙丘蠕虫归来：超过300个NPM包被感染",
    "chinese_summary": "螺旋卫士安全研究团队发现了一起影响超过300个NPM软件包的广泛供应链攻击，名为“沙虫归来”，典出《沙丘》中的沙虫。该攻击涉及将恶意代码注入这些软件包，可能危及依赖于它们的应用程序。\n\n被入侵的软件包包含旨在窃取敏感信息的代码，例如环境变量、API密钥，甚至可能包括加密货币钱包。攻击者可能正在使用自动化方法注入此恶意代码，目标是流行和广泛使用的NPM库，以最大限度地扩大其影响范围。\n\n研究人员强调定期审计您的依赖项并使用安全工具来检测和预防此类攻击的重要性。强烈建议开发人员检查其项目是否存在易受攻击的软件包，并更新到安全版本或完全删除它们。摘要中并未完全详细说明代码注入的确切机制，但重点是其影响以及开发人员采取预防措施以保护其应用程序和用户数据的紧迫性。该事件凸显了开源生态系统中与供应链漏洞相关的持续风险。"
  },
  {
    "id": "46049722",
    "title": "Unison 1.0",
    "url": "https://www.unison-lang.org/unison-1-0/",
    "summary": "Unison 1.0 marks a significant milestone for the functional programming language, its distributed runtime, and its developer workflow. The release signifies a stabilization of the language's core, optimized tooling, collaborative features, and a deployment platform, Unison Cloud.\n\nUnison uniquely identifies code by its content rather than file names, which results in benefits like no redundant compilation, fewer versioning conflicts, and the ability to build self-deploying distributed systems. Code is managed in a database called a \"codebase,\" accessible through the CLI tool, UCM, and a GUI browser, UCM Desktop. Unison Share serves as a community hub for code hosting with navigable hyperlinks.\n\nUnison Cloud simplifies deploying applications, eliminating the need for YAML files or complex deployment scripts. The article outlines the language's core features through an example of a number guessing game.\n\nThe article details Unison's development timeline, from the company's founding in 2018 to key milestones like the first alpha release, adoption of SQLite for codebases, LSP support, project segmentation, and the release of Unison Cloud. Key metrics highlight the project's momentum, including commits, merged PRs, GitHub stars, and library downloads.\n\nFuture plans include C FFI support, improved record types, better library management, faster codebase sync, cloud observability, and an agentic computing framework. The article encourages community participation and provides answers to FAQs, addressing vendor lock-in concerns and highlighting Unison's collaborative features and native version control.\n",
    "chinese_title": "Unison 1.0\n统一体 1.0",
    "chinese_summary": "Unison 1.0标志着函数式编程语言、其分布式运行时及其开发者工作流程的一个重要里程碑。该版本的发布意味着语言核心的稳定、优化后的工具、协作功能以及部署平台Unison Cloud的推出。\n\nUnison独特地通过内容而非文件名来识别代码，从而带来诸多益处，例如无冗余编译、更少的版本冲突以及构建自部署分布式系统的能力。代码在名为“代码库”的数据库中管理，可通过CLI工具UCM和GUI浏览器UCM Desktop访问。Unison Share作为代码托管的社区中心，提供可导航的超链接。\n\nUnison Cloud简化了应用程序的部署，无需YAML文件或复杂的部署脚本。本文通过一个猜数字游戏的例子概述了该语言的核心功能。\n\n本文详细介绍了Unison的开发时间线，从2018年公司成立到关键里程碑，如首次Alpha版本发布、采用SQLite作为代码库、LSP支持、项目分段以及Unison Cloud的发布。关键指标突出了项目的势头，包括提交、合并的PR、GitHub星标和库下载量。\n\n未来的计划包括C FFI支持、改进的记录类型、更好的库管理、更快的代码库同步、云可观察性以及一个智能代理计算框架。本文鼓励社区参与，并提供了常见问题的解答，解决了对供应商锁定的担忧，并强调了Unison的协作功能和原生版本控制。"
  },
  {
    "id": "46051691",
    "title": "Reinventing how .NET builds and ships (again)",
    "url": "https://devblogs.microsoft.com/dotnet/reinventing-how-dotnet-builds-and-ships-again/",
    "summary": "This article discusses the challenges .NET faces in building and shipping its product due to its distributed development model. Originally, .NET transitioned to open source with components split into multiple repositories (CoreCLR, CoreFX, etc.). While this distributed approach offers advantages like layering, focused communities, and asynchronous development, it introduces significant complexity and overhead when quickly shipping updates or security patches that require coordinated changes across multiple repositories.\n\nThe article highlights the problems with this \"distributed product construction methodology,\" especially the difficulty in achieving coherency (agreement on component versions) across the entire product graph. This is illustrated with the example of a security patch requiring coordination between multiple teams and repositories, making the process slow and unpredictable.\n\nThe author introduces two key concepts: **Product Construction Complexity** (the number of steps required to get a change from developer to customer) and **Product Construction Overhead** (time spent not actively producing shippable artifacts). The article provides detailed examples illustrating how these factors slow down the .NET build and release process.\n\nTo address these issues, .NET is adopting a new approach called **Unified Build**. This project aims to consolidate product construction into a \"virtual monolithic\" repository, creating \"vertical builds,\" while still allowing developers to work outside the monolith. This approach, along with foundational technologies like Linux distro Source Build, is expected to reduce complexity and overhead, ultimately speeding up the build and release cycle for .NET.\n",
    "chinese_title": "重新定义 .NET 的构建和发布 (再次)",
    "chinese_summary": ".NET 在分布式开发模式下构建和发布产品所面临的挑战\n\n本文探讨了由于分布式开发模式，.NET 在构建和发布其产品时所面临的挑战。最初，.NET 过渡到开源，并将组件拆分为多个存储库（CoreCLR、CoreFX 等）。虽然这种分布式方法具有分层、专注的社区和异步开发等优点，但当快速发布需要跨多个存储库进行协调更改的更新或安全补丁时，它会引入显著的复杂性和开销。\n\n本文重点介绍了这种“分布式产品构建方法”的问题，尤其是难以在整个产品图中实现一致性（组件版本的一致）。一个需要多个团队和存储库之间进行协调的安全补丁的例子就说明了这一点，使得整个过程缓慢且不可预测。\n\n作者介绍了两个关键概念：**产品构建复杂度**（将变更从开发人员传递到客户所需的步骤数）和**产品构建开销**（未积极生成可交付制品所花费的时间）。本文提供了详细的示例，说明了这些因素如何减慢 .NET 的构建和发布过程。\n\n为了解决这些问题，.NET 正在采用一种名为 **统一构建** 的新方法。该项目旨在将产品构建整合到“虚拟单体”存储库中，创建“垂直构建”，同时仍然允许开发人员在单体之外工作。这种方法，以及 Linux 发行版源码构建等基础技术，有望降低复杂性和开销，最终加快 .NET 的构建和发布周期。"
  },
  {
    "id": "46009935",
    "title": "How the Atomic Tests Looked Like from Los Angeles",
    "url": "https://www.amusingplanet.com/2016/09/how-atomic-tests-looked-like-from-los.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How the Atomic Tests Looked Like from Los Angeles",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45981163",
    "title": "Hollywood's vision of ancient Rome is all wrong, according to Mary Beard",
    "url": "https://www.openculture.com/2025/11/why-your-vision-of-ancient-rome-is-all-wrong-according-to-historian-mary-beard.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Hollywood's vision of ancient Rome is all wrong, according to Mary Beard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45979180",
    "title": "LPLB: An early research stage MoE load balancer based on linear programming",
    "url": "https://github.com/deepseek-ai/LPLB",
    "summary": "生成摘要时出错",
    "chinese_title": "LPLB: An early research stage MoE load balancer based on linear programming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46056617",
    "title": "Study claims to provide first direct evidence of dark matter",
    "url": "https://www.theguardian.com/science/2025/nov/25/study-claims-to-provide-first-direct-evidence-of-dark-matter",
    "summary": "生成摘要时出错",
    "chinese_title": "Study claims to provide first direct evidence of dark matter",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46049066",
    "title": "Bad UX World Cup 2025",
    "url": "https://badux.lol/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bad UX World Cup 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46003606",
    "title": "Nearby peer discovery without GPS using environmental fingerprints",
    "url": "https://www.svendewaerhert.com/blog/nearby-peer-discovery/",
    "summary": "生成摘要时出错",
    "chinese_title": "Nearby peer discovery without GPS using environmental fingerprints",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46042655",
    "title": "Windows GUI – Good, Bad and Pretty Ugly (2023)",
    "url": "https://creolened.com/windows-gui-good-bad-and-pretty-ugly-ranked/",
    "summary": "生成摘要时出错",
    "chinese_title": "Windows GUI – Good, Bad and Pretty Ugly (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46039274",
    "title": "AI has a deep understanding of how this code works",
    "url": "https://github.com/ocaml/ocaml/pull/14369",
    "summary": "生成摘要时出错",
    "chinese_title": "AI has a deep understanding of how this code works",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46052102",
    "title": "The Generative Burrito Test",
    "url": "https://www.generativist.com/notes/2025/Nov/25/generative-burrito-test.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Generative Burrito Test",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46037591",
    "title": "Google's new 'Aluminium OS' project brings Android to PC",
    "url": "https://www.androidauthority.com/aluminium-os-android-for-pcs-3619092/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google's new 'Aluminium OS' project brings Android to PC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46037267",
    "title": "Mind-reading devices can now predict preconscious thoughts",
    "url": "https://www.nature.com/articles/d41586-025-03714-0",
    "summary": "生成摘要时出错",
    "chinese_title": "Mind-reading devices can now predict preconscious thoughts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46054879",
    "title": "Show HN: Anthony Bourdain's Lost Li.st's",
    "url": "https://bourdain.greg.technology/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Anthony Bourdain's Lost Li.st's",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46015095",
    "title": "A million ways to die from a data race in Go",
    "url": "https://gaultier.github.io/blog/a_million_ways_to_data_race_in_go.html",
    "summary": "生成摘要时出错",
    "chinese_title": "A million ways to die from a data race in Go",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46020564",
    "title": "The Definitive Classic Mac Pro (2006-2012) Upgrade Guide",
    "url": "https://blog.greggant.com/posts/2018/05/07/definitive-mac-pro-upgrade-guide.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Definitive Classic Mac Pro (2006-2012) Upgrade Guide",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46057000",
    "title": "Indie game developers have a new sales pitch: being 'AI free'",
    "url": "https://www.theverge.com/entertainment/827650/indie-developers-gen-ai-nexon-arc-raiders",
    "summary": "生成摘要时出错",
    "chinese_title": "Indie game developers have a new sales pitch: being 'AI free'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46009851",
    "title": "Using an Array of Needles to Create Solid Knitted Shapes",
    "url": "https://dl.acm.org/doi/10.1145/3746059.3747759",
    "summary": "生成摘要时出错",
    "chinese_title": "Using an Array of Needles to Create Solid Knitted Shapes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46051345",
    "title": "Ironwood, our latest TPU",
    "url": "https://blog.google/products/google-cloud/ironwood-google-tpu-things-to-know/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ironwood, our latest TPU",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047513",
    "title": "Ozempic does not slow Alzheimer's, study finds",
    "url": "https://www.semafor.com/article/11/25/2025/ozempic-does-not-slow-alzheimers-study-finds",
    "summary": "生成摘要时出错",
    "chinese_title": "Ozempic does not slow Alzheimer's, study finds",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46038047",
    "title": "Claude Advanced Tool Use",
    "url": "https://www.anthropic.com/engineering/advanced-tool-use",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude Advanced Tool Use",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047350",
    "title": "Orion 1.0",
    "url": "https://blog.kagi.com/orion",
    "summary": "生成摘要时出错",
    "chinese_title": "Orion 1.0",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029929",
    "title": "Japan's gamble to turn island of Hokkaido into global chip hub",
    "url": "https://www.bbc.com/news/articles/c8676qpxgnqo",
    "summary": "生成摘要时出错",
    "chinese_title": "Japan's gamble to turn island of Hokkaido into global chip hub",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46017972",
    "title": "Terence Tao: At the Erdos problem website, AI assistance now becoming routine",
    "url": "https://mathstodon.xyz/@tao/115591487350860999",
    "summary": "生成摘要时出错",
    "chinese_title": "Terence Tao: At the Erdos problem website, AI assistance now becoming routine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46037343",
    "title": "The Bitter Lesson of LLM Extensions",
    "url": "https://www.sawyerhood.com/blog/llm-extension",
    "summary": "生成摘要时出错",
    "chinese_title": "The Bitter Lesson of LLM Extensions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46032148",
    "title": "Fifty Shades of OOP",
    "url": "https://lesleylai.info/en/fifty_shades_of_oop/",
    "summary": "生成摘要时出错",
    "chinese_title": "Fifty Shades of OOP",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46042946",
    "title": "Most Stable Raspberry Pi? Better NTP with Thermal Management",
    "url": "https://austinsnerdythings.com/2025/11/24/worlds-most-stable-raspberry-pi-81-better-ntp-with-thermal-management/",
    "summary": "生成摘要时出错",
    "chinese_title": "Most Stable Raspberry Pi? Better NTP with Thermal Management",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045661",
    "title": "Brain has five 'eras' with adult mode not starting until early 30s",
    "url": "https://www.theguardian.com/science/2025/nov/25/brain-human-cognitive-development-life-stages-cambridge-study",
    "summary": "生成摘要时出错",
    "chinese_title": "Brain has five 'eras' with adult mode not starting until early 30s",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46020701",
    "title": "Show HN: Wolfrominoes",
    "url": "https://demos.samgentle.com/wolfrominoes/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Wolfrominoes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029908",
    "title": "The Cloudflare outage might be a good thing",
    "url": "https://gist.github.com/jbreckmckye/32587f2907e473dd06d68b0362fb0048",
    "summary": "生成摘要时出错",
    "chinese_title": "The Cloudflare outage might be a good thing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047229",
    "title": "Roblox is a problem but it's a symptom of something worse",
    "url": "https://www.platformer.news/roblox-ceo-interview-backlash-analysis/",
    "summary": "生成摘要时出错",
    "chinese_title": "Roblox is a problem but it's a symptom of something worse",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46048229",
    "title": "It is ok to say \"CSS variables\" instead of \"custom properties\"",
    "url": "https://blog.kizu.dev/css-variables/",
    "summary": "生成摘要时出错",
    "chinese_title": "It is ok to say \"CSS variables\" instead of \"custom properties\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46051169",
    "title": "Google steers Americans looking for health care into \"junk insurance\"",
    "url": "https://pluralistic.net/2025/11/25/open-season/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google steers Americans looking for health care into \"junk insurance\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46025942",
    "title": "Fran Sans – font inspired by San Francisco light rail displays",
    "url": "https://emilysneddon.com/fran-sans-essay",
    "summary": "生成摘要时出错",
    "chinese_title": "Fran Sans – font inspired by San Francisco light rail displays",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047980",
    "title": "US banks scramble to assess data theft after hackers breach financial tech firm",
    "url": "https://techcrunch.com/2025/11/24/us-banks-scramble-to-assess-data-theft-after-hackers-breach-financial-tech-firm/",
    "summary": "生成摘要时出错",
    "chinese_title": "US banks scramble to assess data theft after hackers breach financial tech firm",
    "chinese_summary": "生成摘要时出错"
  }
]